{"id":1658,"date":"2011-01-28T16:36:38","date_gmt":"2011-01-28T21:36:38","guid":{"rendered":"http:\/\/johnsoncg.wpengine.com\/?p=1658"},"modified":"2015-02-25T17:21:46","modified_gmt":"2015-02-25T17:21:46","slug":"dale-espich-how-is-your-bottom-line","status":"publish","type":"post","link":"https:\/\/www.johnsonconsulting.com\/dale-espich-how-is-your-bottom-line\/","title":{"rendered":"Dale Espich &#8211; How is YOUR Bottom Line?"},"content":{"rendered":"<p>If we are to believe what I have been told recently, you probably are not reaching anything near your funeral home’s potential. (Profits)<\/p>\n<p>According to a national accounting firm with 1500 funeral home clients, the profit margin (as a percentage of sales) of their clients has dropped from 14% in the 1980’s to less than 6% in 2008. That is a massive drop of more than 50% in profits!<\/p>\n<p>It might seem reasonable for a drop in profits with cremation rates in that time frame going from 10% to over 30% in the Midwest.  In addition, the public’s  attitude about tradition is now markedly different than in the past, and the current economy certainly is not helping.<\/p>\n<p>I recently asked several of my colleagues why they felt most funeral homes are failing to reach their profit potential.  Most of the answers were not those listed above in the previous paragraph, but were reasons like “owners do not know their costs”, “owners do not plan”, “owners guess at their pricing”, “owners base their pricing upon that of competitors”, “owners do not understand cost and pricing dynamics”.  You get the idea.<\/p>\n<p>Incidentally, those colleagues of mine collectively have over <span style=\"text-decoration: underline;\">400 years<\/span> of experience closely observing thousands of funeral home operations and the way in which most owners deal with the financial side of their business.  In most cases, it is not a lack of some kind of accounting.  And, with all the funeral software on the market, it is not a shortage of reports a manager can generate.<\/p>\n<p>So, what is the problem causing low profits?  In the past I have presented more than one hundred workshops on pricing and profits, and when I asked my audience how many had calculated their cost of operation, <span style=\"text-decoration: underline;\">it was never over 20%.<\/span>  If you do not know your cost of operation, then all you know is how much your casket and vaults cost, and, therefore, you are guessing about the biggest (by far), your operational cost (think “overhead”), and, of course, <span style=\"text-decoration: underline;\">you are guessing about profits.<\/span><\/p>\n<p>We are not talking Rocket Science here, but we definitely are talking about <strong><span style=\"text-decoration: underline;\">the need to understand your business the same way your doctor understands the human body<\/span><\/strong>.<strong> <\/strong>A medical student begins with a human cadaver and learns about each and every muscle, organ, tendon, blood vessel, skin pigment, every single crack and crevice in the human body so that he, or she, will understand how each part interacts with the rest.<\/p>\n<p>The word <span style=\"text-decoration: underline;\"><strong>understanding<\/strong><\/span> is the key operative word.  Your financials are great for (1) tax preparation and (2) to give to your banker to support your Line of Credit, but they are not a <span style=\"text-decoration: underline;\">management<\/span> tool.  Your funeral software generates zillions of reports, but what does your software tell you about operating costs and the level of income streams you need to coordinate to generate a level or profit that turns out a reasonable Return on Investment (Remember ROI?)<\/p>\n<p>What you need to do is to marry the financials to your statistical reports.  The have to act together, AND, you have to <strong><span style=\"text-decoration: underline;\">understand<\/span> <\/strong>the very bowels of your financial dynamics the same way a doctor understands your body.<\/p>\n<p>You have to be able to <span style=\"text-decoration: underline;\">take your business numbers apart down to the bare bones<\/span>, and <span style=\"text-decoration: underline;\">then put them back together <\/span>so they will act in harmony, and that you are in complete control of what and how your profits are formed, and track progress each and every month to make sure your business is on the course you have planned.<\/p>\n<p>Think about “<span style=\"text-decoration: underline;\">Management<\/span> Information vs. <span style=\"text-decoration: underline;\">Financial<\/span> Information” in this way.  Your financials tell you that you have had hundreds of thousands of dollars in income, cost of goods, and operating expense.  However, your business does not come through the door a hundred thousand dollars at a time; it happens “One Funeral At a Time”, and that is the form in which you need <span style=\"text-decoration: underline;\">Management<\/span> Information.  Until you completely understand everything about your business in terms of “One Funeral At a Time”, you will be <span style=\"text-decoration: underline;\">guessing <\/span>about how much profit you will have—can have—in your business.<\/p>\n<p>Up to now we have talked in global and general terms, Next, I am going to give you a list of your business dynamics, and each and every one demands that you understand what they are and how they all interact together so you are able to <strong><span style=\"text-decoration: underline;\">plan and attain profit margins of at least ten percent year in and year out.<\/span><\/strong><\/p>\n<p><span style=\"text-decoration: underline;\">The Basics of Funeral Business Planning<\/span>:<\/p>\n<p><strong>Case Volume — <\/strong>For a complete understanding of this all-important element requires a minimum of five year’s history with each year a profile of a minimum of casketed adults full service, casketed adults graveside, full service with casket and cremation, visitation and funeral, no casket, cremation, direct cremation, appropriate segments of infants, children and indigents, vault yes or no.  Also useful is application of appropriate statistical measures of averages, trends, Recency weighted Averages, etc.<\/p>\n<p><strong>Operating Expenses — <\/strong>Including interest, discounts, supplies, all expenses except merchandise marked up for re-sale.  Double check your Cost of Goods on your financials to make sure they very closely match the invoice wholesale costs of caskets, urns, clothing, markets.  You need to display and match three years of operating expense history for trends, and make sure that your chart of accounts contains sufficient detail for an <span style=\"text-decoration: underline;\">understanding of all expenses<\/span> and where they are heading in your next business year.<\/p>\n<p><strong>Adult Casket &amp; Service Revenue — <\/strong>With most funeral operations outside of Sunshine states, adult casket funerals are still the cardinal source of income, and a complete <span style=\"text-decoration: underline;\">understanding <\/span>of service charge make-up on the GPL, declination rates and deficiencies, casket selection pricing are all-important records that must be carefully gathered and analyzed\/understood.<\/p>\n<p><strong>Other Revenue Sources — <\/strong>“Other” in this case refers to all revenue coming into your funeral business except the Adult Casketed Service.  Granted, other types of services are gradually cutting into the adult casket services, but, in most cases, it is still the primary source of revenue. With ‘other’ think ‘partial’, whether direct cremation, direct burial, memorial services, cremation with rental caskets, vaults, urns, markers, clothing, extra transportation, etc.  It is necessary to identify how all of these will transpire in planning and how much revenue each needs to generate.<\/p>\n<p><strong>Adult Service Charge — <\/strong>The design and amount of this critical dynamic is so important that one could write page after page about not just the amount, but, as an example, is it “Consumer Friendly”?  As the Federal Trade Rule glides past its 25<sup>th<\/sup> anniversary, many firms still, to this day, do not take advantage of the requirements of the mandated elements and the way in which it\/they can be very friendly to both the consumer and your bottom line. Again, think about the <strong><span style=\"text-decoration: underline;\">understanding<\/span> of the service charge,<\/strong> and how it can be a business partner to you and your firm.<\/p>\n<p><strong>Wholesale Casket Average — <\/strong>Unfortunately, the use of this particular term is usually misunderstood as a measurement for casket sales success for the casket manufacturer.  To the contrary, it is both a measurement and base line that the funeral director needs to grasp, and is a central point in determining how “successful” your selection room is both to your customers and your bottom line.  The wholesale casket average, along with your casket mark-up\/multiple is one the central sources of revenue and projecting profits.<\/p>\n<p><strong>Casket Mark-Up\/Multiple <\/strong>— It is the combination of the Wholesale Casket Average and the Casket Mark-Up (average) that determine the casket margin\/gross profit.  It is not the purpose here to talk high\/low mark-up, but to emphasize that the funeral director owner who does not completely <strong><span style=\"text-decoration: underline;\">understand<\/span><\/strong> the revenue symphony that is generated from the above combination is losing important revenues in large proportions.<\/p>\n<p>It is important to distinguish between casket pricing methods (varying mark-up from high to low), and the <strong><span style=\"text-decoration: underline;\">recovery<\/span> <\/strong>mark-up\/multiple.<\/p>\n<p>As an illustration of the above, in the 1980’s, I did a casket pricing analysis for one of the largest funeral firms in the country how—because of the mark-up formula recommended by his casket supplier—this famous company’s casket <span style=\"text-decoration: underline;\">margin was less<\/span> in the current year than in the previous even though his <span style=\"text-decoration: underline;\">wholesale average was higher<\/span> than last.<\/p>\n<p><strong>Profit Analysis\/Profit Requirements — <\/strong>Return on Investment—ROI for short—is a relatively simple concept. Return on Investment says that if you have an investment of a million dollars, whether in assets or goodwill, that you should be earning a return, and a return that also reflects the fact that in business there is a risk.  This also means you must do some important calculations about the value of your business, how much you deserve in addition as your salary for running a successful business.<\/p>\n<p>If you have never thought in these terms, now would be a good time.  You might very well find that your return (in normal times) with a long term Certificate of Deposit would be better than what you have been bringing in. (And, of course, it should be much more than that)<\/p>\n<p><strong>Selection Room Analysis — <\/strong>This ties in directly with all the above comments on wholesale casket average and mark-up, PLUS, how <span style=\"text-decoration: underline;\">consumer friendly<\/span> your selection room process is.  This analysis must especially address the communication process that takes place between the funeral director arranger and the client-family making arrangements for a loved one.<\/p>\n<p>If the Selection Room Philosophy is on target, and is successful, it is a communication process combining what the room conveys visually and what the message the arranger sends verbally.  Operating in complete harmony, the two entities (what message the room design broadcasts visually, and what the funeral director communicates in his or her verbal explanation) send an important message to the family, and the message results in a better casket selected for all the right reasons, and also results in a higher level of family satisfaction.<\/p>\n<p>With all that at stake, the design, the intent and the philosophy of the selection room must obviously be very carefully planned and executed.<\/p>\n<p><strong>Profit Target — <\/strong>Setting and achieving the appropriate profit target for your firm requires very careful planning and understanding.  You find the proper profit objective as a result of careful research that involves good solid understanding of the value of your firm along with an equal understanding of risk and return on investment.  Once the profit target is selected with the combination of knowledge, understanding and complete conviction of the correct level, then achievement is the next step.<\/p>\n<p><strong>Pricing Specifications — <\/strong>It is necessary to reach a complete understanding of the dynamics of costs, trends, statistics, and financial considerations to draw up a complete set of pricing specifications to achieve a worthy profit target.  Each and every area of service and merchandise, along with the peculiarities of the customer must be carefully taken into consideration.<\/p>\n<p>Consumer-friendly pricing, along with terms that completely eliminate the jargon only understood within the funeral profession, is absolutely mandatory for the ultimate in serving the customer:  This will produce a justifiable level of profit with matching complete satisfaction of the customer&#8212;your client family.<\/p>\n<p><strong>Monitoring Progress — The Management Report — <\/strong>This is the complete tracking system, and you must be careful not to confuse it with any of the myriad of reports that can be generated with your off-the-shelf software.  This may sound confusing, but it is really quite true.  You need reporting and tracking systems that let you know at the end of each month if you are on target with your service charge recovery, your casket and vault averages.<\/p>\n<p>Finally, if you will diligently pursue exhaustive research in the basics above, you will be glad and happy to answer the question, “How is YOUR Bottom Line?” I can guarantee that if you will immerse yourself in analyzing your funeral business, your financial statements, all your statistical elements, you will be very pleasantly surprised at the number of “Aha Moments” you will have and the insight you will gain.  It is the understanding you will gain that will put you in charge of the Bottom Line of your funeral business, increasing both your profits as well as the satisfaction of your families and your staff as well.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>If we are to believe what I have been told recently, you probably are not reaching anything near your funeral home’s potential. (Profits) According to a national accounting firm with 1500 funeral home clients, the profit margin (as a percentage of sales) of their clients has dropped from 14% in the 1980’s to less than [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","inline_featured_image":false,"footnotes":""},"categories":[3],"tags":[],"class_list":["post-1658","post","type-post","status-publish","format-standard","hentry","category-articles"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v21.0 (Yoast SEO v24.3) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Dale Espich - How is YOUR Bottom Line? - Johnson Consulting Group<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.johnsonconsulting.com\/dale-espich-how-is-your-bottom-line\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Dale Espich - How is YOUR Bottom Line?\" \/>\n<meta property=\"og:description\" content=\"If we are to believe what I have been told recently, you probably are not reaching anything near your funeral home’s potential. (Profits) According to a national accounting firm with 1500 funeral home clients, the profit margin (as a percentage of sales) of their clients has dropped from 14% in the 1980’s to less than [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.johnsonconsulting.com\/dale-espich-how-is-your-bottom-line\/\" \/>\n<meta property=\"og:site_name\" content=\"Johnson Consulting Group\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/JohnsonConsulting\" \/>\n<meta property=\"article:published_time\" content=\"2011-01-28T21:36:38+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2015-02-25T17:21:46+00:00\" \/>\n<meta name=\"author\" content=\"JCGAdmin\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@johnsonfuneral\" \/>\n<meta name=\"twitter:site\" content=\"@johnsonfuneral\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"JCGAdmin\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/dale-espich-how-is-your-bottom-line\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/dale-espich-how-is-your-bottom-line\/\"},\"author\":{\"name\":\"JCGAdmin\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/c9c70bea2fea0f478e05fa37ad0f930c\"},\"headline\":\"Dale Espich &#8211; How is YOUR Bottom Line?\",\"datePublished\":\"2011-01-28T21:36:38+00:00\",\"dateModified\":\"2015-02-25T17:21:46+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/dale-espich-how-is-your-bottom-line\/\"},\"wordCount\":2043,\"publisher\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#organization\"},\"articleSection\":[\"Articles\"],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/dale-espich-how-is-your-bottom-line\/\",\"url\":\"https:\/\/www.johnsonconsulting.com\/dale-espich-how-is-your-bottom-line\/\",\"name\":\"Dale Espich - How is YOUR Bottom Line? - Johnson Consulting Group\",\"isPartOf\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#website\"},\"datePublished\":\"2011-01-28T21:36:38+00:00\",\"dateModified\":\"2015-02-25T17:21:46+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/dale-espich-how-is-your-bottom-line\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.johnsonconsulting.com\/dale-espich-how-is-your-bottom-line\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/dale-espich-how-is-your-bottom-line\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.johnsonconsulting.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Dale Espich &#8211; How is YOUR Bottom Line?\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#website\",\"url\":\"https:\/\/www.johnsonconsulting.com\/\",\"name\":\"Johnson Consulting Group\",\"description\":\"Funeral Home and Cemetery Consulting\",\"publisher\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.johnsonconsulting.com\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#organization\",\"name\":\"Johnson Consulting Group\",\"url\":\"https:\/\/www.johnsonconsulting.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png\",\"contentUrl\":\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png\",\"width\":576,\"height\":222,\"caption\":\"Johnson Consulting Group\"},\"image\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/JohnsonConsulting\",\"https:\/\/x.com\/johnsonfuneral\",\"https:\/\/www.linkedin.com\/company\/johnson-consulting-group\/\",\"https:\/\/www.youtube.com\/user\/JohnsonConsultingInc\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/c9c70bea2fea0f478e05fa37ad0f930c\",\"name\":\"JCGAdmin\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/5520c11611a67c1bcae496d454b34b8b?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/5520c11611a67c1bcae496d454b34b8b?s=96&d=mm&r=g\",\"caption\":\"JCGAdmin\"},\"url\":\"https:\/\/www.johnsonconsulting.com\/author\/jcgadmin\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Dale Espich - How is YOUR Bottom Line? - Johnson Consulting Group","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.johnsonconsulting.com\/dale-espich-how-is-your-bottom-line\/","og_locale":"en_US","og_type":"article","og_title":"Dale Espich - How is YOUR Bottom Line?","og_description":"If we are to believe what I have been told recently, you probably are not reaching anything near your funeral home’s potential. (Profits) According to a national accounting firm with 1500 funeral home clients, the profit margin (as a percentage of sales) of their clients has dropped from 14% in the 1980’s to less than [&hellip;]","og_url":"https:\/\/www.johnsonconsulting.com\/dale-espich-how-is-your-bottom-line\/","og_site_name":"Johnson Consulting Group","article_publisher":"https:\/\/www.facebook.com\/JohnsonConsulting","article_published_time":"2011-01-28T21:36:38+00:00","article_modified_time":"2015-02-25T17:21:46+00:00","author":"JCGAdmin","twitter_card":"summary_large_image","twitter_creator":"@johnsonfuneral","twitter_site":"@johnsonfuneral","twitter_misc":{"Written by":"JCGAdmin","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.johnsonconsulting.com\/dale-espich-how-is-your-bottom-line\/#article","isPartOf":{"@id":"https:\/\/www.johnsonconsulting.com\/dale-espich-how-is-your-bottom-line\/"},"author":{"name":"JCGAdmin","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/c9c70bea2fea0f478e05fa37ad0f930c"},"headline":"Dale Espich &#8211; How is YOUR Bottom Line?","datePublished":"2011-01-28T21:36:38+00:00","dateModified":"2015-02-25T17:21:46+00:00","mainEntityOfPage":{"@id":"https:\/\/www.johnsonconsulting.com\/dale-espich-how-is-your-bottom-line\/"},"wordCount":2043,"publisher":{"@id":"https:\/\/www.johnsonconsulting.com\/#organization"},"articleSection":["Articles"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/www.johnsonconsulting.com\/dale-espich-how-is-your-bottom-line\/","url":"https:\/\/www.johnsonconsulting.com\/dale-espich-how-is-your-bottom-line\/","name":"Dale Espich - How is YOUR Bottom Line? - Johnson Consulting Group","isPartOf":{"@id":"https:\/\/www.johnsonconsulting.com\/#website"},"datePublished":"2011-01-28T21:36:38+00:00","dateModified":"2015-02-25T17:21:46+00:00","breadcrumb":{"@id":"https:\/\/www.johnsonconsulting.com\/dale-espich-how-is-your-bottom-line\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.johnsonconsulting.com\/dale-espich-how-is-your-bottom-line\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.johnsonconsulting.com\/dale-espich-how-is-your-bottom-line\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.johnsonconsulting.com\/"},{"@type":"ListItem","position":2,"name":"Dale Espich &#8211; How is YOUR Bottom Line?"}]},{"@type":"WebSite","@id":"https:\/\/www.johnsonconsulting.com\/#website","url":"https:\/\/www.johnsonconsulting.com\/","name":"Johnson Consulting Group","description":"Funeral Home and Cemetery Consulting","publisher":{"@id":"https:\/\/www.johnsonconsulting.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.johnsonconsulting.com\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.johnsonconsulting.com\/#organization","name":"Johnson Consulting Group","url":"https:\/\/www.johnsonconsulting.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/","url":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png","contentUrl":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png","width":576,"height":222,"caption":"Johnson Consulting Group"},"image":{"@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/JohnsonConsulting","https:\/\/x.com\/johnsonfuneral","https:\/\/www.linkedin.com\/company\/johnson-consulting-group\/","https:\/\/www.youtube.com\/user\/JohnsonConsultingInc"]},{"@type":"Person","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/c9c70bea2fea0f478e05fa37ad0f930c","name":"JCGAdmin","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/5520c11611a67c1bcae496d454b34b8b?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/5520c11611a67c1bcae496d454b34b8b?s=96&d=mm&r=g","caption":"JCGAdmin"},"url":"https:\/\/www.johnsonconsulting.com\/author\/jcgadmin\/"}]}},"_links":{"self":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/posts\/1658","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/comments?post=1658"}],"version-history":[{"count":0,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/posts\/1658\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/media?parent=1658"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/categories?post=1658"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/tags?post=1658"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}