{"id":2061,"date":"2011-12-05T14:06:04","date_gmt":"2011-12-05T19:06:04","guid":{"rendered":"http:\/\/johnsoncg.wpengine.com\/?p=2061"},"modified":"2015-02-25T17:10:06","modified_gmt":"2015-02-25T17:10:06","slug":"a-wake-up-call-are-you-a-party-planner-or-a-creator-of-meaningful-funeral-experiences-alan-d-wolfelt-ph-d","status":"publish","type":"post","link":"https:\/\/www.johnsonconsulting.com\/a-wake-up-call-are-you-a-party-planner-or-a-creator-of-meaningful-funeral-experiences-alan-d-wolfelt-ph-d\/","title":{"rendered":"A Wake-Up Call: Are you a Party Planner or a Creator of Meaningful Funeral Experiences &#8211; Alan D. Wolfelt, Ph.D."},"content":{"rendered":"<p>Perhaps it is time for a &#8220;wake-up&#8221; call!&#8221; There is an undeniable truth that more and more people are saying things like: &#8220;When I die, just get rid of me&#8230;no muss, no fuss. Maybe you can throw a party, but I sure don&#8217;t want a funeral!&#8221; I believe it is time for those of you committed to the future of funeral service to firmly choose your course &#8211; or the relentless drift of events will make decisions for you.<\/p>\n<p>How many families have walked through your doors in recent years requesting not a funeral, but a &#8220;celebration&#8221; or a &#8220;party?&#8221; Quite a few, if the conversations I regularly have with my friends in funeral service are any indication. Of even more concern, do you think your helping role is to create one of these two options for families? While it is tempting to think your job is to create a celebration or a party when that is what is being requested, I would urge all of us to pause for a moment and consider what&#8217;s best for families served.<\/p>\n<p>We are witnessing, and I suggest even colluding with a powerful trend of movement toward celebrations and parties and away from meaningful funeral experiences. While you may not be consciously participating in this trend, you are at risk for unknowingly collaborating with a culture that is trying to go <em>around<\/em> their grief instead of <em>through<\/em> their grief.<\/p>\n<p><strong>The difference between &#8220;fun parties&#8221; and meaningful experiences<\/strong><\/p>\n<p>With such jam-packed, fast-paced lives, people have become accustomed to paying for experiences that they have neither the know-how nor the time to create for themselves. Today, many people are willing to pay someone to provide all aspects of an event. We now have party and wedding planners to take care of the details for finding the venue, sending out invitations, arranging the food and music, setting the mood, decorating, and managing the flow of events. These events are expected to not only entertain, but to delight our five senses as well.<\/p>\n<p>Inherent in this trend is the relatively recent emphasis we 20th and 21st century generations place on fun. Not that many decades ago, leisure time was unheard of &#8211; or at best the rare privilege of the monied class. Most of humanity spent day in and day out struggling to provide themselves with food, water, and shelter. Today, thanks to industrialization, medical advancements, and better education, many of us have a number of hours each day to relax and have fun. And instead of constantly worrying about where our next meal and month&#8217;s rent are coming from, we have the discretionary income to pay large admission prices to be swept away in a fantasy of water delights, rides, and shows of amazing feats.<\/p>\n<p>I darsay that we as a North American culture have become confused. Many of us now believe that having fun, feeling joy (and surprise), and being entertained are what having an experience is all about. And regretfully, we&#8217;ve transferred this idea onto funerals. To borrow a phrase from the musical group R.E.M., we &#8220;shiny, happy people&#8221; have forgotten that the purpose of a funeral is to mourn, to actively and outwardly embrace the death of someone we love.<\/p>\n<p>We have confused honoring with celebration and celebration with partying.<\/p>\n<p>While the Latin word for celebrate is &#8220;celebrate&#8221; or &#8220;to honor,&#8221; the colloquial definition, according to <em>Webster&#8217;s New World Dictionary<\/em>, is to &#8220;have a good time.&#8221; Yet deep down, our <em>true <\/em>intentions when someone loved dies are to honor him or her, not to have a good time. This is where the confusion lies.<\/p>\n<p>Furthermore, Webster defines party as &#8220;a gathering for social entertainment.&#8221; If asked flat out if that is what they want for the funeral, most family members will say no. Therefore, when we simply go along with a family&#8217;s initial request to create a celebration for the person who died, we are not giving them what they truly, deep-down, want and need.<\/p>\n<p><strong>A party&#8230;where the guest of honor is missing?<\/strong><\/p>\n<p>With the trend towards funeral celebrations or parties has come an avoidance of the person who died altogether, which explains to some extent the growing popularity of cremation. Many people now say, &#8220;I&#8217;ll just remember them the way they were when they were alive.&#8221;<\/p>\n<p>As Thomas G. Long observed in a recent <em>New York Times<\/em> article,<\/p>\n<p>&#8220;&#8230;as a society, Americans are  no longer sure what to do with their dead&#8230;Today, our death rituals have become downsized, inwardly directed, static and, as a result, spiritually and culturally impoverished&#8230;at upbeat celebrations of life&#8230;the dead&#8230;are usually nowhere to be seen. For the first time in history, the actual presence of the dead at their own funerals has become optional, even undesirable, lest the body break the illusion of a cloudless celebration.&#8221;<\/p>\n<p>The tragedy is that often no one helps the family understand that seeing someone dead does not typically become, as they fear it will, their lasting &#8220;memory picture.&#8221; In contrast, it is in seeing someone dead that we truly begin to acknowledge the death and appropriately shift the relationship to one of memory. Seeing the dead body of someone we have loved is often the beginning of a more essential, active grief process. It&#8217;s the saying of hello on the pathway to goodbye.<\/p>\n<p><strong>Yes, meaningful funerals are painful<\/strong><\/p>\n<p>What reinforces this desire for fun, entertainment, and celebration is that mourning is painful, and not something people readily sign up to do. There&#8217;s a perception that it is easier and better to celebrate than to express the emotions of sadness and hurt. As our society has become increasingly &#8220;mourning-avoidant,&#8221; we have seen this shift toward celebrations. (Sadly, many funeral directors as well as clergy have unknowingly furthered this trend.)<\/p>\n<p>Celebrations play well into the idea that people need to be strong and get over it quickly. There&#8217;s no time to grieve or mourn; rather, families hear such messages as &#8220;Carry on,&#8221; Keep your chin up,&#8221; &#8220;They&#8217;re in a better place,&#8221; and &#8220;You just need to let go.&#8221; Celebrations often deny the authentic suffering of the soul, whereas authentic funerals invite an encounter with the mystery.<\/p>\n<p>In their attempt to celebrate, families miss the ancient and still essential purpose of funerals, which is to create an invitation to mourn openly and honestly. Historically, funerals honored the need for downward movement-going through grief rather than around it. Authentic mourning demands that we slow down, befriend dark emotions, and seek and accept support. Doing so helps place the loss in a larger, transcendent realm of meaning. Obviously, some people in funeral service have either never learned or have forgotten the WHY of a meaningful funeral.<\/p>\n<p>While families may be tempted to make swift, clean breaks from their loss, it does not ultimately service them. When people do not feel their feelings, they become unable to be changed by them. Instead of experiencing movement through their loss, they become stuck. They experience chronic grief that affects all other areas of their lives, sometimes resulting in depression, anxiety, disconnection from others, substance abuse, and fatigue. This &#8220;carried grief&#8221; results in a muting of one&#8217;s spirit, or &#8220;divine spark.&#8221;<\/p>\n<p>The more people try to &#8220;party&#8221; in the face of loss, the more they end up grieving and not mourning. Grief is an internal response to loss, where mourning is an outward expression of grief, a shared, social response to loss. The major purpose of a meaningful ceremony is to begin to convert grief into mourning in the loving and supportive company of others who share our grief. In the movement of mourning, grief has the opportunity to be felt, embraced, and healed.<\/p>\n<p><strong>A blend of laughter and sadness&#8230;and all the other authentic emotions of grief<\/strong><\/p>\n<p>Of course, this is not to say that a meaningful funeral should be totally devoid of celebration and laughter. As you know, funny anecdotes about the person who died and jokes delivered during the eulogy are often a welcome and necessary part of the experience. When someone loved dies, we feel many feelings, including the bittersweet joy of reliving favorite memories. Sharing those memories is part of the journey too &#8211; one that gives us moments of relief even as we dose ourselves with the necessary sadness.<\/p>\n<p>I also do not mean to downplay the necessity of providing a full funeral <em>experience<\/em> for the families you serve. In my book <em>Funeral Home Customer Service A-Z<\/em>, I discuss at length the importance of creating a full-blown experience &#8211; not just a perfunctory ceremony. I believe as much as ever that a rich, highly personalized funeral experience has the power to help families profoundly embrace their grief and set the stage for the transformative healing journey to come.<\/p>\n<p>What I am emphasizing here is the increasingly essential need to differentiate between funeral experiences that encourage the full range of emotions, from deep sadness to moments of levity, and experiences that families today are calling &#8220;parties.&#8221; Many of these so-called &#8220;parties&#8221; are intentionally designed to merely skim the surface of our sadness &#8211; or ignore it altogether &#8211; and instead to focus on the thinking of happy thoughts. Recently a distraught woman came to see me who had been intentionally excluded from the &#8220;funeral party&#8221; her family was planning for her favorite uncle. As they explained to her, they knew she was close to him and would cry at the funeral; therefore, she would not be allowed to attend.<\/p>\n<p><strong>People crave the <em>why<\/em><\/strong><\/p>\n<p>So, let&#8217;s save parties for those events where celebration and fun are supposed to occur-such milestones and transitions as birthdays, weddings, graduations and baby showers. Instead, let&#8217;s give families what they deeply need &#8211; a meaningful ceremony where the person who dies is not only celebrated, but mourned and loved. By all means, create an experience for your families; just make sure the person who dies and the true, full range of feelings that have resulted from the death are at the center. Create an opportunity for families to recognize and embrace all their feelings around their loss. In doing so, you will have truly honored the culmination of life, and the ultimate transition of a death, for the families you are privileged to service.<\/p>\n<p>What&#8217;s more, it&#8217;s good business to truly serve families in this manner. While they may walk through your doors requesting a &#8220;celebration&#8221; or &#8220;party,&#8221; if you are willing to dig deep and mentor them in the planning of a truly meaningful, personalized funeral experience, they will walk <em>out<\/em> your doors profoundly moved and satisfied.<\/p>\n<p>As author Simon Sinek has observed, &#8220;People don&#8217;t buy <em>what<\/em> you do, they buy <em>why <\/em>you do it.&#8221; If your funeral home&#8217;s <em>why <\/em>is to create meaningful funeral experiences for families, your community will see that as a differentiator and seek you out as the provider of such truly transformative experiences. Over time, the families you serve will become educated about the true value of funerals and appreciate the gift you have given them. They will tell everyone they know what a wonderful funeral &#8211; not a celebration or party &#8211; you helped them create.<\/p>\n<p>Lots of people can plan a good party, but only funeral directors have the experience and the understanding to plan a meaningful funeral experience. In doing so, you may just help save your own vocation, which is at risk for becoming extinct.<\/p>\n<p>Visit Alan Wolfelt&#8217;s website at <a href=\"https:\/\/www.centerforloss.com\/\" target=\"_blank\">www.centerforloss.com<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Perhaps it is time for a &#8220;wake-up&#8221; call!&#8221; There is an undeniable truth that more and more people are saying things like: &#8220;When I die, just get rid of me&#8230;no muss, no fuss. Maybe you can throw a party, but I sure don&#8217;t want a funeral!&#8221; I believe it is time for those of you [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","inline_featured_image":false,"footnotes":""},"categories":[3],"tags":[],"class_list":["post-2061","post","type-post","status-publish","format-standard","hentry","category-articles"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v21.0 (Yoast SEO v24.3) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>A Wake-Up Call: Are you a Party Planner or a Creator of Meaningful Funeral Experiences - Alan D. Wolfelt, Ph.D. - Johnson Consulting Group<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.johnsonconsulting.com\/a-wake-up-call-are-you-a-party-planner-or-a-creator-of-meaningful-funeral-experiences-alan-d-wolfelt-ph-d\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"A Wake-Up Call: Are you a Party Planner or a Creator of Meaningful Funeral Experiences - Alan D. Wolfelt, Ph.D.\" \/>\n<meta property=\"og:description\" content=\"Perhaps it is time for a &#8220;wake-up&#8221; call!&#8221; There is an undeniable truth that more and more people are saying things like: &#8220;When I die, just get rid of me&#8230;no muss, no fuss. Maybe you can throw a party, but I sure don&#8217;t want a funeral!&#8221; I believe it is time for those of you [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.johnsonconsulting.com\/a-wake-up-call-are-you-a-party-planner-or-a-creator-of-meaningful-funeral-experiences-alan-d-wolfelt-ph-d\/\" \/>\n<meta property=\"og:site_name\" content=\"Johnson Consulting Group\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/JohnsonConsulting\" \/>\n<meta property=\"article:published_time\" content=\"2011-12-05T19:06:04+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2015-02-25T17:10:06+00:00\" \/>\n<meta name=\"author\" content=\"JCGAdmin\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@johnsonfuneral\" \/>\n<meta name=\"twitter:site\" content=\"@johnsonfuneral\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"JCGAdmin\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/a-wake-up-call-are-you-a-party-planner-or-a-creator-of-meaningful-funeral-experiences-alan-d-wolfelt-ph-d\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/a-wake-up-call-are-you-a-party-planner-or-a-creator-of-meaningful-funeral-experiences-alan-d-wolfelt-ph-d\/\"},\"author\":{\"name\":\"JCGAdmin\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/c9c70bea2fea0f478e05fa37ad0f930c\"},\"headline\":\"A Wake-Up Call: Are you a Party Planner or a Creator of Meaningful Funeral Experiences &#8211; Alan D. Wolfelt, Ph.D.\",\"datePublished\":\"2011-12-05T19:06:04+00:00\",\"dateModified\":\"2015-02-25T17:10:06+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/a-wake-up-call-are-you-a-party-planner-or-a-creator-of-meaningful-funeral-experiences-alan-d-wolfelt-ph-d\/\"},\"wordCount\":1930,\"publisher\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#organization\"},\"articleSection\":[\"Articles\"],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/a-wake-up-call-are-you-a-party-planner-or-a-creator-of-meaningful-funeral-experiences-alan-d-wolfelt-ph-d\/\",\"url\":\"https:\/\/www.johnsonconsulting.com\/a-wake-up-call-are-you-a-party-planner-or-a-creator-of-meaningful-funeral-experiences-alan-d-wolfelt-ph-d\/\",\"name\":\"A Wake-Up Call: Are you a Party Planner or a Creator of Meaningful Funeral Experiences - Alan D. Wolfelt, Ph.D. - Johnson Consulting Group\",\"isPartOf\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#website\"},\"datePublished\":\"2011-12-05T19:06:04+00:00\",\"dateModified\":\"2015-02-25T17:10:06+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/a-wake-up-call-are-you-a-party-planner-or-a-creator-of-meaningful-funeral-experiences-alan-d-wolfelt-ph-d\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.johnsonconsulting.com\/a-wake-up-call-are-you-a-party-planner-or-a-creator-of-meaningful-funeral-experiences-alan-d-wolfelt-ph-d\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/a-wake-up-call-are-you-a-party-planner-or-a-creator-of-meaningful-funeral-experiences-alan-d-wolfelt-ph-d\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.johnsonconsulting.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"A Wake-Up Call: Are you a Party Planner or a Creator of Meaningful Funeral Experiences &#8211; Alan D. Wolfelt, Ph.D.\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#website\",\"url\":\"https:\/\/www.johnsonconsulting.com\/\",\"name\":\"Johnson Consulting Group\",\"description\":\"Funeral Home and Cemetery Consulting\",\"publisher\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.johnsonconsulting.com\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#organization\",\"name\":\"Johnson Consulting Group\",\"url\":\"https:\/\/www.johnsonconsulting.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png\",\"contentUrl\":\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png\",\"width\":576,\"height\":222,\"caption\":\"Johnson Consulting Group\"},\"image\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/JohnsonConsulting\",\"https:\/\/x.com\/johnsonfuneral\",\"https:\/\/www.linkedin.com\/company\/johnson-consulting-group\/\",\"https:\/\/www.youtube.com\/user\/JohnsonConsultingInc\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/c9c70bea2fea0f478e05fa37ad0f930c\",\"name\":\"JCGAdmin\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/5520c11611a67c1bcae496d454b34b8b?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/5520c11611a67c1bcae496d454b34b8b?s=96&d=mm&r=g\",\"caption\":\"JCGAdmin\"},\"url\":\"https:\/\/www.johnsonconsulting.com\/author\/jcgadmin\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"A Wake-Up Call: Are you a Party Planner or a Creator of Meaningful Funeral Experiences - Alan D. Wolfelt, Ph.D. - Johnson Consulting Group","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.johnsonconsulting.com\/a-wake-up-call-are-you-a-party-planner-or-a-creator-of-meaningful-funeral-experiences-alan-d-wolfelt-ph-d\/","og_locale":"en_US","og_type":"article","og_title":"A Wake-Up Call: Are you a Party Planner or a Creator of Meaningful Funeral Experiences - Alan D. Wolfelt, Ph.D.","og_description":"Perhaps it is time for a &#8220;wake-up&#8221; call!&#8221; There is an undeniable truth that more and more people are saying things like: &#8220;When I die, just get rid of me&#8230;no muss, no fuss. Maybe you can throw a party, but I sure don&#8217;t want a funeral!&#8221; I believe it is time for those of you [&hellip;]","og_url":"https:\/\/www.johnsonconsulting.com\/a-wake-up-call-are-you-a-party-planner-or-a-creator-of-meaningful-funeral-experiences-alan-d-wolfelt-ph-d\/","og_site_name":"Johnson Consulting Group","article_publisher":"https:\/\/www.facebook.com\/JohnsonConsulting","article_published_time":"2011-12-05T19:06:04+00:00","article_modified_time":"2015-02-25T17:10:06+00:00","author":"JCGAdmin","twitter_card":"summary_large_image","twitter_creator":"@johnsonfuneral","twitter_site":"@johnsonfuneral","twitter_misc":{"Written by":"JCGAdmin","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.johnsonconsulting.com\/a-wake-up-call-are-you-a-party-planner-or-a-creator-of-meaningful-funeral-experiences-alan-d-wolfelt-ph-d\/#article","isPartOf":{"@id":"https:\/\/www.johnsonconsulting.com\/a-wake-up-call-are-you-a-party-planner-or-a-creator-of-meaningful-funeral-experiences-alan-d-wolfelt-ph-d\/"},"author":{"name":"JCGAdmin","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/c9c70bea2fea0f478e05fa37ad0f930c"},"headline":"A Wake-Up Call: Are you a Party Planner or a Creator of Meaningful Funeral Experiences &#8211; Alan D. Wolfelt, Ph.D.","datePublished":"2011-12-05T19:06:04+00:00","dateModified":"2015-02-25T17:10:06+00:00","mainEntityOfPage":{"@id":"https:\/\/www.johnsonconsulting.com\/a-wake-up-call-are-you-a-party-planner-or-a-creator-of-meaningful-funeral-experiences-alan-d-wolfelt-ph-d\/"},"wordCount":1930,"publisher":{"@id":"https:\/\/www.johnsonconsulting.com\/#organization"},"articleSection":["Articles"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/www.johnsonconsulting.com\/a-wake-up-call-are-you-a-party-planner-or-a-creator-of-meaningful-funeral-experiences-alan-d-wolfelt-ph-d\/","url":"https:\/\/www.johnsonconsulting.com\/a-wake-up-call-are-you-a-party-planner-or-a-creator-of-meaningful-funeral-experiences-alan-d-wolfelt-ph-d\/","name":"A Wake-Up Call: Are you a Party Planner or a Creator of Meaningful Funeral Experiences - Alan D. Wolfelt, Ph.D. - Johnson Consulting Group","isPartOf":{"@id":"https:\/\/www.johnsonconsulting.com\/#website"},"datePublished":"2011-12-05T19:06:04+00:00","dateModified":"2015-02-25T17:10:06+00:00","breadcrumb":{"@id":"https:\/\/www.johnsonconsulting.com\/a-wake-up-call-are-you-a-party-planner-or-a-creator-of-meaningful-funeral-experiences-alan-d-wolfelt-ph-d\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.johnsonconsulting.com\/a-wake-up-call-are-you-a-party-planner-or-a-creator-of-meaningful-funeral-experiences-alan-d-wolfelt-ph-d\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.johnsonconsulting.com\/a-wake-up-call-are-you-a-party-planner-or-a-creator-of-meaningful-funeral-experiences-alan-d-wolfelt-ph-d\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.johnsonconsulting.com\/"},{"@type":"ListItem","position":2,"name":"A Wake-Up Call: Are you a Party Planner or a Creator of Meaningful Funeral Experiences &#8211; Alan D. Wolfelt, Ph.D."}]},{"@type":"WebSite","@id":"https:\/\/www.johnsonconsulting.com\/#website","url":"https:\/\/www.johnsonconsulting.com\/","name":"Johnson Consulting Group","description":"Funeral Home and Cemetery Consulting","publisher":{"@id":"https:\/\/www.johnsonconsulting.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.johnsonconsulting.com\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.johnsonconsulting.com\/#organization","name":"Johnson Consulting Group","url":"https:\/\/www.johnsonconsulting.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/","url":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png","contentUrl":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png","width":576,"height":222,"caption":"Johnson Consulting Group"},"image":{"@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/JohnsonConsulting","https:\/\/x.com\/johnsonfuneral","https:\/\/www.linkedin.com\/company\/johnson-consulting-group\/","https:\/\/www.youtube.com\/user\/JohnsonConsultingInc"]},{"@type":"Person","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/c9c70bea2fea0f478e05fa37ad0f930c","name":"JCGAdmin","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/5520c11611a67c1bcae496d454b34b8b?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/5520c11611a67c1bcae496d454b34b8b?s=96&d=mm&r=g","caption":"JCGAdmin"},"url":"https:\/\/www.johnsonconsulting.com\/author\/jcgadmin\/"}]}},"_links":{"self":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/posts\/2061","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/comments?post=2061"}],"version-history":[{"count":0,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/posts\/2061\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/media?parent=2061"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/categories?post=2061"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/tags?post=2061"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}