{"id":2189,"date":"2012-06-07T16:01:28","date_gmt":"2012-06-07T21:01:28","guid":{"rendered":"http:\/\/johnsoncg.wpengine.com\/?p=2189"},"modified":"2012-06-07T16:01:28","modified_gmt":"2012-06-07T21:01:28","slug":"reflections-on-the-ultimate-death-symbol-saying-hello-on-the-pathway-to-goodbye","status":"publish","type":"post","link":"https:\/\/www.johnsonconsulting.com\/reflections-on-the-ultimate-death-symbol-saying-hello-on-the-pathway-to-goodbye\/","title":{"rendered":"Reflections on the “Ultimate Death Symbol”: Saying Hello on the Pathway to Goodbye"},"content":{"rendered":"<p>by Alan D. Wolfelt, Ph.D<\/p>\n<p><em>“For the first time in history, the actual presence of the dead at their own funerals has become optional, even undesirable, lest the body break the illusion of a cloudless celebration, spoil the meditative mood, and reveal the truths about grief, life and death that our thinned-out ceremonies cannot bear.”<\/em><\/p>\n<p>—    <em>Thomas G. Long<\/em><\/p>\n<p>I’m sure you have noticed the trend toward more and more body-absent ceremonies, which can seem more like parties than authentic funeral experiences.  While historically we understood the essential, universal need to honor and affirm the life of the person who died with the body present throughout the entire funeral process, now the guest of honor is often missing in action.<\/p>\n<p>How many of you frequently hear families say, “Oh, we’ll just remember her the way she was when she was alive…” or “Seeing the body is barbaric and unnecessary”? Yet I submit that there is nothing barbaric about facing the death of someone loved openly and honestly. <\/p>\n<p>We seem to be forgetting what many have known since the beginning of time. Throughout human history, clans and tribes revered and stayed present to the body until it was laid to final rest. Cultures the world over have always demonstrated a passion to recover the “fallen warrior” and dignify the death by bringing home the body. While not all faith communities find it appropriate to spend time with the body and we must always remain respectful of religious beliefs precluding this practice, for most people the body has forever been the most sacred and central element of the funeral process. <\/p>\n<p>The term “wake” originated from the custom of watching or guarding a dead body the full distance to the grave. Unfortunately, many cemeteries today prefer the ceremony end not at the graveside but in a chapel, where, as Thomas Lynch astutely observed, participants are “dispatched without delay, freeing up the burial crew to get on with their business unimpeded.” Sadly, we have forgotten that staying with the body to the place of final farewell helps us acknowledge the reality that this person is leaving us now. It is what I call a “good-hard experience” to encounter. Now, many families cannot get rid of the body fast enough, let alone accompany it to the grave. <\/p>\n<p>As Thomas G. Long has observed in his book <em>Accompany Them With Singing: The Christian Funeral: <\/em><\/p>\n<p>In short, we are carrying a loved one to the edge of the mystery, and people should be encouraged to stick around to the end, to book passage all the way. If the body is to be buried, go to the grave and stay there until the body is in the ground. If the body is to be burned, go to the crematorium and witness the burning.<\/p>\n<p>I’m reminded of the morning of Thursday, May 30, 2002, when a fire bell rang 20 times and bugles played “America the Beautiful.” After nearly nine months, a simple yet profound ceremony signified the end of the search and body recovery effort at Ground Zero, the site of the World Trade Center atrocities. Perhaps the most striking part of this ceremony was the reminder that many survivors never had the chance to spend time with the bodies of those they loved. Workers slowly carried an empty stretcher up a 500-foot ramp to a waiting ambulance, poignantly acknowledging the fact when the “the ultimate death symbol”—the body—is not seen and honored, a critical part of the process of death and mourning is missing as well. <\/p>\n<p>More recently, on the 10<sup>th <\/sup>anniversary of September 11<sup>th<\/sup>, another ceremony was held at Ground Zero. While neither ceremony created “closure,” they did foster some divine momentum in a healing process that will never truly end. We often observe natural complications in the mourning process when we cannot confirm the reality by seeing and spending time with the dead body of someone who has been precious to us.<\/p>\n<p><strong>For Some, Direct Cremation As A Means of Avoidance<\/strong><\/p>\n<p>As the cremation rate continues to rise (in the U.S., the national rate is approaching 40 percent and is predicted to be over 50 percent halfway into the coming decade), more and more people seem to be saying, “When I die, just cremate me. Maybe you can throw a party, but I sure don’t want a funeral.”<\/p>\n<p>Without doubt, this is another contributor to the body-less ceremony (if there is any ceremony at all). I contend that for many people, direct cremation, which is often expressed as a desire for “simplicity and cost-efficiency,” is actually a reflection of our North American desire to try to go around grief instead of through it. In attempting to “not be a burden” to one’s survivors, many people are in fact achieving the opposite. They are burdening their survivors with more protracted, complicated grief by taking away their opportunity to say hello on the pathway to goodbye.<\/p>\n<p>For some, the decision to cremate with no services projects a total lack of understanding of the function of the “ultimate death symbol.” Trying to make it easier for their family and friends, they unknowingly make it harder. While disposing of the body expeditiously seems “easier and more efficient,” in reality it often creates an ever greater disconnect for the family and friends of the person who died.<\/p>\n<p>The problem is not that we cremate the dead. As you know, cremation has been an ancient, honorable, and effective means of disposition in many cultures for millennia. The problem lies in how lacking in elements of meaningful ceremony we have allowed the practice to become. We should be concerned with the <em>how<\/em> and <em>why<\/em>, not the <em>what.<\/em><\/p>\n<p><strong>How the Presence of the Body Helps Grief Become Mourning<\/strong><\/p>\n<p>You may have noticed that the families you serve tend to use the words “grieving” and “mourning” interchangeably. There is a critical distinction, however. We as humans move toward integrating loss into our lives not just by grieving but by mourning.<\/p>\n<p><em>Grief <\/em>is the constellation of internal thoughts and feelings we have when someone we love dies. Think of grief as the container. It holds your thoughts, feelings, and images of your experience when someone you love dies. In other words, grief is the internal meaning given to the experience of loss.<\/p>\n<p><em>Mourning<\/em> is when you take the grief you have on the inside and express it outside of yourself. Another way of defining mourning is “grief gone public” or “the outward expression of grief.”<\/p>\n<p>When families make the choice to not just grieve but authentically mourn, they muster the courage and confidence to integrate the death into their ongoing lives. By authentic mourning, I mean openly and honestly expressing their thoughts and feelings from the inside to the outside—no pretense, no repression, no inhibitions. Somewhere in the collision between the heart, which searches for permanency and connection, and the brain, which acknowledges separation and loss, there is a need for all of us to authentically mourn.<\/p>\n<p>Authentic mourning means being consciously aware of the painful emotions of grief and feeling safe to express them. This may seem odd, because your initial response following loss is instinctive and organic. The loss has taken place, and you naturally feel core feelings such as helplessness, anxiety, fear, despair, protest, and sadness.<\/p>\n<p>The opposite of befriending pain and allowing ourselves to mourn is <em>control<\/em>. Underneath the controlling impulse is <em>fear<\/em>: the fear that we will experience feelings that are painful. As grief enters our lives, many people have been taught that giving these feelings too much attention is a sign of weakness or breakdown. I believe we control because we are afraid of the emotions that grief brings our way. We don’t like being overcome by waves of grief and sorrow. We don’t like losing “control.”<\/p>\n<p>Herein likes the paradox. A wide range of instinctive responses naturally occur, but each of us gets to decide if we will truly experience these responses or instead inhibit, suppress, or deny them. Choosing to stay away from the dead body only helps people to inhibit and even deny their true feelings. It is often a choice to try to keep their feelings inside, to grieve but not authentically mourn.<\/p>\n<p>Of course, there are a multitude of reasons we might choose to grieve and not mourn. Our pain may seem intolerable. Since mourning won’t bring back the person who died, we may rationally try to “put it behind us.”<\/p>\n<p>Yet mourning is what makes it possible for us to experience, eventually, a sense of renewed meaning and purpose in our lives. The emotions we sometimes most want to avoid are the ones we most need to attend to. Authentic mourning is anchored in making the conscious choice to allow ourselves to mourn, to recognize that darkness sometimes precedes light, and to seek healing, repair, and transformation of our very being. And until we come to realize there is a natural, normal mourning experience that can result in meaningful transformation, we have little awareness of the need to experience the pain of grief.<\/p>\n<p>Specific to the dead body, I often hear people say, “Well, it’s just a shell.” Of course, this is an attempt to render the body irrelevant and makes it disposable. Then the family can just focus on a “celebration” and make a swift, clean break from the loss. Yet, the more people try to “party” in the face of loss, the more they end up grieving and not mourning. These body-absent “parties” are often intentionally designed to merely skim the surface of our sadness—or ignore it altogether—and instead to focus on thinking happy thoughts.<\/p>\n<p>Of course, I don’t need to tell <em>you<\/em> that a dead body is not the same as the person we loved. No matter your spiritual beliefs, it is clear to anyone who spends any time at all with the dead body of someone they cared about that the soul no longer resides there. But when we are grieving—even those of us whose callings surround us with death and grief day in and day out—the mind seeks proof. So, if we are fortunate, we see the body, we touch the body, we spend time with the body…and our minds, which so very much want to deny the truth, cannot help but begin the process of acknowledging the reality of the death.<\/p>\n<p>Bereavement originates from the word “reave,” meaning “to be deprived of” or “to be forcibly robbed of something.” When we experience the death of someone loved, we are indeed forcibly robbed of something very precious to us. But for a short time—a few hours or days after the death—we have the precious opportunity to still be <em>with<\/em> the person who died, in the form of the dead body, even as we have no choice but to begin to take leave of him. So, not only is the dead body “proof” for our logical mind, it is a means of transition for our searching heart, which so much yearns to still be with the person. It can—in a way that can feel uncomfortable and painful in the moment but is ultimately helpful and healing.<\/p>\n<p>And what of the common objection, “I don’t want to remember her that way”? My experience suggests that the image of the person in death does not become the lasting image in the mind of the survivor. While the sight and presence of the dead body meets the cognitive need to verify the death, that very image usually fades and it is the living memories that are everlasting.<\/p>\n<p>I’ll never forget my own personal experience at my father’s funeral. I’m standing at his body and having some tears. I hear a lady over to the side of the room say, “That is his son, Alan. He has written more than twenty books on grief, but he isn’t holding up very well.” I had to laugh as I allowed myself to continue to openly and honestly mourn.<\/p>\n<p>As you meet with families in need to educate them and provide them with choices that will help them mourn—including spending time with the body—you have a multitude of forces working against you. Our mourning-avoidant, impatient-with-grief culture has taught them to feel as little as possible and get it over with as quickly as possible. Yet you also know that if you are able to help them make the choice to authentically mourn, you will be helping them return to life, to living, and to loving! <\/p>\n<p><strong>Understanding the Value of Feeling When Spending Time With the Dead Body<\/strong><\/p>\n<p>The function or purpose of symbols, in this situation the dead body, is, in part, to facilitate the expression of feelings. The word “feeling” comes from the Indo-European root that means “touch.” To feel is activate your capacity to be touched and changed by experiences you encounter along life’s path.<\/p>\n<p>To integrate grief into your life requires that you be touched by what you experience. No doubt, spending time with the precious body of someone you love will allow you the privilege of being touched by this sacred experience.<\/p>\n<p>You who bear witness to thousands of people as they spend time with the body of someone they have loved know this. The word “heart” literally means “well of reception.” Just as the families you serve opened their heart to love, they must open their heart to feelings of loss. We sometimes forget that love and feelings of loss are inextricably bound together. Yes, the capacity to love requires the necessity to mourn.<\/p>\n<p>Seeing the dead body of someone they have loved opens or engages the hearts of her friends and family. Now, they can choose to take their hearts, which have been engaged, and gather the courage to encounter their feelings of loss.<\/p>\n<p>The word “emotion” literally means “energy in motion.” To be authentic with your emotions is to have them work <em>for<\/em> you instead of <em>against <\/em>you. We don’t spend time with the bodies of those that go before us in an effort to have them “look alive.” We spend time with the bodies of those that go before us to help us embrace our feelings and set healing in motion.<\/p>\n<p>My hope is that the next time a family says, “I’ll just remember him the way he was” or “ It’s just a shell,” you will reflect on this article and help them better understand the value of the ultimate death symbol. Remember—a meaningful funeral is not about denying death but befriending it. Let’s not dispatch of bodies. Let’s treat them with the reverence and respect they deserve. Perhaps most of all, let’s remember the value of the need to say hello on the pathway to goodbye.<\/p>\n<p> Dr. Alan D. Wolfelt, is the director of the Center For Loss &amp; Life Transition in Fort Collins, CO. In addition, he is on the faculty at the University of Colorado Medical School in the Department of Family Medicine. He is the author of numerous books on grief and loss, including <em>Creating Meaningful Funeral Ceremonies: A Guide for Families<\/em> and <em>Understanding Your Grief: Touchstones for Hope and Healing.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>by Alan D. Wolfelt, Ph.D “For the first time in history, the actual presence of the dead at their own funerals has become optional, even undesirable, lest the body break the illusion of a cloudless celebration, spoil the meditative mood, and reveal the truths about grief, life and death that our thinned-out ceremonies cannot bear.” [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","inline_featured_image":false,"footnotes":""},"categories":[3,4],"tags":[],"class_list":["post-2189","post","type-post","status-publish","format-standard","hentry","category-articles","category-blog"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v21.0 (Yoast SEO v24.3) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Reflections on the “Ultimate Death Symbol”: Saying Hello on the Pathway to Goodbye - Johnson Consulting Group<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.johnsonconsulting.com\/reflections-on-the-ultimate-death-symbol-saying-hello-on-the-pathway-to-goodbye\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Reflections on the “Ultimate Death Symbol”: Saying Hello on the Pathway to Goodbye\" \/>\n<meta property=\"og:description\" content=\"by Alan D. Wolfelt, Ph.D “For the first time in history, the actual presence of the dead at their own funerals has become optional, even undesirable, lest the body break the illusion of a cloudless celebration, spoil the meditative mood, and reveal the truths about grief, life and death that our thinned-out ceremonies cannot bear.” [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.johnsonconsulting.com\/reflections-on-the-ultimate-death-symbol-saying-hello-on-the-pathway-to-goodbye\/\" \/>\n<meta property=\"og:site_name\" content=\"Johnson Consulting Group\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/JohnsonConsulting\" \/>\n<meta property=\"article:published_time\" content=\"2012-06-07T21:01:28+00:00\" \/>\n<meta name=\"author\" content=\"JCGAdmin\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@johnsonfuneral\" \/>\n<meta name=\"twitter:site\" content=\"@johnsonfuneral\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"JCGAdmin\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"13 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/reflections-on-the-ultimate-death-symbol-saying-hello-on-the-pathway-to-goodbye\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/reflections-on-the-ultimate-death-symbol-saying-hello-on-the-pathway-to-goodbye\/\"},\"author\":{\"name\":\"JCGAdmin\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/c9c70bea2fea0f478e05fa37ad0f930c\"},\"headline\":\"Reflections on the “Ultimate Death Symbol”: Saying Hello on the Pathway to Goodbye\",\"datePublished\":\"2012-06-07T21:01:28+00:00\",\"dateModified\":\"2012-06-07T21:01:28+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/reflections-on-the-ultimate-death-symbol-saying-hello-on-the-pathway-to-goodbye\/\"},\"wordCount\":2562,\"publisher\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#organization\"},\"articleSection\":[\"Articles\",\"Blog\"],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/reflections-on-the-ultimate-death-symbol-saying-hello-on-the-pathway-to-goodbye\/\",\"url\":\"https:\/\/www.johnsonconsulting.com\/reflections-on-the-ultimate-death-symbol-saying-hello-on-the-pathway-to-goodbye\/\",\"name\":\"Reflections on the “Ultimate Death Symbol”: Saying Hello on the Pathway to Goodbye - Johnson Consulting Group\",\"isPartOf\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#website\"},\"datePublished\":\"2012-06-07T21:01:28+00:00\",\"dateModified\":\"2012-06-07T21:01:28+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/reflections-on-the-ultimate-death-symbol-saying-hello-on-the-pathway-to-goodbye\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.johnsonconsulting.com\/reflections-on-the-ultimate-death-symbol-saying-hello-on-the-pathway-to-goodbye\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/reflections-on-the-ultimate-death-symbol-saying-hello-on-the-pathway-to-goodbye\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.johnsonconsulting.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Reflections on the “Ultimate Death Symbol”: Saying Hello on the Pathway to Goodbye\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#website\",\"url\":\"https:\/\/www.johnsonconsulting.com\/\",\"name\":\"Johnson Consulting Group\",\"description\":\"Funeral Home and Cemetery Consulting\",\"publisher\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.johnsonconsulting.com\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#organization\",\"name\":\"Johnson Consulting Group\",\"url\":\"https:\/\/www.johnsonconsulting.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png\",\"contentUrl\":\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png\",\"width\":576,\"height\":222,\"caption\":\"Johnson Consulting Group\"},\"image\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/JohnsonConsulting\",\"https:\/\/x.com\/johnsonfuneral\",\"https:\/\/www.linkedin.com\/company\/johnson-consulting-group\/\",\"https:\/\/www.youtube.com\/user\/JohnsonConsultingInc\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/c9c70bea2fea0f478e05fa37ad0f930c\",\"name\":\"JCGAdmin\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/5520c11611a67c1bcae496d454b34b8b?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/5520c11611a67c1bcae496d454b34b8b?s=96&d=mm&r=g\",\"caption\":\"JCGAdmin\"},\"url\":\"https:\/\/www.johnsonconsulting.com\/author\/jcgadmin\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Reflections on the “Ultimate Death Symbol”: Saying Hello on the Pathway to Goodbye - Johnson Consulting Group","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.johnsonconsulting.com\/reflections-on-the-ultimate-death-symbol-saying-hello-on-the-pathway-to-goodbye\/","og_locale":"en_US","og_type":"article","og_title":"Reflections on the “Ultimate Death Symbol”: Saying Hello on the Pathway to Goodbye","og_description":"by Alan D. Wolfelt, Ph.D “For the first time in history, the actual presence of the dead at their own funerals has become optional, even undesirable, lest the body break the illusion of a cloudless celebration, spoil the meditative mood, and reveal the truths about grief, life and death that our thinned-out ceremonies cannot bear.” [&hellip;]","og_url":"https:\/\/www.johnsonconsulting.com\/reflections-on-the-ultimate-death-symbol-saying-hello-on-the-pathway-to-goodbye\/","og_site_name":"Johnson Consulting Group","article_publisher":"https:\/\/www.facebook.com\/JohnsonConsulting","article_published_time":"2012-06-07T21:01:28+00:00","author":"JCGAdmin","twitter_card":"summary_large_image","twitter_creator":"@johnsonfuneral","twitter_site":"@johnsonfuneral","twitter_misc":{"Written by":"JCGAdmin","Est. reading time":"13 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.johnsonconsulting.com\/reflections-on-the-ultimate-death-symbol-saying-hello-on-the-pathway-to-goodbye\/#article","isPartOf":{"@id":"https:\/\/www.johnsonconsulting.com\/reflections-on-the-ultimate-death-symbol-saying-hello-on-the-pathway-to-goodbye\/"},"author":{"name":"JCGAdmin","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/c9c70bea2fea0f478e05fa37ad0f930c"},"headline":"Reflections on the “Ultimate Death Symbol”: Saying Hello on the Pathway to Goodbye","datePublished":"2012-06-07T21:01:28+00:00","dateModified":"2012-06-07T21:01:28+00:00","mainEntityOfPage":{"@id":"https:\/\/www.johnsonconsulting.com\/reflections-on-the-ultimate-death-symbol-saying-hello-on-the-pathway-to-goodbye\/"},"wordCount":2562,"publisher":{"@id":"https:\/\/www.johnsonconsulting.com\/#organization"},"articleSection":["Articles","Blog"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/www.johnsonconsulting.com\/reflections-on-the-ultimate-death-symbol-saying-hello-on-the-pathway-to-goodbye\/","url":"https:\/\/www.johnsonconsulting.com\/reflections-on-the-ultimate-death-symbol-saying-hello-on-the-pathway-to-goodbye\/","name":"Reflections on the “Ultimate Death Symbol”: Saying Hello on the Pathway to Goodbye - Johnson Consulting Group","isPartOf":{"@id":"https:\/\/www.johnsonconsulting.com\/#website"},"datePublished":"2012-06-07T21:01:28+00:00","dateModified":"2012-06-07T21:01:28+00:00","breadcrumb":{"@id":"https:\/\/www.johnsonconsulting.com\/reflections-on-the-ultimate-death-symbol-saying-hello-on-the-pathway-to-goodbye\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.johnsonconsulting.com\/reflections-on-the-ultimate-death-symbol-saying-hello-on-the-pathway-to-goodbye\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.johnsonconsulting.com\/reflections-on-the-ultimate-death-symbol-saying-hello-on-the-pathway-to-goodbye\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.johnsonconsulting.com\/"},{"@type":"ListItem","position":2,"name":"Reflections on the “Ultimate Death Symbol”: Saying Hello on the Pathway to Goodbye"}]},{"@type":"WebSite","@id":"https:\/\/www.johnsonconsulting.com\/#website","url":"https:\/\/www.johnsonconsulting.com\/","name":"Johnson Consulting Group","description":"Funeral Home and Cemetery Consulting","publisher":{"@id":"https:\/\/www.johnsonconsulting.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.johnsonconsulting.com\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.johnsonconsulting.com\/#organization","name":"Johnson Consulting Group","url":"https:\/\/www.johnsonconsulting.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/","url":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png","contentUrl":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png","width":576,"height":222,"caption":"Johnson Consulting Group"},"image":{"@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/JohnsonConsulting","https:\/\/x.com\/johnsonfuneral","https:\/\/www.linkedin.com\/company\/johnson-consulting-group\/","https:\/\/www.youtube.com\/user\/JohnsonConsultingInc"]},{"@type":"Person","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/c9c70bea2fea0f478e05fa37ad0f930c","name":"JCGAdmin","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/5520c11611a67c1bcae496d454b34b8b?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/5520c11611a67c1bcae496d454b34b8b?s=96&d=mm&r=g","caption":"JCGAdmin"},"url":"https:\/\/www.johnsonconsulting.com\/author\/jcgadmin\/"}]}},"_links":{"self":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/posts\/2189","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/comments?post=2189"}],"version-history":[{"count":0,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/posts\/2189\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/media?parent=2189"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/categories?post=2189"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/tags?post=2189"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}