{"id":3510,"date":"2015-10-29T10:00:21","date_gmt":"2015-10-29T10:00:21","guid":{"rendered":"http:\/\/johnsoncg.wpengine.com\/?p=3510"},"modified":"2015-10-29T15:34:33","modified_gmt":"2015-10-29T15:34:33","slug":"529-plans","status":"publish","type":"post","link":"https:\/\/www.johnsonconsulting.com\/529-plans\/","title":{"rendered":"529 Plans"},"content":{"rendered":"<p><strong>529 Plans<\/strong><\/p>\n<div style=\"background-color: #e7e2cf; margin-left: 20px; margin-right: 20px; padding: 8px;\"><span style=\"color: #b4a973;\"><em><strong>The first-year college tuition bill in 2025 is projected to be $27,104* for an in-state average public education institution and $62,189* for an average private institution. Building the assets you’ll need to fund a child’s or grandchild’s education is a challenge, but you may be able to meet it by contributing to a 529 plan. <\/strong><\/em><\/span><\/div>\n<p><em>An education-savings vehicle with multiple benefits<\/em><\/p>\n<p>529 plans were made possible by federal legislation but are implemented at the state or institution level. Nearly all states have approved and adopted these qualified tuition programs (QTPs). Most states let nonresidents participate in their plans, although the tax benefits may be greater for residents than for nonresidents. The beneficiary can use 529 plan account balances at any eligible postsecondary educational institution in the United States or certain schools abroad for qualified expenses. Qualified expenses cover tuition, room and board, books, equipment, and supplies related to enrollment or attendance at the eligible institution. The account owner retains control of the assets and can change beneficiaries within the designated beneficiary’s family at any time without penalty. Other key advantages of these plans are:<\/p>\n<ul>\n<li>Federal-income-tax-free qualified distributions. The beneficiary may be able to take qualified distributions federal-income-tax-free.<\/li>\n<li>No income limitations for participation. There is no income limit for contributing to a 529 plan, which is a benefit for higher-income families.<\/li>\n<li>Substantial contribution amounts. Contribution limits are significantly higher than those allowed for an ESA (see next bullet point). Maximum account balance limits vary from state to state.<\/li>\n<li>Significant estate-planning benefits. Due to a special provision unique to 529 plans, a single person can contribute up to $70,000 in one year per beneficiary; a married couple can contribute up to $140,000 in one year per beneficiary with no gift-tax consequences.† Such a contribution will be considered a five-year accelerated annual-exclusion gift ($14,000 for 2015), so no additional gifts can be made for that beneficiary for this year and the next four years without incurring gift-tax implications unless the annual gift exclusion increases. Not only are you able to jump start your education savings, but this accelerated gifting technique also allows you to reduce your estate by the gift amount and any subsequent appreciation. (A portion of the contribution amount may be included in the donor’s taxable-estate calculation if the donor should die within the five-year period.)<\/li>\n<\/ul>\n<p><em>* Total yearly costs for in-state tuition, fees, books, room and board (transportation, and miscellaneous expenses not included). Base is 2014-2015 school year. Costs for all future years projected by Wells Fargo Advisors in November 2014 assuming a 3.0% national average increase per year for public and a 3.6% national average increase per year for private. Source: Trends in College Pricing. ©2014 collegeboard.com, Inc. Reprinted with permission. All rights reserved. collegeboard.com.<\/em><\/p>\n<p><em>† Assumes no other gifts have been made for the year and a gift tax form 709 has been completed.<\/em><\/p>\n<ul>\n<li>Minimal burden of investment decisions. The plan’s chosen investment manager will be responsible for the day-to-day portfolio management of all contributions. Initially, you select from several asset-allocation-model alternatives, which generally you may change only twice every calendar year and\/or with a beneficiary change.<\/li>\n<\/ul>\n<p><em>An investment in a 529 plan will fluctuate such that the shares when redeemed may be worth more or less than the original investment. There are no guarantees that an investment in a 529 plan will cover higher-education expenses. Investors should consult the plan’s offering document for the fees and expenses associated with that plan. You should consider a 529 plan’s investment objectives, risks, charges and expenses carefully before investing. The plan’s official statement, which contains this and other important information, should be read carefully before investing.<\/em><\/p>\n<h4><strong>Frequently asked questions<\/strong><\/h4>\n<p><strong>Can securities be contributed to a 529 plan?<\/strong><\/p>\n<p>No. Contributions to 529 plans must be made in cash.<\/p>\n<p><strong>How will my contributions be invested?<\/strong><\/p>\n<p>Typically your contribution is invested in a predetermined portfolio of stocks, bonds and cash. These portfolios are managed by the plan’s chosen investment firm. In general, owners designate a certain allocation model at the time of the original contribution and can change this investment model twice every calendar year and\/or when they change the beneficiary.<\/p>\n<p><strong>Can I change the beneficiary after I’ve made a contribution?<\/strong><\/p>\n<p>You may change your 529 savings plan account beneficiary to another qualified family member of the designated beneficiary without triggering income tax consequences. A qualified family member generally includes siblings, descendants, ancestors, aunts, uncles and first cousins (defined in IRS publication 970). If you change the beneficiary to<br \/>\na descendant of the designated beneficiary, you will trigger a gift equal to the value transferred from the 529 account. If the value is more than the annual exclusion (or five-year accelerated annual exclusion), you must report it as a “taxable gift.”<\/p>\n<p><strong>Can 529 distributions be used for vocational schools?<\/strong><\/p>\n<p>Potentially. An &#8220;eligible&#8221; institution is any college, university, vocational school or other post secondary educational institution eligible to participate in the U.S. Department of Education student aid program.<\/p>\n<p><strong>What happens if the account balance is not used for qualified higher-education expenses?<\/strong><\/p>\n<p>Every withdrawal from a 529 plan is separated into two components: an “earnings” portion and a “return of your investment” portion.<\/p>\n<p>The return of your investment in the 529 plan is never subject to federal income tax. On the other hand, if a withdrawal is not used for qualified higher-education expenses, the earnings portion of the withdrawal is subject to income tax and potentially a 10% IRS penalty. Some exceptions to the penalty may be available. For example, if the beneficiary dies, becomes disabled or receives a tax free scholarship, you may take penalty-free nonqualified distributions from the 529 balance within that same tax year. See IRS publication 970 at irs.gov for more exceptions.<\/p>\n<p><strong>How will 529 plan investment balances affect eligibility for financial aid?<\/strong><\/p>\n<p>Assets in a 529 account are included in the federal financial aid calculation as follows:<\/p>\n<ul>\n<li>If a parent owns the 529 account, up to 5.64% of the value is included in Expected Family Contribution (EFC) as a parental asset. Any 529 accounts owned by a dependent student or by a custodian for the student are reported on the Free Application for Federal Student Aid (FAFSA) as a parental asset. Any qualified withdrawals from these accounts are not included as income to the student.<\/li>\n<li>If a 529 account is owned by a grandparent (or someone other than a parent or the student), the account’s value is not reportable as an asset on the FAFSA financial aid application. However, any distributions from these third-party accounts are considered financial support to the student and are reportable on the following year’s FAFSA as student income. Student income is assessed at the student’s 50% rate.<\/li>\n<\/ul>\n<p>The above information pertains to the federal FAFSA calculation. Some schools may use an institutional formula, which may assess assets differently and produce a different aid determination. Ask your Financial Advisor for a copy of our report, &#8220;An introduction to college financial aid&#8221; for more details.<\/p>\n<p><strong>How does a 529 plan compare with more traditional college-savings vehicles, such as custodial accounts, ESAs, etc.?<\/strong><\/p>\n<p>The table on page 4 briefly describes the features of various college-savings vehicles. For a more complete discussion and comparison of these types of vehicles, ask your Financial Advisor for a copy of our education-planning brochure, “Saving for Soaring College Costs.”<\/p>\n<p><strong>Can I transfer existing Uniform Gift to Minors Act\/Uniform Transfer to Minors Act (UGMA\/UTMA) balances into a 529 plan?<\/strong><\/p>\n<p>Yes, but 529 plan contributions must be made in cash, so if you choose to use UGMA\/UTMA funds, your UGMA\/UTMA assets must be liquidated (possibly triggering income tax consequences) before making your 529 contribution. You will need to transfer the funds into a custodial 529 plan account. Once there they will have the opportunity to grow tax-deferred, and qualified distributions may be federal income tax free, the same as a noncustodial 529 plan. Nonqualified withdrawals from either a custodial or noncustodial 529 plan account may trigger ordinary income taxes and a 10% penalty.<\/p>\n<p>There are two important differences to be aware of when funding a 529 plan with UGMA\/UTMA funds. First, you should be aware that you are not allowed to change the beneficiary on custodial 529 plan accounts. Second, the UGMA\/UTMA assets you transfer into the account will continue to be governed by the control rules involving UGMA\/UTMA assets. That is, the beneficiary may gain control of those assets when attaining the age upon which custodianship ends.<\/p>\n<p>You should also be aware that assets in a UGMA\/UTMA account can be used for a variety of purposes without penalty. They are not restricted to educational expenses as with a custodial 529 plan. A better strategy may be to maintain the UGMA\/UTMA assets for expenses not considered qualified by the 529 plan and direct new education savings into a 529 plan for qualified expenses.<\/p>\n<p><a href=\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2015\/09\/529-Plans-Compare.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone wp-image-3545\" src=\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2015\/09\/529-Plans-Compare-450x582.jpg\" alt=\"529 Plans-Compare\" width=\"430\" height=\"556\" srcset=\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2015\/09\/529-Plans-Compare-450x582.jpg 450w, https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2015\/09\/529-Plans-Compare-700x906.jpg 700w, https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2015\/09\/529-Plans-Compare-250x324.jpg 250w, https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2015\/09\/529-Plans-Compare-120x155.jpg 120w, https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2015\/09\/529-Plans-Compare-512x663.jpg 512w, https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2015\/09\/529-Plans-Compare-348x450.jpg 348w, https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2015\/09\/529-Plans-Compare.jpg 1700w\" sizes=\"auto, (max-width: 430px) 100vw, 430px\" \/><\/a><\/p>\n<p><strong>Can I make a gift to a custodial account and a 529 plan in the same year?<\/strong><\/p>\n<p>Yes, within certain limitations. A gift to a custodial account is limited to the annual gift-exclusion amount ($14,000 for individuals, $28,000 for married couples) without affecting your lifetime gift-tax-exclusion amount ($5.43 million in 2015). However, a gift to a 529 plan that is in excess of the annual gift-exclusion amount may be considered a five-year accelerated annual-exclusion gift if properly elected as such on a gift tax return.<\/p>\n<p>For example, if you made a $35,000 contribution in one year to a 529 savings plan and elected the five-year accelerated annual exclusion gift on the gift tax return, your contribution would be treated as a $7,000 gift in the current year and each of the next four years. In that same year, you may gift an additional $7,000 to the same beneficiary in a custodial account (reaching your one-year total of $14,000, the annual gift-exclusion limit for 2015). If each spouse of a married couple gifted $35,000, the couple would be able to double these gifts.*<\/p>\n<p><strong>How can I maximize the 529 plan’s estate-planning benefits?<\/strong><\/p>\n<p>Affluent families may want to contribute as much as possible into a 529 plan, both to fund college expenses for beneficiaries and to move assets out of a taxable estate. These families should consider making the maximum annual exclusion gift contribution ($70,000 for an individual or $140,000 for a married couple using the five-year lump-sum election) in a single year.<\/p>\n<p>Think twice if this is your goal and you are close to the end of the year. By maximizing that contribution this year, you use your annual-exclusion gift amount for that beneficiary for the next four years. That means four more years must pass before you can again contribute to that 529 plan account for that beneficiary without gift-tax consequences. If, instead, you make one year’s annual exclusion gift for a beneficiary before year end, ($14,000 for an individual or $28,000 for a married couple) and then maximize your 529 plan contribution in the new year, you can contribute up to $84,000 (individuals) or $168,000 (married couples) within a matter of months rather than over six years, as illustrated below:*<\/p>\n<h4><strong>Maximizing the estate-planning benefits of a 529 plan<\/strong><\/h4>\n<p><strong>For a married couple<\/strong><\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignleft  wp-image-3546\" src=\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2015\/09\/Contribution-WF-450x162.jpg\" alt=\"Contribution WF\" width=\"375\" height=\"135\" srcset=\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2015\/09\/Contribution-WF-450x162.jpg 450w, https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2015\/09\/Contribution-WF-700x251.jpg 700w, https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2015\/09\/Contribution-WF-250x90.jpg 250w, https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2015\/09\/Contribution-WF-120x43.jpg 120w, https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2015\/09\/Contribution-WF-512x184.jpg 512w, https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2015\/09\/Contribution-WF.jpg 724w\" sizes=\"auto, (max-width: 375px) 100vw, 375px\" \/><\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p><em>* This hypothetical example is designed to illustrate the effect of certain planning strategies based on stated assumptions. The strategy described may or may not be suitable for your particular situation. Before implementing any strategy, you should seek the advice of your tax and legal advisors. No guarantee of specific results is made; past performance is no guarantee of future results.<\/em><\/p>\n<p>To download this article, <a href=\"\/wp-content\/uploads\/2015\/09\/529-Plans.pdf\" target=\"_blank\">click here<\/a>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>529 Plans The first-year college tuition bill in 2025 is projected to be $27,104* for an in-state average public education institution and $62,189* for an average private institution. Building the assets you’ll need to fund a child’s or grandchild’s education is a challenge, but you may be able to meet it by contributing to a 529 plan.  An education-savings vehicle with multiple benefits 529 [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","inline_featured_image":false,"footnotes":""},"categories":[3,6],"tags":[],"class_list":["post-3510","post","type-post","status-publish","format-standard","hentry","category-articles","category-newsletter"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v21.0 (Yoast SEO v24.3) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>529 Plans - Johnson Consulting Group<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.johnsonconsulting.com\/529-plans\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"529 Plans\" \/>\n<meta property=\"og:description\" content=\"529 Plans The first-year college tuition bill in 2025 is projected to be $27,104* for an in-state average public education institution and $62,189* for an average private institution. Building the assets you’ll need to fund a child’s or grandchild’s education is a challenge, but you may be able to meet it by contributing to a 529 plan.  An education-savings vehicle with multiple benefits 529 [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.johnsonconsulting.com\/529-plans\/\" \/>\n<meta property=\"og:site_name\" content=\"Johnson Consulting Group\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/JohnsonConsulting\" \/>\n<meta property=\"article:published_time\" content=\"2015-10-29T10:00:21+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2015-10-29T15:34:33+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2015\/09\/529-Plans-Compare-450x582.jpg\" \/>\n<meta name=\"author\" content=\"JCGAdmin\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@johnsonfuneral\" \/>\n<meta name=\"twitter:site\" content=\"@johnsonfuneral\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"JCGAdmin\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/529-plans\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/529-plans\/\"},\"author\":{\"name\":\"JCGAdmin\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/c9c70bea2fea0f478e05fa37ad0f930c\"},\"headline\":\"529 Plans\",\"datePublished\":\"2015-10-29T10:00:21+00:00\",\"dateModified\":\"2015-10-29T15:34:33+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/529-plans\/\"},\"wordCount\":1876,\"publisher\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/529-plans\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2015\/09\/529-Plans-Compare-450x582.jpg\",\"articleSection\":[\"Articles\",\"Newsletter\"],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/529-plans\/\",\"url\":\"https:\/\/www.johnsonconsulting.com\/529-plans\/\",\"name\":\"529 Plans - Johnson Consulting Group\",\"isPartOf\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/529-plans\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/529-plans\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2015\/09\/529-Plans-Compare-450x582.jpg\",\"datePublished\":\"2015-10-29T10:00:21+00:00\",\"dateModified\":\"2015-10-29T15:34:33+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/529-plans\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.johnsonconsulting.com\/529-plans\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/529-plans\/#primaryimage\",\"url\":\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2015\/09\/529-Plans-Compare.jpg\",\"contentUrl\":\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2015\/09\/529-Plans-Compare.jpg\",\"width\":1700,\"height\":2200},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/529-plans\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.johnsonconsulting.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"529 Plans\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#website\",\"url\":\"https:\/\/www.johnsonconsulting.com\/\",\"name\":\"Johnson Consulting Group\",\"description\":\"Funeral Home and Cemetery Consulting\",\"publisher\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.johnsonconsulting.com\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#organization\",\"name\":\"Johnson Consulting Group\",\"url\":\"https:\/\/www.johnsonconsulting.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png\",\"contentUrl\":\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png\",\"width\":576,\"height\":222,\"caption\":\"Johnson Consulting Group\"},\"image\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/JohnsonConsulting\",\"https:\/\/x.com\/johnsonfuneral\",\"https:\/\/www.linkedin.com\/company\/johnson-consulting-group\/\",\"https:\/\/www.youtube.com\/user\/JohnsonConsultingInc\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/c9c70bea2fea0f478e05fa37ad0f930c\",\"name\":\"JCGAdmin\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/5520c11611a67c1bcae496d454b34b8b?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/5520c11611a67c1bcae496d454b34b8b?s=96&d=mm&r=g\",\"caption\":\"JCGAdmin\"},\"url\":\"https:\/\/www.johnsonconsulting.com\/author\/jcgadmin\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"529 Plans - Johnson Consulting Group","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.johnsonconsulting.com\/529-plans\/","og_locale":"en_US","og_type":"article","og_title":"529 Plans","og_description":"529 Plans The first-year college tuition bill in 2025 is projected to be $27,104* for an in-state average public education institution and $62,189* for an average private institution. Building the assets you’ll need to fund a child’s or grandchild’s education is a challenge, but you may be able to meet it by contributing to a 529 plan.  An education-savings vehicle with multiple benefits 529 [&hellip;]","og_url":"https:\/\/www.johnsonconsulting.com\/529-plans\/","og_site_name":"Johnson Consulting Group","article_publisher":"https:\/\/www.facebook.com\/JohnsonConsulting","article_published_time":"2015-10-29T10:00:21+00:00","article_modified_time":"2015-10-29T15:34:33+00:00","og_image":[{"url":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2015\/09\/529-Plans-Compare-450x582.jpg","type":"","width":"","height":""}],"author":"JCGAdmin","twitter_card":"summary_large_image","twitter_creator":"@johnsonfuneral","twitter_site":"@johnsonfuneral","twitter_misc":{"Written by":"JCGAdmin","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.johnsonconsulting.com\/529-plans\/#article","isPartOf":{"@id":"https:\/\/www.johnsonconsulting.com\/529-plans\/"},"author":{"name":"JCGAdmin","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/c9c70bea2fea0f478e05fa37ad0f930c"},"headline":"529 Plans","datePublished":"2015-10-29T10:00:21+00:00","dateModified":"2015-10-29T15:34:33+00:00","mainEntityOfPage":{"@id":"https:\/\/www.johnsonconsulting.com\/529-plans\/"},"wordCount":1876,"publisher":{"@id":"https:\/\/www.johnsonconsulting.com\/#organization"},"image":{"@id":"https:\/\/www.johnsonconsulting.com\/529-plans\/#primaryimage"},"thumbnailUrl":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2015\/09\/529-Plans-Compare-450x582.jpg","articleSection":["Articles","Newsletter"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/www.johnsonconsulting.com\/529-plans\/","url":"https:\/\/www.johnsonconsulting.com\/529-plans\/","name":"529 Plans - Johnson Consulting Group","isPartOf":{"@id":"https:\/\/www.johnsonconsulting.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.johnsonconsulting.com\/529-plans\/#primaryimage"},"image":{"@id":"https:\/\/www.johnsonconsulting.com\/529-plans\/#primaryimage"},"thumbnailUrl":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2015\/09\/529-Plans-Compare-450x582.jpg","datePublished":"2015-10-29T10:00:21+00:00","dateModified":"2015-10-29T15:34:33+00:00","breadcrumb":{"@id":"https:\/\/www.johnsonconsulting.com\/529-plans\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.johnsonconsulting.com\/529-plans\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.johnsonconsulting.com\/529-plans\/#primaryimage","url":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2015\/09\/529-Plans-Compare.jpg","contentUrl":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2015\/09\/529-Plans-Compare.jpg","width":1700,"height":2200},{"@type":"BreadcrumbList","@id":"https:\/\/www.johnsonconsulting.com\/529-plans\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.johnsonconsulting.com\/"},{"@type":"ListItem","position":2,"name":"529 Plans"}]},{"@type":"WebSite","@id":"https:\/\/www.johnsonconsulting.com\/#website","url":"https:\/\/www.johnsonconsulting.com\/","name":"Johnson Consulting Group","description":"Funeral Home and Cemetery Consulting","publisher":{"@id":"https:\/\/www.johnsonconsulting.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.johnsonconsulting.com\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.johnsonconsulting.com\/#organization","name":"Johnson Consulting Group","url":"https:\/\/www.johnsonconsulting.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/","url":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png","contentUrl":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png","width":576,"height":222,"caption":"Johnson Consulting Group"},"image":{"@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/JohnsonConsulting","https:\/\/x.com\/johnsonfuneral","https:\/\/www.linkedin.com\/company\/johnson-consulting-group\/","https:\/\/www.youtube.com\/user\/JohnsonConsultingInc"]},{"@type":"Person","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/c9c70bea2fea0f478e05fa37ad0f930c","name":"JCGAdmin","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/5520c11611a67c1bcae496d454b34b8b?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/5520c11611a67c1bcae496d454b34b8b?s=96&d=mm&r=g","caption":"JCGAdmin"},"url":"https:\/\/www.johnsonconsulting.com\/author\/jcgadmin\/"}]}},"_links":{"self":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/posts\/3510","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/comments?post=3510"}],"version-history":[{"count":0,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/posts\/3510\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/media?parent=3510"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/categories?post=3510"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/tags?post=3510"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}