{"id":3547,"date":"2015-09-22T20:24:08","date_gmt":"2015-09-22T20:24:08","guid":{"rendered":"http:\/\/johnsoncg.wpengine.com\/?p=3547"},"modified":"2015-09-22T20:24:08","modified_gmt":"2015-09-22T20:24:08","slug":"top-5-things-to-remember-when-transferring-a-business","status":"publish","type":"post","link":"https:\/\/www.johnsonconsulting.com\/top-5-things-to-remember-when-transferring-a-business\/","title":{"rendered":"Top 5 Things to Remember When Transferring a Business"},"content":{"rendered":"<p><strong>What to consider when transferring\/selling a funeral business<\/strong><\/p>\n<p>Over the years, either through helping companies I worked for acquire\/sell funeral businesses, watching my own family buy\/sell and operate funeral businesses, or through the vast level of buying and selling engagements through my current consulting company, there were important lessons learned on how to better prepare for something as important as transferring\/selling a funeral business. The surprising thing is that as skilled as some of the most proactive owners are, most don’t look at their business decisions on how they will affect the value of their most valuable asset, their business! Truth is, just about any decision we make can have a lasting effect on the value of the business when that day comes to transfer or sell. I think ironically, as much as we all deal in the business of death, we just don’t consider our own life timelines and where our businesses need to be at different stages of our own lives. Consider this… work backwards from retirement! Perhaps you start at the age of 65 and determine what you want\/need. Then start getting younger and younger until your age today. Now consider that timeframe and tell me if you have built a plan on how to accomplish your goals. Like most, it is probably not a documented plan, just a thought of where you would like to be. As I’ve heard, “If you can’t identify the path, you can’t measure it… If you can’t measure it, you can’t manage it!” The good news is that it’s never too late. The bad news is that sometimes we don’t know where to start. To that point, I would like to list out things that business owners should consider when transferring their business in effort to create the most value and to start the business life plan today! I would offer the following thoughts which should be considered when creating a succession plan, whether it be internally (family, key employee, business partner) or externally (outside buyer):<\/p>\n<ol>\n<li><strong>Create redundancy in your role<\/strong>. Sometimes, one of the toughest scenarios is when I am engaged by a client to sell their business and they have not developed anybody to take over their role as the owner. They have kept all the secrets, all the relationships, and basically the operations have difficulty running without them as they hold the critical decision components to themselves. Funeral business is unique for sure when you consider the area of personal touch and relationships. Certainly an owner should be concerned about replacing himself as the face of the business, but should not be so afraid as to hold on to all key decisions. When this happens, that owner puts themselves in a position where time off is difficult and the ability to transfer the business internally is almost impossible without staying involved. This also has an impact on outside buyers. If the business owner wants to retire and nobody is left to be able to run the firm without the owner, that will certainly raise the risk meter for outside buyers. I can’t stress enough how important creating redundancy is… start on it now as it takes a while to do. Create a job description for yourself and for the key person(s) who needs to step in. Depending on the responsibility level, employment agreements may be in order. Check with your local attorney for the state laws governing such agreements as well. The key point &#8211; it is never too early to start this! This REALLY can affect value and certainly will affect your home life and stress level if you can’t figure this one out.<\/li>\n<\/ol>\n<ol start=\"2\">\n<li><strong>How do you know where you want to be, if you don’t know where you are now?!<\/strong> One of the most important things that you can do as an owner to create a transfer plan is to have a few reports done on your business. You should have a performance analysis done, which reviews your customer service level, your financial condition, your marketplace status, and your workplace health. This assessment will glean areas that need attention and help you get your house in order so that you will be ready when the day comes to transfer. Along with this, you should figure out what the value of your business is as of today! Knowing your business value is so important when determining what that exit strategy is going to be on retirement. Know what your value is today and then find out how to make it the value you want it to be when you retire… This is possible! A great revelation for myself was that we all create visions of where we want to be, however sometimes those visions really aren’t that far reaching. Have you ever heard “Reach for the stars”? Why is it we can’t dream big while others can? I would argue that if you do your homework on your business value, performance analysis, and creating your business life plan, you too can dream big! Often times we set our visions too low. The good news is that we achieve them, the bad news is that we may have been able to accomplish so much more!<\/li>\n<\/ol>\n<ol start=\"3\">\n<li><strong>Who do you want to transfer to in the end?<\/strong> If you have prepared well, you will have the most options on who you can transfer your business to. When you have more options, you get more money! The topic does bring up a good point to consider though and that is, “Who do you <em>prefer<\/em> selling to?” If the answer is somebody within the company, you need to start considering just how they will get their money for a down payment and whether or not they can get financing. There’s nothing more noble than transferring a business internally. If you are fortunate enough to grow your business to a significant size, then you will also be able to experience large dollar purchase prices. The problem is that the larger and more valuable your business is, the harder it can be to sell it to those within the company. The good news in funeral business is that there is a tremendous amount of goodwill associated with the relationships built over the years. Because of this, the cash flow typically outpaces any normal value than if you just bought the real estate. For this reason, it can be hard for your key people, business partners, and family members to find financing. This must be considered in your end game! If this is your desire, then you need to start figuring out how you are going to get those people in a position to acquire the firm successfully. The strategy may include allowing them to buy into the business over time before your retirement or financing them without a bank involved. Regardless of the situation, you will want agreements in place from an attorney to protect your position. Such agreements may include Buy\/Sell Agreements, Employment Agreements, and Covenant not to Compete agreements among others.<\/li>\n<\/ol>\n<ol start=\"4\">\n<li><strong>Don’t sell yourself short!<\/strong> Remember that even though you have a vision of what your profitability is, there is another vision… what the BUYER thinks your profitability is. This brings up a couple of issues to consider. The first is that the buyer will be looking at trends to determine the potential future of the business. If you do not have good consistent trends, this will impact the value of your business. One of the more important trends is case count at the funeral business. What is the mix and volume from year to year? Is it growing? Is it declining? Is it stable? If these trends aren’t good or could be bad in the future, you may just have to move your transfer plans to today rather than lose more value in the future. The next step, to ensure best trends and transparency in your financial data, is to have very good bookkeeping. You should have an accountant that is familiar with funeral business chart of accounts and benchmarks for showing where there are areas for improvement. These financials should be timely and consistent. Bottom line, when you have good accounting practices (good detail and consistency) and great case volume trends, you are lowering that risk meter for buyers which can translate into higher value. Remember, buyers WANT your business, however it is hard for them to find the hidden savings gems if your financials and trends are in bad shape! This can translate into poor market value.<\/li>\n<\/ol>\n<ol start=\"5\">\n<li><strong>Show them they can do it!<\/strong> I think back to the 90s, buyers just figured they could do it better and would pay high prices on what they thought the proforma (cash flow budget) should be. Problem is that it didn’t always work out and it really was a result of wanting to be competitive at a time where there were many buyers paying premium prices. Today, it is the more standard approach to only consider owner related and one-time extraordinary expense items that are very identifiable (through good accounting). If you know though that the business can be run more efficiently, then why aren’t you doing it now?! Answer: You are the owner, that’s why! You can choose to work as hard or as little as you want and will accept the consequences of those decisions. Often times we have that extra help in the business, or that outside contractor because it allows more life balance personally. The issue is that if you are running that way and want to tell a buyer they don’t need those extra labor or contractor luxuries, they are going to struggle with the fact that they are going to be the “bad guys” coming in to disrupt the culture and payroll. As mentioned before, everything is about the trends. If you are planning on transferring soon, just remember that the buyer will want to see two to three years under the operating methodology that you feel they can operate at as well. If you can accomplish this, you will increase your values to levels you wouldn’t believe are possible. I’ve seen values increase by $500,000 and more just by taking these into consideration well before the day to transfer comes!<\/li>\n<\/ol>\n<p>To summarize the above, I would offer the abbreviated to do list for each funeral business owner out there:<\/p>\n<ol>\n<li>Create a business life plan<\/li>\n<li>Create a plan to teach your employees to run the business without you (just be careful of how many secrets you give them! Maintaining those key relationships may be inevitable)<\/li>\n<li>Do a comprehensive assessment of your business’s current KPIs (Key Performance Indexes) (Marketplace, Financial, Workplace, Customer Service)<\/li>\n<li>Have a valuation done so you know where you stand today<\/li>\n<li>Determine who you would prefer to sell to and figure out how they will be able to buy your business<\/li>\n<li>Be sure you have good trends and good financial accounting that offers management tools<\/li>\n<li>Before the time comes, consider running your business as efficient as possible so that a buyer believes it can be done<\/li>\n<\/ol>\n<p>As I mentioned before, it is never too early to start this process. Start now and I can guarantee you that you will have ensured the highest possibility for successfully transferring your funeral business.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>What to consider when transferring\/selling a funeral business Over the years, either through helping companies I worked for acquire\/sell funeral businesses, watching my own family buy\/sell and operate funeral businesses, or through the vast level of buying and selling engagements through my current consulting company, there were important lessons learned on how to better prepare [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","inline_featured_image":false,"footnotes":""},"categories":[3],"tags":[],"class_list":["post-3547","post","type-post","status-publish","format-standard","hentry","category-articles"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v21.0 (Yoast SEO v24.3) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Top 5 Things to Remember When Transferring a Business - Johnson Consulting Group<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.johnsonconsulting.com\/top-5-things-to-remember-when-transferring-a-business\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Top 5 Things to Remember When Transferring a Business\" \/>\n<meta property=\"og:description\" content=\"What to consider when transferring\/selling a funeral business Over the years, either through helping companies I worked for acquire\/sell funeral businesses, watching my own family buy\/sell and operate funeral businesses, or through the vast level of buying and selling engagements through my current consulting company, there were important lessons learned on how to better prepare [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.johnsonconsulting.com\/top-5-things-to-remember-when-transferring-a-business\/\" \/>\n<meta property=\"og:site_name\" content=\"Johnson Consulting Group\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/JohnsonConsulting\" \/>\n<meta property=\"article:published_time\" content=\"2015-09-22T20:24:08+00:00\" \/>\n<meta name=\"author\" content=\"JCGAdmin\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@johnsonfuneral\" \/>\n<meta name=\"twitter:site\" content=\"@johnsonfuneral\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"JCGAdmin\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/top-5-things-to-remember-when-transferring-a-business\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/top-5-things-to-remember-when-transferring-a-business\/\"},\"author\":{\"name\":\"JCGAdmin\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/c9c70bea2fea0f478e05fa37ad0f930c\"},\"headline\":\"Top 5 Things to Remember When Transferring a Business\",\"datePublished\":\"2015-09-22T20:24:08+00:00\",\"dateModified\":\"2015-09-22T20:24:08+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/top-5-things-to-remember-when-transferring-a-business\/\"},\"wordCount\":1913,\"publisher\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#organization\"},\"articleSection\":[\"Articles\"],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/top-5-things-to-remember-when-transferring-a-business\/\",\"url\":\"https:\/\/www.johnsonconsulting.com\/top-5-things-to-remember-when-transferring-a-business\/\",\"name\":\"Top 5 Things to Remember When Transferring a Business - Johnson Consulting Group\",\"isPartOf\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#website\"},\"datePublished\":\"2015-09-22T20:24:08+00:00\",\"dateModified\":\"2015-09-22T20:24:08+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/top-5-things-to-remember-when-transferring-a-business\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.johnsonconsulting.com\/top-5-things-to-remember-when-transferring-a-business\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/top-5-things-to-remember-when-transferring-a-business\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.johnsonconsulting.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Top 5 Things to Remember When Transferring a Business\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#website\",\"url\":\"https:\/\/www.johnsonconsulting.com\/\",\"name\":\"Johnson Consulting Group\",\"description\":\"Funeral Home and Cemetery Consulting\",\"publisher\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.johnsonconsulting.com\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#organization\",\"name\":\"Johnson Consulting Group\",\"url\":\"https:\/\/www.johnsonconsulting.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png\",\"contentUrl\":\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png\",\"width\":576,\"height\":222,\"caption\":\"Johnson Consulting Group\"},\"image\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/JohnsonConsulting\",\"https:\/\/x.com\/johnsonfuneral\",\"https:\/\/www.linkedin.com\/company\/johnson-consulting-group\/\",\"https:\/\/www.youtube.com\/user\/JohnsonConsultingInc\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/c9c70bea2fea0f478e05fa37ad0f930c\",\"name\":\"JCGAdmin\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/5520c11611a67c1bcae496d454b34b8b?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/5520c11611a67c1bcae496d454b34b8b?s=96&d=mm&r=g\",\"caption\":\"JCGAdmin\"},\"url\":\"https:\/\/www.johnsonconsulting.com\/author\/jcgadmin\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Top 5 Things to Remember When Transferring a Business - Johnson Consulting Group","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.johnsonconsulting.com\/top-5-things-to-remember-when-transferring-a-business\/","og_locale":"en_US","og_type":"article","og_title":"Top 5 Things to Remember When Transferring a Business","og_description":"What to consider when transferring\/selling a funeral business Over the years, either through helping companies I worked for acquire\/sell funeral businesses, watching my own family buy\/sell and operate funeral businesses, or through the vast level of buying and selling engagements through my current consulting company, there were important lessons learned on how to better prepare [&hellip;]","og_url":"https:\/\/www.johnsonconsulting.com\/top-5-things-to-remember-when-transferring-a-business\/","og_site_name":"Johnson Consulting Group","article_publisher":"https:\/\/www.facebook.com\/JohnsonConsulting","article_published_time":"2015-09-22T20:24:08+00:00","author":"JCGAdmin","twitter_card":"summary_large_image","twitter_creator":"@johnsonfuneral","twitter_site":"@johnsonfuneral","twitter_misc":{"Written by":"JCGAdmin","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.johnsonconsulting.com\/top-5-things-to-remember-when-transferring-a-business\/#article","isPartOf":{"@id":"https:\/\/www.johnsonconsulting.com\/top-5-things-to-remember-when-transferring-a-business\/"},"author":{"name":"JCGAdmin","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/c9c70bea2fea0f478e05fa37ad0f930c"},"headline":"Top 5 Things to Remember When Transferring a Business","datePublished":"2015-09-22T20:24:08+00:00","dateModified":"2015-09-22T20:24:08+00:00","mainEntityOfPage":{"@id":"https:\/\/www.johnsonconsulting.com\/top-5-things-to-remember-when-transferring-a-business\/"},"wordCount":1913,"publisher":{"@id":"https:\/\/www.johnsonconsulting.com\/#organization"},"articleSection":["Articles"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/www.johnsonconsulting.com\/top-5-things-to-remember-when-transferring-a-business\/","url":"https:\/\/www.johnsonconsulting.com\/top-5-things-to-remember-when-transferring-a-business\/","name":"Top 5 Things to Remember When Transferring a Business - Johnson Consulting Group","isPartOf":{"@id":"https:\/\/www.johnsonconsulting.com\/#website"},"datePublished":"2015-09-22T20:24:08+00:00","dateModified":"2015-09-22T20:24:08+00:00","breadcrumb":{"@id":"https:\/\/www.johnsonconsulting.com\/top-5-things-to-remember-when-transferring-a-business\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.johnsonconsulting.com\/top-5-things-to-remember-when-transferring-a-business\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.johnsonconsulting.com\/top-5-things-to-remember-when-transferring-a-business\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.johnsonconsulting.com\/"},{"@type":"ListItem","position":2,"name":"Top 5 Things to Remember When Transferring a Business"}]},{"@type":"WebSite","@id":"https:\/\/www.johnsonconsulting.com\/#website","url":"https:\/\/www.johnsonconsulting.com\/","name":"Johnson Consulting Group","description":"Funeral Home and Cemetery Consulting","publisher":{"@id":"https:\/\/www.johnsonconsulting.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.johnsonconsulting.com\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.johnsonconsulting.com\/#organization","name":"Johnson Consulting Group","url":"https:\/\/www.johnsonconsulting.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/","url":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png","contentUrl":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png","width":576,"height":222,"caption":"Johnson Consulting Group"},"image":{"@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/JohnsonConsulting","https:\/\/x.com\/johnsonfuneral","https:\/\/www.linkedin.com\/company\/johnson-consulting-group\/","https:\/\/www.youtube.com\/user\/JohnsonConsultingInc"]},{"@type":"Person","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/c9c70bea2fea0f478e05fa37ad0f930c","name":"JCGAdmin","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/5520c11611a67c1bcae496d454b34b8b?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/5520c11611a67c1bcae496d454b34b8b?s=96&d=mm&r=g","caption":"JCGAdmin"},"url":"https:\/\/www.johnsonconsulting.com\/author\/jcgadmin\/"}]}},"_links":{"self":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/posts\/3547","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/comments?post=3547"}],"version-history":[{"count":0,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/posts\/3547\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/media?parent=3547"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/categories?post=3547"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/tags?post=3547"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}