{"id":472,"date":"2009-09-08T21:34:46","date_gmt":"2009-09-09T02:34:46","guid":{"rendered":"http:\/\/johnsoncg.wpengine.com\/?p=472"},"modified":"2015-02-27T19:19:30","modified_gmt":"2015-02-27T19:19:30","slug":"accounting-quiz-the-why-the-how-the-what-the-who","status":"publish","type":"post","link":"https:\/\/www.johnsonconsulting.com\/accounting-quiz-the-why-the-how-the-what-the-who\/","title":{"rendered":"Let’s Do an “Accounting Quiz”  It’s all About The Why &#8211; The How &#8211; The What &#8211; The Who"},"content":{"rendered":"<p><img loading=\"lazy\" decoding=\"async\" title=\"Dale Espich\" src=\"https:\/\/www.johnsonconsulting.com\/images\/dale-espich.jpg\" alt=\"\" width=\"164\" height=\"194\" align=\"right\" \/>BY DALE ESPICH<\/p>\n<p>In my 40-plus years in working with funeral directors as a <a href=\"https:\/\/johnsonconsulting.com\" target=\"_blank\">management consultant<\/a>, I have seen just about every description and methods of “<a title=\"Funeral Home Accounting\" href=\"\/funeral-home-business-services\/funeral-home-accounting\/\" target=\"_blank\">Accounting<\/a>” used to try to keep track of income, expense and profit\/loss.<\/p>\n<p>Let me throw out a series of questions to get your thought juices flowing and then we can tackle some of the answers (that I feel are appropriate).<\/p>\n<ul>\n<li>Why do you need “Accounting”?<\/li>\n<li>What is your definition of “Accounting”?<\/li>\n<li>How do you do YOUR “Accounting”?<\/li>\n<li>What do you expect from your “Accounting”?<\/li>\n<li>What SHOULD you get from your “Accounting”— or your “Accountant”?<\/li>\n<li>How do you choose an “Accountant”?<\/li>\n<\/ul>\n<p><strong><span style=\"text-decoration: underline;\">The Why<\/span><\/strong><\/p>\n<p>There are other questions we could ask, but let’s start with the basics of “Why”. We begin with three very good and basic reasons for good, clean and accurate accounting:<\/p>\n<ul>\n<li>Provides information needed for tax preparation.<\/li>\n<li>Banker will require reliable accounting records when in need of financing or establishing a line of credit.<\/li>\n<li>Provide a balance sheet that shows favorable ratios on net worth, liquidity, etc.<\/li>\n<\/ul>\n<p>It would be my advice, from experience, that a business should have a line of credit established with its bank.  In order for the bank to provide any credit, they are going to want solid evidence of your financial stability. There are other considerations as well, but this is usually where the bank will start.<\/p>\n<p>At the present time, we are not experiencing the same climate with bankers as we have in the past under “normal” economic times.  Although this article only connects more or less indirectly with the subject of credit, what I have said above about reliable information with and for your banker is basic regardless of today’s extremely tight credit and capital markets.<\/p>\n<p><strong><span style=\"text-decoration: underline;\">The How<\/span><\/strong><\/p>\n<p>Another value most funeral owners would give for “Accounting” is “to see how we are doing” both as the year goes along, and how the year ended, whether it is up or down&#8212;whether it is with profit or with loss.  Another way of stating it would be to view the ‘history’ of the business.  The problem with history is that it is <span style=\"text-decoration: underline;\">already finished<\/span>.  It’s done — over — past.  There is no way to go back and undo what happened last month or last year.<\/p>\n<p>The real value, however, is <strong><span style=\"text-decoration: underline;\">how<\/span><\/strong> to use your “Accounting” to accurately plan and balance your income and expense in order to have a <span style=\"text-decoration: underline;\">satisfactory profit year after year<\/span>.<\/p>\n<p><strong><span style=\"text-decoration: underline;\">The What<\/span><\/strong><\/p>\n<p>One of the great benefits of accurate history, of course, is that we can <span style=\"text-decoration: underline;\">learn<\/span> from it.  So, what do you learn about your business by an examination of your financials?  Moreover, <span style=\"text-decoration: underline;\">what do you do<\/span> with your financials to use them as planning tools for your future business?<\/p>\n<p>This brings into focus some very basic facts about your business and “Accounting.”  What does your accounting teach you about your business, and what do you learn from your accounting about income and expenses?  It may seem redundant and a needless statement, but, just to make sure we are on the same page, it is, after all, the <strong>balance <\/strong>of <span style=\"text-decoration: underline;\">more money coming <strong>in <\/strong>than there are expenses going <strong>out<\/strong> in order for a firm to have a profitable business<\/span>.<\/p>\n<p>Now, I want to offer up some key and important questions:<\/p>\n<ul>\n<li>Is the information you get from your accounting source such that it provides all the necessary information needed to accurately plan for a satisfactory profit year after year?<\/li>\n<\/ul>\n<ul>\n<li>Do <strong>you <\/strong>sit down at least 60 days before your new year begins, to analyze your current and past years, and plan for the up-coming year to ensure that your business will be adequately profitable?<\/li>\n<\/ul>\n<ul>\n<li>Does your accountant understand your funeral business in such a way to (1) provide you with the necessary specialized funeral accounting, and (2) assist you in planning your profitability (before the year starts) so that income and expenses provide the needed balance?<\/li>\n<\/ul>\n<p><strong><span style=\"text-decoration: underline;\">The Who<\/span><\/strong><\/p>\n<p>It is not the intention of this article to provide the answers to the above questions. This is where I believe many funeral home owners miss out on a very valuable and vital part of the accounting process. Because an accounting system that is designed specifically for a funeral home operation, with the proper chart of accounts, along with experienced staff that can interpret the data and make insightful recommendations to strengthen the financials, provides a wealth of opportunity. Unless you have lived it, you cannot totally understand it.  The monthly information from your accountant must be organized and presented in a timely way to take the necessary corrective action to get you where you deserve to be. If that is not your current situation, consider making a change. You owe it to yourself and all the stakeholders in your business.<\/p>\n<p>The profit climate in funeral service may seem to be rapidly declining.  After all, every June for the past 29 years, <span style=\"text-decoration: underline;\">the decline in funeral margins<\/span> have been announced in glaring headlines.  In 1980, the <span style=\"text-decoration: underline;\">announced margins<\/span> <span style=\"text-decoration: underline;\">were about 14%,<\/span> and have come down steadily to <span style=\"text-decoration: underline;\">less than 6% in June, 2009<\/span>.<\/p>\n<p>These announced margins are not the same margins I have seen during the past 29 years with firms who have had funeral planning <span style=\"text-decoration: underline;\">information properly presented and understood<\/span> with both their accountant and the accounting format that is used<strong>.  <span style=\"text-decoration: underline;\">Most of the well-managed firms with whom I am familiar have consistently enjoyed profit margins (as a percentage of revenue) of at least ten to 15 percent and above<\/span>.<\/strong><\/p>\n<p><strong><span style=\"text-decoration: underline;\">My Candid Recommendation<\/span><\/strong><\/p>\n<p>So, in answer to the first question — &#8220;The ‘Why”— , my response is that accounting is certainly important for tax and banking use.  However, the most basic use, the absolutely most important use, is to <strong>PLAN<\/strong> <span style=\"text-decoration: underline;\">in an accurate and timely manner for the right combination of income and expenses to provide adequate profits year in and year out<\/span>. One more thing:  <em>If you cannot use what you get or produce (internally) for profit planning from your accounting, then you need to search further until you find it<strong>.  Do it <span style=\"text-decoration: underline;\">now<\/span><\/strong>.<\/em><\/p>\n<p>A concise answer to “definition” of accounting is not only that the accounting system, format and chart of accounts must be correct, but also that your <span style=\"text-decoration: underline;\">Accountant<\/span> must have the knowledge and expertise to provide you with the guidance for profitability in your funeral business.<\/p>\n<p>For “HOW do you do your accounting?” this is, hopefully, a jab in the ribs for you. Over the years I have presented dozens of Profit-Planning workshops for funeral directors, and have lectured to groups on both a regional and national basis.  Almost always I start by asking the question of, “How many funeral home owners in this audience have calculated their cost of conducting a funeral?” (which most funeral directors use the word “Overhead”) <span style=\"text-decoration: underline;\">I cannot remember ever getting a show of hands of more than 20% of the audience<\/span>.<\/p>\n<p>So, the rhetorical question then becomes, <strong><span style=\"text-decoration: underline;\">how in the world can you accurately plan your pricing to be profitable when all you know about your costs is the casket and vault invoice? This still is about SERVICE, is it not<\/span>?<\/strong><\/p>\n<p>Let’s wind this up with a few simple statements about what you need to have in the way of accounting.<\/p>\n<p>When you get your financials as the year progresses, you must not only get the answer to what has already happened, but WHY your bottom line is up or down.  Example:  If you have a 300 call business, and at the six month point you have served 165 families, you already know your profit is going to be <strong><span style=\"text-decoration: underline;\">UP!<\/span><\/strong> But that is not the point—this is obvious.  Does your statement identify exactly <span style=\"text-decoration: underline;\">how much<\/span> profit comes from those added 15 families?  But does it also measure for you if your service charge is recovering the planned amount?  Is your casket average where you planned, and if not, what is the dollar effect? Same with cremation average&#8230; same with vault average?<\/p>\n<p>Too often when volume is up, other profit centers are under performing, and because they are operating in the shadow of an up-volume year, no one ever realizes that part of the deserved profit is going up the chimney&#8212;never to be seen again.<\/p>\n<p>I said at the beginning this is not about taxes.  That belongs with the tax expert.  But let us be clear about priorities when the same firm that does your taxes is also doing your accounting.  I know tax season is very busy and stressful.  But it does not mean&#8212;it absolutely cannot mean&#8212; that your accounting is delayed while taxes are done, and you are operating in the dark about what is happening both top and bottom line, receivables and cash flow.  You cannot afford to operate one single day with your only financial knowledge being the balance in your check book.<\/p>\n<p>Finally, does the accountant or advisor you presently retain know and understand all the dynamics of funeral service planning backwards and forwards and, with his help, you also have a pricing and expense <strong><span style=\"text-decoration: underline;\">PLAN<\/span> <\/strong>in place <span style=\"text-decoration: underline;\">when your New Year beginsU<\/span><\/p>\n<p>If you get “<a title=\"Funeral Management Consulting\" href=\"\/funeral-home-business-services\/management-services\/\" target=\"_blank\">Management Advice and Planning<\/a>” four to five months after the year starts, what good is it?<\/p>\n<p>Yes, I know the question you are probably asking.  How in the world can I plan profit when my 200 call business is 180 one year and 220 another?  Those of us, who are experts in the Planning for Funeral Profits area, know and understand the answer and are more than willing to share it with friends and clients alike.<\/p>\n<p>Today, most of us use a GPS — Global Positioning System — to help in travel as we drive around in unfamiliar territory.  With a GPS you know <strong><span style=\"text-decoration: underline;\">exactly where you are.<\/span> <\/strong>Moreover, you know exactly where and when to turn a corner, turn left or turn right.<\/p>\n<p>Let me offer an example that all should understand — especially in a time in which most of us fly quite frequently. Which of the two airlines would you select when going from New York to California?<\/p>\n<p><strong><span style=\"text-decoration: underline;\">Airline number one<\/span><\/strong> takes off and “heads west”.  <strong><span style=\"text-decoration: underline;\">Airline number two<\/span><\/strong> has a flight plan and navigation systems – GPS — that tells them in advance exactly where and at what altitude they need to be the entire 2500 miles.<\/p>\n<p>The answer is obvious… airline number two.<\/p>\n<p>There is no guess work with airline number two.  Why should you also guess about the profits your pricing will produce?  Would you not want GPS accuracy in determining the profits in your business?  And, after all, it is primarily the profitability of your business that determines the <strong>VALUE of your business<\/strong> when you are ready to sell or pass it along to a family member.<\/p>\n<p>Do you run your business like airline number one?  Are you winging it?  Are you “heading west”?<\/p>\n<p>Or are you running your business with the precision of a GPS?<\/p>\n<p>It is your bottom line and quality of life that we are talking about.  It is the value of your business that is ultimately determined by the way you manage.  Is it going to be with precision? Or is it going to be by chance?<\/p>\n","protected":false},"excerpt":{"rendered":"<p>BY DALE ESPICH In my 40-plus years in working with funeral directors as a management consultant, I have seen just about every description and methods of “Accounting” used to try to keep track of income, expense and profit\/loss. Let me throw out a series of questions to get your thought juices flowing and then we [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","inline_featured_image":false,"footnotes":""},"categories":[3],"tags":[],"class_list":["post-472","post","type-post","status-publish","format-standard","hentry","category-articles"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v21.0 (Yoast SEO v24.3) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Let’s Do an “Accounting Quiz” It’s all About The Why - The How - The What - The Who - Johnson Consulting Group<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.johnsonconsulting.com\/accounting-quiz-the-why-the-how-the-what-the-who\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Let’s Do an “Accounting Quiz” It’s all About The Why - The How - The What - The Who\" \/>\n<meta property=\"og:description\" content=\"BY DALE ESPICH In my 40-plus years in working with funeral directors as a management consultant, I have seen just about every description and methods of “Accounting” used to try to keep track of income, expense and profit\/loss. Let me throw out a series of questions to get your thought juices flowing and then we [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.johnsonconsulting.com\/accounting-quiz-the-why-the-how-the-what-the-who\/\" \/>\n<meta property=\"og:site_name\" content=\"Johnson Consulting Group\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/JohnsonConsulting\" \/>\n<meta property=\"article:published_time\" content=\"2009-09-09T02:34:46+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2015-02-27T19:19:30+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.johnsonconsulting.com\/images\/dale-espich.jpg\" \/>\n<meta name=\"author\" content=\"JCGAdmin\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@johnsonfuneral\" \/>\n<meta name=\"twitter:site\" content=\"@johnsonfuneral\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"JCGAdmin\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/accounting-quiz-the-why-the-how-the-what-the-who\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/accounting-quiz-the-why-the-how-the-what-the-who\/\"},\"author\":{\"name\":\"JCGAdmin\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/c9c70bea2fea0f478e05fa37ad0f930c\"},\"headline\":\"Let’s Do an “Accounting Quiz” It’s all About The Why &#8211; The How &#8211; The What &#8211; The Who\",\"datePublished\":\"2009-09-09T02:34:46+00:00\",\"dateModified\":\"2015-02-27T19:19:30+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/accounting-quiz-the-why-the-how-the-what-the-who\/\"},\"wordCount\":1865,\"publisher\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/accounting-quiz-the-why-the-how-the-what-the-who\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.johnsonconsulting.com\/images\/dale-espich.jpg\",\"articleSection\":[\"Articles\"],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/accounting-quiz-the-why-the-how-the-what-the-who\/\",\"url\":\"https:\/\/www.johnsonconsulting.com\/accounting-quiz-the-why-the-how-the-what-the-who\/\",\"name\":\"Let’s Do an “Accounting Quiz” It’s all About The Why - The How - The What - The Who - Johnson Consulting Group\",\"isPartOf\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/accounting-quiz-the-why-the-how-the-what-the-who\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/accounting-quiz-the-why-the-how-the-what-the-who\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.johnsonconsulting.com\/images\/dale-espich.jpg\",\"datePublished\":\"2009-09-09T02:34:46+00:00\",\"dateModified\":\"2015-02-27T19:19:30+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/accounting-quiz-the-why-the-how-the-what-the-who\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.johnsonconsulting.com\/accounting-quiz-the-why-the-how-the-what-the-who\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/accounting-quiz-the-why-the-how-the-what-the-who\/#primaryimage\",\"url\":\"https:\/\/www.johnsonconsulting.com\/images\/dale-espich.jpg\",\"contentUrl\":\"https:\/\/www.johnsonconsulting.com\/images\/dale-espich.jpg\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/accounting-quiz-the-why-the-how-the-what-the-who\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.johnsonconsulting.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Let’s Do an “Accounting Quiz” It’s all About The Why &#8211; The How &#8211; The What &#8211; The Who\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#website\",\"url\":\"https:\/\/www.johnsonconsulting.com\/\",\"name\":\"Johnson Consulting Group\",\"description\":\"Funeral Home and Cemetery Consulting\",\"publisher\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.johnsonconsulting.com\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#organization\",\"name\":\"Johnson Consulting Group\",\"url\":\"https:\/\/www.johnsonconsulting.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png\",\"contentUrl\":\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png\",\"width\":576,\"height\":222,\"caption\":\"Johnson Consulting Group\"},\"image\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/JohnsonConsulting\",\"https:\/\/x.com\/johnsonfuneral\",\"https:\/\/www.linkedin.com\/company\/johnson-consulting-group\/\",\"https:\/\/www.youtube.com\/user\/JohnsonConsultingInc\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/c9c70bea2fea0f478e05fa37ad0f930c\",\"name\":\"JCGAdmin\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/5520c11611a67c1bcae496d454b34b8b?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/5520c11611a67c1bcae496d454b34b8b?s=96&d=mm&r=g\",\"caption\":\"JCGAdmin\"},\"url\":\"https:\/\/www.johnsonconsulting.com\/author\/jcgadmin\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Let’s Do an “Accounting Quiz” It’s all About The Why - The How - The What - The Who - Johnson Consulting Group","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.johnsonconsulting.com\/accounting-quiz-the-why-the-how-the-what-the-who\/","og_locale":"en_US","og_type":"article","og_title":"Let’s Do an “Accounting Quiz” It’s all About The Why - The How - The What - The Who","og_description":"BY DALE ESPICH In my 40-plus years in working with funeral directors as a management consultant, I have seen just about every description and methods of “Accounting” used to try to keep track of income, expense and profit\/loss. Let me throw out a series of questions to get your thought juices flowing and then we [&hellip;]","og_url":"https:\/\/www.johnsonconsulting.com\/accounting-quiz-the-why-the-how-the-what-the-who\/","og_site_name":"Johnson Consulting Group","article_publisher":"https:\/\/www.facebook.com\/JohnsonConsulting","article_published_time":"2009-09-09T02:34:46+00:00","article_modified_time":"2015-02-27T19:19:30+00:00","og_image":[{"url":"https:\/\/www.johnsonconsulting.com\/images\/dale-espich.jpg","type":"","width":"","height":""}],"author":"JCGAdmin","twitter_card":"summary_large_image","twitter_creator":"@johnsonfuneral","twitter_site":"@johnsonfuneral","twitter_misc":{"Written by":"JCGAdmin","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.johnsonconsulting.com\/accounting-quiz-the-why-the-how-the-what-the-who\/#article","isPartOf":{"@id":"https:\/\/www.johnsonconsulting.com\/accounting-quiz-the-why-the-how-the-what-the-who\/"},"author":{"name":"JCGAdmin","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/c9c70bea2fea0f478e05fa37ad0f930c"},"headline":"Let’s Do an “Accounting Quiz” It’s all About The Why &#8211; The How &#8211; The What &#8211; The Who","datePublished":"2009-09-09T02:34:46+00:00","dateModified":"2015-02-27T19:19:30+00:00","mainEntityOfPage":{"@id":"https:\/\/www.johnsonconsulting.com\/accounting-quiz-the-why-the-how-the-what-the-who\/"},"wordCount":1865,"publisher":{"@id":"https:\/\/www.johnsonconsulting.com\/#organization"},"image":{"@id":"https:\/\/www.johnsonconsulting.com\/accounting-quiz-the-why-the-how-the-what-the-who\/#primaryimage"},"thumbnailUrl":"https:\/\/www.johnsonconsulting.com\/images\/dale-espich.jpg","articleSection":["Articles"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/www.johnsonconsulting.com\/accounting-quiz-the-why-the-how-the-what-the-who\/","url":"https:\/\/www.johnsonconsulting.com\/accounting-quiz-the-why-the-how-the-what-the-who\/","name":"Let’s Do an “Accounting Quiz” It’s all About The Why - The How - The What - The Who - Johnson Consulting Group","isPartOf":{"@id":"https:\/\/www.johnsonconsulting.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.johnsonconsulting.com\/accounting-quiz-the-why-the-how-the-what-the-who\/#primaryimage"},"image":{"@id":"https:\/\/www.johnsonconsulting.com\/accounting-quiz-the-why-the-how-the-what-the-who\/#primaryimage"},"thumbnailUrl":"https:\/\/www.johnsonconsulting.com\/images\/dale-espich.jpg","datePublished":"2009-09-09T02:34:46+00:00","dateModified":"2015-02-27T19:19:30+00:00","breadcrumb":{"@id":"https:\/\/www.johnsonconsulting.com\/accounting-quiz-the-why-the-how-the-what-the-who\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.johnsonconsulting.com\/accounting-quiz-the-why-the-how-the-what-the-who\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.johnsonconsulting.com\/accounting-quiz-the-why-the-how-the-what-the-who\/#primaryimage","url":"https:\/\/www.johnsonconsulting.com\/images\/dale-espich.jpg","contentUrl":"https:\/\/www.johnsonconsulting.com\/images\/dale-espich.jpg"},{"@type":"BreadcrumbList","@id":"https:\/\/www.johnsonconsulting.com\/accounting-quiz-the-why-the-how-the-what-the-who\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.johnsonconsulting.com\/"},{"@type":"ListItem","position":2,"name":"Let’s Do an “Accounting Quiz” It’s all About The Why &#8211; The How &#8211; The What &#8211; The Who"}]},{"@type":"WebSite","@id":"https:\/\/www.johnsonconsulting.com\/#website","url":"https:\/\/www.johnsonconsulting.com\/","name":"Johnson Consulting Group","description":"Funeral Home and Cemetery Consulting","publisher":{"@id":"https:\/\/www.johnsonconsulting.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.johnsonconsulting.com\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.johnsonconsulting.com\/#organization","name":"Johnson Consulting Group","url":"https:\/\/www.johnsonconsulting.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/","url":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png","contentUrl":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png","width":576,"height":222,"caption":"Johnson Consulting Group"},"image":{"@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/JohnsonConsulting","https:\/\/x.com\/johnsonfuneral","https:\/\/www.linkedin.com\/company\/johnson-consulting-group\/","https:\/\/www.youtube.com\/user\/JohnsonConsultingInc"]},{"@type":"Person","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/c9c70bea2fea0f478e05fa37ad0f930c","name":"JCGAdmin","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/5520c11611a67c1bcae496d454b34b8b?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/5520c11611a67c1bcae496d454b34b8b?s=96&d=mm&r=g","caption":"JCGAdmin"},"url":"https:\/\/www.johnsonconsulting.com\/author\/jcgadmin\/"}]}},"_links":{"self":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/posts\/472","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/comments?post=472"}],"version-history":[{"count":0,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/posts\/472\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/media?parent=472"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/categories?post=472"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/tags?post=472"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}