{"id":61,"date":"2008-07-17T07:30:11","date_gmt":"2008-07-17T12:30:11","guid":{"rendered":"http:\/\/johnsoncg.wpengine.com\/making-better-decisions-is-a-matter-of-having-better-information-glenn-gould\/"},"modified":"2021-09-06T01:43:04","modified_gmt":"2021-09-06T08:43:04","slug":"better-information-better-decisions","status":"publish","type":"post","link":"https:\/\/www.johnsonconsulting.com\/better-information-better-decisions\/","title":{"rendered":"Making Better Decisions is a Matter of Having Better Information &#8211; Glenn Gould"},"content":{"rendered":"<p><!--<img loading=\"lazy\" decoding=\"async\" src=\"\/images\/glenn-gould.jpg\" alt=\"Glenn Gould\" width=\"164\" height=\"194\" align=\"right\" hspace=\"5\" vspace=\"5\" \/>-->Every four years American voters most intimate social and political thoughts are picked and studied as politicians develop platforms, positions and talking points. This is where the period of peak demand for research services, but also where theory and practical application meet. Politicians will pay whatever is necessary for new research techniques that will reveal data competitors will not have. The success of these ideas filter into commercial applications after they have been proven in the political arena.<\/p>\n<p>Tightening profit margins in funeral service are causing funeral business of all sizes to develop strategic plans. Long term and short term plans that involve succession planning with younger generations acquiring family businesses, advertising budgets, acquisition and sale of businesses or properties. All important, perhaps life changing, decisions.<\/p>\n<p>Management consultants meet with family business owners to assist in this process, and they ask important questions; what is your market share, why do people use your firm versus competitors, and vice versa? Is your location, facility, staff, prices, services, name awareness, image, and pre-need competitive in the market? Too often these questions are answered based upon perceptions, or misperceptions, family members have held for generations, starting with great, great grand daddy.<\/p>\n<p>Too often these marketing plans simply reinforce existing assumptions. Owners and managers will assume that everyone believe like they do about services, competitors, prices and facilities. The reality is without some source of objective data, developing a long term strategy without market research is like getting a physical without a blood test.<\/p>\n<p><strong>How Market Research Contributes to Planning<\/strong><\/p>\n<p>The cost of marketing-by-assumption can be enormously high, particularly when an organized market profile study can easily prevent mistakes. When people know rather than assume they will make significantly better decisions. Market research will pin-point consumer groups who may not be aware of your funeral firm or could be attracted to patronize a particular funeral home if they were made aware of the special services provided, such as on-site crematories, reception and children&#8217;s rooms. Creating advertising that will impact decision making is far easier once the consumer&#8217;s hot buttons have been identified.<\/p>\n<p>Another benefit of a market analysis for existing facilities is to determine the importance of certain criteria in the selection of a funeral home. In some regions, consumers are very familiar with their funeral home options and are likely to refer to their own experience when selecting a funeral home. But, in a highly mobile society where as much as 20% of residents relocate annually, there are many consumers with no local funeral home experience upon which to base a decision. In these cases, it is important to have an understanding of the role the clergy, yellow pages, internet, print and broadcast media advertising play in funeral home selection.<\/p>\n<p><strong>Using Market Research to Plan New Facilities and Acquisition<\/strong><\/p>\n<p>The tradition of funeral service is to take uncalculated risk when expanding or building a new funeral facility. Through pure tenacity on the part of owner\/operators, many of the nation&#8217;s newer funeral homes have remained open when business volume did not merit the cost. Most of these unnecessary and expensive facilities could have been avoided by a moderate investment in consumer market research.<\/p>\n<p>Many funeral homes have been built because an operator in a neighboring community felt the funeral homes in the area did not provide quality services, or their facilities were inadequate. These assumptions ignore a fundamental element of funeral service: that funeral business, like many other businesses, is more about personal relationships than any other single factor. Judging a funeral business by its building or service is the same as judging a book by its cover. Typically, the existing firms in an area meet the local clientele&#8217;s expectations. It can take years for a new facility to build volume simply because residents like the owners of a competitive firm, regardless of the building or prices.<\/p>\n<p>A market research study during the planning stages of a new facility will reveal information about prospective consumers by focusing on they really want from a funeral home; what factors they consider when selecting a funeral home. Accurate and specific consumer attitudinal information about a prospective trade area can predict at-need volume and assist funeral home owners and managers in determining the demand for a particular facility. Fundamental questions like location, building design and size can be answered.<\/p>\n<p>Over the past five years, only one of every two clients conducting a prospective trade area study has decided to move ahead with new facilities. This means that half of the time owners that were prepared to invest millions of dollars in new facilities were dissuaded from moving ahead based upon information they learned from market research, such as:<\/p>\n<ul>\n<li>What influences a family to choose one funeral home over another?<\/li>\n<li>What families see as assets and liabilities of one facility versus another?<\/li>\n<li>The proportion of consumers owning a pre-paid funeral.<\/li>\n<li>The proportion of families who are unsure as to which funeral facility they will patronize.<\/li>\n<li>Sources used to select a funeral home.<\/li>\n<li>Present and projected volume of deaths in an area.<\/li>\n<li>Demographics, i.e.: age, income, length of residence.<\/li>\n<\/ul>\n<p>Prior to purchasing property for a new facility, research will indicate whether or not there is sufficient at-need volume to support a proposed facility or if one site would be more productive than another. By understanding the consumer&#8217;s priorities, marketing efforts are made more efficient and productive. A funeral firm can be assessed in terms of:<\/p>\n<ul>\n<li>How well known and liked is the staff by local consumers?<\/li>\n<li>How does the firm&#8217;s reputation compare to that of others in the area?<\/li>\n<li>Does the firm meet the consumers expectations as far as flexible costs and services?<\/li>\n<li>Is the firm associated with one religious group more than another?<\/li>\n<li>Do consumers see value in special services such as aftercare, pre-need or rental caskets?<\/li>\n<\/ul>\n<p>Having conducted 600 market research studies and moderated hundreds of focus groups and test panels for funeral homes, cemeteries and death care industry vendors, the most amazing phenomena is to observe an intelligent business manager make a business decision with significant long term implications in direct contradiction to hard research data. It&#8217;s impossible to list all of the instances when this has occurred, but the following are typical:<\/p>\n<ul>\n<li>A mid-west funeral home owner commissioned a research study to determine the prospects for a new funeral home in a relatively large city. The research data demonstrated that the client already pulled most of the business from this area and because the population was so young and transient, the number of deaths from the area would not increase for many years. The client chose to proceed with the new facility under the rationale that he had two sons and wanted each to have their own business. The client was apprised that what he was actually doing was digging an expensive hole from which his son would spend the rest of his career trying to emerge, but the facility was built. Fifteen years later it has yet to conduct a sufficient number of calls annually to meet the overhead cost.<\/li>\n<li>A major industry vendor was considering a personalization product to replace a more generic standard product that all funeral homes use. The proposed product had merit as it was more attractive, but the nature of the product made it very cumbersome for funeral homes as it would require them to carry extensive inventory. The client observed two focus groups of funeral directors, each of which made it very clear they would not purchase the product because of the need for a large inventory and because the product is so specific as to limited the opportunities for use. None the less, the client ignored the research finding and pursued the product. The product failed miserably and contributed to the president&#8217;s termination.<\/li>\n<li>A funeral home client in a mid-western city had not initiated a pre-need marketing effort even as competitors experienced good success with their individual efforts. The client conducted a research study which clearly demonstrated that the competition was gaining market share among younger adults (age 55+) primarily through their pre-need sales efforts. The research also demonstrated that consumers did not believe the client offered pre-need and had reluctantly shifted their preference to other firms that did offer pre-need. As the age 55+ consumers aged into the age 65+ generation, the client funeral home has steadily lost market share among families preferring traditional burial and now has a far higher cremation rate than the competition. The very high cremation rate has resulted in lower profit margins, and the owners have lost tremendous equity as the acquisition value of the firm has declined.<\/li>\n<li>Funeral home owners often consider building a new funeral home too near a major competitor under the assumption that being located near a major competitor is a good strategy for pulling business from the competitor. Research and experience has demonstrated just the opposite. Consumers need a good reason to change their funeral home preference from one firm to another, and simply locating near their preferred funeral home is not good enough. A market research study was suggested to a client that had intentions to do exactly the above. The research was conducted and the results demonstrated that a new facility in another area of town would be far more successful. None the less the client built the new facility on property near the competitor. Today that facility is law offices.<\/li>\n<li>A funeral business has two facilities that operate with similar, but different names. One of the facilities has never performed as well as the other. The owner commissioned a research study to determine why one building was so much more successful then the other. The results demonstrated that consumers did not know the two buildings were owned by the same company and held negative images perceptions of the less successful facility. The solution was obvious; change the name of the less successful facility to reflect the common ownership and promote the two facilities under one name. Management was reticent to drop the heritage names associated with the underperforming facility, and to date, the facility continues to underperform.<\/li>\n<li>A large manufacturing company commissioned test panels to create a merchandising system that would sell more profitable product. The research results dramatically indicated that the product line was to broad and that sales would improve by deleting lower end products, implementing a &#8220;good, better, best&#8221; merchandising strategy, and using a presentation book or computer based presentation as opposed to the current selection room merchandising strategy. Although investing in excess of $100,000 in the study, the results were never implemented; product mix continues to be the company&#8217;s primary challenge.<\/li>\n<\/ul>\n<p>Perhaps the same mentality explains why so many funeral homes and cemeteries pursue courses that run contrary not only to research findings, but empirical data as well.<\/p>\n<ul>\n<li>Funeral businesses nationally have installed reception rooms with outstanding success when funeral arrangers are trained to present their catering services, yet the great majority of funeral homes fail to take advantage of this obvious opportunity.<\/li>\n<li>Funeral home profits are declining precipitously from cremation, but so few firms are implementing arrangement room strategies such as packaging, and presentations systems that have proven to increase sales and customer satisfaction.<\/li>\n<li>Response to lead generating advertising has consistently declined over fifteen years as cemeteries try to sell traditional graves and mausoleum. Research indicates 80% of consumers that want burial already own cemetery space. Direct response advertising, particularly advertising that offers price discounts succeeds only when there is a pent up demand for the product. 61% of adults age 45+ are either unaware of cremation memorials at cemeteries are simply do not want memorials, as such the advertising fails simply because there is no audience. The objective of cemetery advertising should be to create a demand for cemetery memorilization instead of further deteriorating the perceived value of cemetery memorials as opposed misleading &#8220;free veteran space&#8221; advertising.<\/li>\n<li>There are too many funeral homes in the US; as a result weaker firms are becoming financially desperate. Because desperate people take desperate risks, pre-need and other financial scandals are rampant in the death care industry. There is an obvious need for legislation to protect the consumer from unscrupulous funeral home and cemetery operators, but the state and national associations have failed to take a proactive position by recommending regulation that could preclude the actions of a few from undermining the public&#8217;s confidence in all death care businesses while also protecting the public.<\/li>\n<li>Local ownership has been the most successful advertising strategy ever implemented in the funeral home industry at shifting business from one funeral home to another. In fact, local ownership advertising is one of the main reasons the corporations are selling off isolated facilities where they are at a competitive disadvantage with locally owned firms in deference to markets where corporate operated funeral homes dominate. Yet, independent funeral homes have convinced themselves consumers no longer care about ownership because they don&#8217;t hear them talk about it anymore. It is so apparent that consumers considered ownership important when advertising informed them of the local versus corporate issue. Consumers learn the issues they should consider through advertising so your advertising must raise the issues you want consumers to consider important; not the other way around.<\/li>\n<\/ul>\n<p><strong>Making Market Research Work<\/strong><\/p>\n<p>There are many methods for collecting consumer data, and each was developed to meet a specific need. Focus groups are becoming increasingly common in funeral service as management teams need qualitative data that can not be ascertained through telephone interviews. Focus groups bring residents of your community together to discuss issues important to you; such as special services, the consumer&#8217;s understanding of cremation, memorialization with cremation, columbarium niches, cremation scattering options in cemeteries, and other options.<\/p>\n<p>Most funeral home research needs are quantitative in nature, meaning a large number of respondents must be surveyed. Quantitative research answers fundamental questions such as why one firm is preferred over another, why is volume down, what do consumers like about one firm, versus another, and what are the opportunities for market share gains.<\/p>\n<p>It&#8217;s very easy to commission a research study that produces 200 pages of charts and graphs but no practical information, no recommendations or direction upon which to base a decision. One funeral home owner was convinced to conduct a mail out survey study. The questionnaire was sent to adult residents of his community; of which only 12 were returned, six of which were clergy members. A thick report was produced, which obviously had no value what so ever at reporting what the community thought about the local funeral homes.<\/p>\n<p>Market research should be used to investigate specific rather than general issues. For example, the most common question business people will ask is &#8220;Why do consumers do what they do?&#8221; Determining &#8220;why&#8221; is deceptively difficult. When people are asked direct questions about what they do, they are inclined to answer with rationalizations rather than reasons because people want other people to believe they are reasonable. So, they search for ways to rationalize their behavior and make their actions acceptable to others. Answering &#8220;why&#8221; is not a realistic research objective; but knowing what consumers will do meets our needs as marketers. Market research should answer specific questions that contribute to specific decisions rather than a long list of generalizations:<\/p>\n<blockquote><p><em>&#8220;Is there a market for this new facility?&#8221;<br \/>\n&#8220;How much can we charge for our services?&#8221;<br \/>\n&#8220;How much opportunity is there in the market for volume growth?&#8221;<br \/>\n&#8220;What do I have to do to grow this business?&#8221;<br \/>\n&#8220;How is my pre-need program doing compared to others in this market?&#8221;<\/em><\/p><\/blockquote>\n<p>Involve all individuals with responsible positions within the firm to recommend issues that should be investigated by the research. Whether at-need, pre-need, or family follow-up, there will be important questions which, when answered, will allow this individual to better perform and may apprise the rest of the organization of special opportunities.<\/p>\n<p>Make a commitment to accept the results of the research study even when they run contrary to held beliefs. The marketplace is full of misinformation. Consumers believe things to be true that you may know to be false. This does not mean the survey is wrong; rather, someone is misinformed. One of the greatest contributions of a market profile study is to reveal areas of misinformation so as to allow managers to make their promotion and advertising more effective and productive by realigning perceptions.<\/p>\n<p><strong>Conclusion<\/strong><\/p>\n<p>The dynamics of a sophisticated and diverse consumer market combined with high interest rates and construction costs and a fiercely competitive marketplace make a careful marketing plan for prospective or existing funeral facilities essential for success.<\/p>\n<p>Every manager and owner in the funeral industry should be alert for ways to reduce the risks of a new facility and for ways to generate greater volume at existing facilities. As many funeral professionals have stated, &#8220;It costs too much today to make mistakes.&#8221; To avoid that end, market research can be a most helpful tool.<\/p>\n<p>Remember, marketing-by-assumption leaves open the possibility that it may be you who is misinformed and not the consumer.<\/p>\n<p>~ Glenn H. Gould, CEO, <a href=\"https:\/\/www.mkjmarketing.com\" target=\"_blank\" rel=\"noopener\">MKJ Marketing<\/a>.<\/p>\n<p><em>Glenn&#8217;s diverse management and consulting experience has contributed to MKJ Marketing becoming the leading marketing influence in the death care industry. His new book Deathcare Marketing, 25 FAQ&#8217;s; has recently gained NFDA endorsement, and is in use by mortuary schools. Glenn&#8217;s articles appear regularly in major death care industry publications, and he is a frequent presenter on death services marketing at seminars and conferences. <\/em><\/p>\n<p><em>Glenn&#8217;s work experience includes executive positions with Bausch &amp; Lomb, General Mills and the Batesville Casket Division of Hillenbrand Industries. In funeral service Glenn assists funeral homes and death care industry vendors in establishing marketing and advertising plans. He is recognized for his market research services having conducted over 500 positioning and prospective trade area studies for funeral homes throughout the US and Canada. In addition, Glenn has conducted quantitative research studies, moderated focus groups and\/or consulted to:<\/em><\/p>\n<ul>\n<li><em>Wilbert, Inc.<\/em><\/li>\n<li><em>The Woodlawn Cemetery<\/em><\/li>\n<li><em>Funeral Service Foundation<\/em><\/li>\n<li><em>Capital Holding<\/em><\/li>\n<li><em>Open Dialogue<\/em><\/li>\n<li><em>Columbian Financial Group<\/em><\/li>\n<li><em>Keystone Group Holdings<\/em><\/li>\n<li><em>Aurora Casket Company<\/em><\/li>\n<li><em>Consolidated National Life<\/em><\/li>\n<\/ul>\n<p><em>Glenn has testified in multiple civil suits between funeral homes as an expert witness, served on the Board of Directors of the Pittsburgh Institute of Mortuary Science and instructed the Small Business Class for the St. Petersburg College, School of Mortuary Sciences. His biography appears in Who&#8217;s Who in America; he holds BA and MS Degrees.<\/em><\/p>\n<p><a title=\"July 2008 Management Insights Newsletter\" href=\"\/2008\/07\/24\/july-2008-management-insights-newsletter\/\">Return to the July 2008 Management Insights Newsletter<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Every four years American voters most intimate social and political thoughts are picked and studied as politicians develop platforms, positions and talking points. This is where the period of peak demand for research services, but also where theory and practical application meet. Politicians will pay whatever is necessary for new research techniques that will reveal [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","inline_featured_image":false,"footnotes":""},"categories":[3],"tags":[],"class_list":["post-61","post","type-post","status-publish","format-standard","hentry","category-articles"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v21.0 (Yoast SEO v24.3) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Making Better Decisions is a Matter of Having Better Information - Glenn Gould - Johnson Consulting Group<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.johnsonconsulting.com\/better-information-better-decisions\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Making Better Decisions is a Matter of Having Better Information - Glenn Gould\" \/>\n<meta property=\"og:description\" content=\"Every four years American voters most intimate social and political thoughts are picked and studied as politicians develop platforms, positions and talking points. This is where the period of peak demand for research services, but also where theory and practical application meet. Politicians will pay whatever is necessary for new research techniques that will reveal [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.johnsonconsulting.com\/better-information-better-decisions\/\" \/>\n<meta property=\"og:site_name\" content=\"Johnson Consulting Group\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/JohnsonConsulting\" \/>\n<meta property=\"article:published_time\" content=\"2008-07-17T12:30:11+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-09-06T08:43:04+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.johnsonconsulting.com\/images\/glenn-gould.jpg\" \/>\n<meta name=\"author\" content=\"JCGAdmin\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@johnsonfuneral\" \/>\n<meta name=\"twitter:site\" content=\"@johnsonfuneral\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"JCGAdmin\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"15 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/better-information-better-decisions\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/better-information-better-decisions\/\"},\"author\":{\"name\":\"JCGAdmin\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/c9c70bea2fea0f478e05fa37ad0f930c\"},\"headline\":\"Making Better Decisions is a Matter of Having Better Information &#8211; Glenn Gould\",\"datePublished\":\"2008-07-17T12:30:11+00:00\",\"dateModified\":\"2021-09-06T08:43:04+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/better-information-better-decisions\/\"},\"wordCount\":3079,\"publisher\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#organization\"},\"articleSection\":[\"Articles\"],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/better-information-better-decisions\/\",\"url\":\"https:\/\/www.johnsonconsulting.com\/better-information-better-decisions\/\",\"name\":\"Making Better Decisions is a Matter of Having Better Information - Glenn Gould - Johnson Consulting Group\",\"isPartOf\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#website\"},\"datePublished\":\"2008-07-17T12:30:11+00:00\",\"dateModified\":\"2021-09-06T08:43:04+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/better-information-better-decisions\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.johnsonconsulting.com\/better-information-better-decisions\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/better-information-better-decisions\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.johnsonconsulting.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Making Better Decisions is a Matter of Having Better Information &#8211; Glenn Gould\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#website\",\"url\":\"https:\/\/www.johnsonconsulting.com\/\",\"name\":\"Johnson Consulting Group\",\"description\":\"Funeral Home and Cemetery Consulting\",\"publisher\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.johnsonconsulting.com\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#organization\",\"name\":\"Johnson Consulting Group\",\"url\":\"https:\/\/www.johnsonconsulting.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png\",\"contentUrl\":\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png\",\"width\":576,\"height\":222,\"caption\":\"Johnson Consulting Group\"},\"image\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/JohnsonConsulting\",\"https:\/\/x.com\/johnsonfuneral\",\"https:\/\/www.linkedin.com\/company\/johnson-consulting-group\/\",\"https:\/\/www.youtube.com\/user\/JohnsonConsultingInc\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/c9c70bea2fea0f478e05fa37ad0f930c\",\"name\":\"JCGAdmin\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/5520c11611a67c1bcae496d454b34b8b?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/5520c11611a67c1bcae496d454b34b8b?s=96&d=mm&r=g\",\"caption\":\"JCGAdmin\"},\"url\":\"https:\/\/www.johnsonconsulting.com\/author\/jcgadmin\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Making Better Decisions is a Matter of Having Better Information - Glenn Gould - Johnson Consulting Group","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.johnsonconsulting.com\/better-information-better-decisions\/","og_locale":"en_US","og_type":"article","og_title":"Making Better Decisions is a Matter of Having Better Information - Glenn Gould","og_description":"Every four years American voters most intimate social and political thoughts are picked and studied as politicians develop platforms, positions and talking points. This is where the period of peak demand for research services, but also where theory and practical application meet. Politicians will pay whatever is necessary for new research techniques that will reveal [&hellip;]","og_url":"https:\/\/www.johnsonconsulting.com\/better-information-better-decisions\/","og_site_name":"Johnson Consulting Group","article_publisher":"https:\/\/www.facebook.com\/JohnsonConsulting","article_published_time":"2008-07-17T12:30:11+00:00","article_modified_time":"2021-09-06T08:43:04+00:00","og_image":[{"url":"https:\/\/www.johnsonconsulting.com\/images\/glenn-gould.jpg","type":"","width":"","height":""}],"author":"JCGAdmin","twitter_card":"summary_large_image","twitter_creator":"@johnsonfuneral","twitter_site":"@johnsonfuneral","twitter_misc":{"Written by":"JCGAdmin","Est. reading time":"15 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.johnsonconsulting.com\/better-information-better-decisions\/#article","isPartOf":{"@id":"https:\/\/www.johnsonconsulting.com\/better-information-better-decisions\/"},"author":{"name":"JCGAdmin","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/c9c70bea2fea0f478e05fa37ad0f930c"},"headline":"Making Better Decisions is a Matter of Having Better Information &#8211; Glenn Gould","datePublished":"2008-07-17T12:30:11+00:00","dateModified":"2021-09-06T08:43:04+00:00","mainEntityOfPage":{"@id":"https:\/\/www.johnsonconsulting.com\/better-information-better-decisions\/"},"wordCount":3079,"publisher":{"@id":"https:\/\/www.johnsonconsulting.com\/#organization"},"articleSection":["Articles"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/www.johnsonconsulting.com\/better-information-better-decisions\/","url":"https:\/\/www.johnsonconsulting.com\/better-information-better-decisions\/","name":"Making Better Decisions is a Matter of Having Better Information - Glenn Gould - Johnson Consulting Group","isPartOf":{"@id":"https:\/\/www.johnsonconsulting.com\/#website"},"datePublished":"2008-07-17T12:30:11+00:00","dateModified":"2021-09-06T08:43:04+00:00","breadcrumb":{"@id":"https:\/\/www.johnsonconsulting.com\/better-information-better-decisions\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.johnsonconsulting.com\/better-information-better-decisions\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.johnsonconsulting.com\/better-information-better-decisions\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.johnsonconsulting.com\/"},{"@type":"ListItem","position":2,"name":"Making Better Decisions is a Matter of Having Better Information &#8211; Glenn Gould"}]},{"@type":"WebSite","@id":"https:\/\/www.johnsonconsulting.com\/#website","url":"https:\/\/www.johnsonconsulting.com\/","name":"Johnson Consulting Group","description":"Funeral Home and Cemetery Consulting","publisher":{"@id":"https:\/\/www.johnsonconsulting.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.johnsonconsulting.com\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.johnsonconsulting.com\/#organization","name":"Johnson Consulting Group","url":"https:\/\/www.johnsonconsulting.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/","url":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png","contentUrl":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png","width":576,"height":222,"caption":"Johnson Consulting Group"},"image":{"@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/JohnsonConsulting","https:\/\/x.com\/johnsonfuneral","https:\/\/www.linkedin.com\/company\/johnson-consulting-group\/","https:\/\/www.youtube.com\/user\/JohnsonConsultingInc"]},{"@type":"Person","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/c9c70bea2fea0f478e05fa37ad0f930c","name":"JCGAdmin","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/5520c11611a67c1bcae496d454b34b8b?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/5520c11611a67c1bcae496d454b34b8b?s=96&d=mm&r=g","caption":"JCGAdmin"},"url":"https:\/\/www.johnsonconsulting.com\/author\/jcgadmin\/"}]}},"_links":{"self":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/posts\/61","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/comments?post=61"}],"version-history":[{"count":0,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/posts\/61\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/media?parent=61"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/categories?post=61"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/tags?post=61"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}