{"id":6182,"date":"2021-10-21T13:37:59","date_gmt":"2021-10-21T20:37:59","guid":{"rendered":"https:\/\/www.johnsonconsulting.com\/?p=6182"},"modified":"2021-10-28T10:22:24","modified_gmt":"2021-10-28T17:22:24","slug":"plan-your-exit-strategy","status":"publish","type":"post","link":"https:\/\/www.johnsonconsulting.com\/plan-your-exit-strategy\/","title":{"rendered":"Plan Your Exit Strategy"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">According to a study from the National Funeral Directors Association, nearly 75% of funeral directors have <\/span><a href=\"https:\/\/rooseveltinvestments.com\/business-solutions-exit-planning\/\"><span style=\"font-weight: 400;\">neither an exit strategy nor a succession plan<\/span><\/a><span style=\"font-weight: 400;\">. Among those who do have a plan, the majority of them have yet to put it in writing, meaning they’ve yet to begin the real work of exit planning. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Exiting your business should never be planned in haste; rather, it should be a strategy laid out well in advance. There are some additional factors to consider in the funeral business, such as ownership, market conditions, and personal attachments to your funeral home–all of which must be accounted for in your exit strategy.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">To create a thorough exit strategy, you’ll want to consider the current state of your business, where you want it to go, and how this can be achieved without your assistance. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">What is an Exit Strategy? <\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Broadly speaking, an exit strategy is a detailed plan outlining what happens to a business when its owner departs. This written document will touch upon financial components, new ownership, and how the transition will be handled. For example, if you’re passing down your business to a child or relative––your exit strategy will identify the new owner, if and how they’ll be paying for the business, and how you’ll prepare them to assume the director position.  <\/span><\/p>\n<p><span style=\"font-weight: 400;\">While no two exit strategies look identical, they all answer the following questions:<\/span><\/p>\n<ul>\n<li style=\"list-style-type: none;\">\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">How will you make money when you exit your business? <\/span><\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"2\"><i><span style=\"font-weight: 400;\">Do you plan to sell the business, and who might you sell it to?<\/span><\/i><\/li>\n<\/ul>\n<ul>\n<li style=\"list-style-type: none;\">\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">What will happen to the business upon your departure?<\/span><\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"2\"><i><span style=\"font-weight: 400;\">Will your funeral home continue to operate? <\/span><\/i><\/li>\n<\/ul>\n<ul>\n<li style=\"list-style-type: none;\">\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">What will your exit look like?<\/span><\/li>\n<\/ul>\n<\/li>\n<li style=\"font-weight: 400;\" aria-level=\"2\"><i><span style=\"font-weight: 400;\">With what and for how long do you plan to assist the new owner?<\/span><\/i><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">When planning your exit strategy, you’ll want to consider it carefully as you thought out your initial business plan when starting your funeral home.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Benefits of Early Planning<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Even if you aren’t planning an imminent exit from your funeral business, it’s important to plan a strategy early. This will ensure a seamless transition in the event that something unexpected occurs––be it an issue of health, finances, or change in life plans.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">To start planning for your exit, you’ll want to consider your life goals, how your funeral business plays into them, how you can test your potential plan, and the resources you’ll need to execute it.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Time to Prioritize YOU <\/span><\/h3>\n<p><span style=\"font-weight: 400;\">You entered the funeral business to serve your community, but eventually, you have to consider your goals. Ideally, your funeral home has helped you make a good living for you and your family, but what do you plan to do with this money? Retire? Start another business? Provide financial security to your children and grandchildren? It’s never too early to put these goals in writing. Not only will these help you run your business and manage your money, but they’ll also impact how and when you exit your business. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">For example, if your ultimate goal is to save $2 million for retirement by age 60, you can keep track of how your business plays into this. Each year, you’ll be able to track your progress towards this goal and make adjustments as necessary. If you wait until an exit is imminent, you risk losing sight of your ultimate goals in a hasty transition.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">The Ability to Test Your Strategy <\/span><\/h3>\n<p><span style=\"font-weight: 400;\">A key metric to your exit strategy will be the value of your funeral business. Remember, much like a stock portfolio or 401k, your business is an investment. While its value is subject to fluctuation, it will play a large role in your retirement plan.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">This is why it’s important to get annual valuations of your funeral business. This way, you’ll be able to figure out if selling your business will provide you with what you need for future plans. If the value is too low for your needs, then you can correct your course and increase its value. It’s better to be aware of a lower-than-expected valuation than to be surprised when you’re ready to exit your business.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Getting the Right Resources in Place<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Unless you’ve previously exited a business, then you’ll probably have a lot of questions about what you need to consider. Planning early gives you the time needed to seek the assistance of professionals. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">You may want to consider partnering with a consultant in the death care industry who has the experience to guide you through the exit planning process. For example, the team at <\/span><a href=\"https:\/\/www.johnsonconsulting.com\/\"><span style=\"font-weight: 400;\">Johnson Consulting Group<\/span><\/a><span style=\"font-weight: 400;\"> has the skills to evaluate your business, manage its performance, and even prepare it for an eventual sale–regardless of how far in the future you plan to exit.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Planning Too Late<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">At some point, everyone exits their business, be it through retirement, inheritance, sale, or even death. Without an exit plan, the future of your company and the financial security of your family are thrown into jeopardy. Here are some of the risks that come with a lack of proper exit planning.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Not able to meet financial goals<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Even those who don’t own a business know it’s important to plan for their retirement; however, many business owners fail to account for how their business plays into these plans. For business owners who don’t account for the value of their business––and the fees and taxes that come with a sale––they risk failing to meet their own financial goals in retirement. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Not mentally prepared<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">For many funeral directors, their business becomes an inseparable part of their identity and self-worth. This is why it’s important to begin implementing an exit strategy several years before your retirement. This way, you’ll ideally be able to test the waters of leaving the business, gradually relinquishing responsibilities to the new ownership. Not only will this allow you to adjust to a new lifestyle, but it will also ensure the new owners can carry on the legacy.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Getting a poor valuation <\/span><\/h3>\n<p><span style=\"font-weight: 400;\">If you never make a plan to exit your business, then you risk obtaining a lower valuation. This is because buyers look for a business that has plans for succession and continuation of operations. By creating an exit plan, one that includes delegation of key responsibilities to teammates then you’ll ensure a buyer that they’ll be able to take over your business and run it properly. But that’s not where it ends. You should also be getting valuations of your funeral home annually so you can monitor any fluctuations and make changes where needed. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">No one to pass it to (in terms of family)<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">If you have a child or other family member who would like to take over the business, it’s easy to assume the process is simple as giving them the keys; however, the transfer of a business, even within a family, is more complicated. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">This is why only 30% of family businesses <\/span><a href=\"https:\/\/www.familybusinesscenter.com\/resources\/family-business-facts\/\"><span style=\"font-weight: 400;\">make it to a second generation<\/span><\/a><span style=\"font-weight: 400;\">. To properly pass down a business through your family, you’ll need to plan carefully, ensuring new owners are trained and equipped to run the business in its entirety.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Poor market<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">While many people plan their exit around a certain age, this method doesn’t consider market fluctuation. Ideally, you’ll sell your business when the market is strong, ensuring optimal returns; however, without a contingency plan in place, you risk selling your business when no one is buying, ultimately getting you less money than you could earn by selling at an appropriate time.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Rushed sale <\/span><\/h3>\n<p><span style=\"font-weight: 400;\">The key to proper exit planning is time. Even if you hire expert consultants to make your business exit-ready, the entire process could take years. This is why you’ll need to plan early, as a rushed sale can result in a poor valuation leading to the acceptance of lower offers<\/span><a href=\"https:\/\/www.johnsonconsulting.com\/selling-a-funeral-business\/\"><span style=\"font-weight: 400;\"> when selling your funeral business.<\/span><\/a><\/p>\n<h2><span style=\"font-weight: 400;\">Exit Strategies to Consider<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">When exiting your business, it’s important to remember that there is no universal approach. You’ll want to consider the different options as they relate to your finances, your timetable, and the future of your business apart from your involvement. Here are some of the common exit strategies for funeral homes:<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Selling to a New Owner<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">With this strategy, you’ll sell your business to another person who either acquires your business or merges it with their existing business. The biggest draw to this strategy is that you’ll be able to negotiate prices and likely walk away with the most money. Additionally, this strategy will likely involve little involvement on your part after the sale.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Potential downsides of this strategy include the time-consuming nature of selling a business and that your business will likely undergo an overhaul that hardly resembles the funeral home you’ve created.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Liquidating<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">This method involves shuttering your business and selling off each of its assets: your land, facilities, vehicles, and anything else owned by the business. In terms of exit strategies, this method is one of the most final and quick. Once you’ve closed and sold off the business, the process is complete.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The downside to this is that you likely won’t make nearly as much money as by selling the business as a whole. Additionally, ending your business will likely negatively impact all of your employees who will now need to find new jobs.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Passing Down to Family<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Many funeral directors want to pass their business down to a family member. For those with children or siblings already involved in the business, this can be a great way to ensure your continued legacy and to provide a loved one with a stable source of income. If desired, this strategy often allows you to stay involved through a consulting or advisory role.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The main issue to look out for when passing on your business is the undue stress it may cause on your family. Additionally, passing down a business to a child can cause resentment from other team members in some scenarios.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Management Buyout<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Even if you hadn’t identified a new owner among your staff, it’s possible that a group of your employees would want to purchase the business from you. This method can potentially allow for a smooth transition, as it will be run by people familiar with your business’s inner workings. Additionally, it can preserve your business’s legacy.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The main downside to this method is that it may be difficult to find an employee or manager who wants to take on this level of responsibility. Additionally, it might be difficult for a manager to assume the heightened responsibilities of a director.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Sell to Your Business Partner<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">If you’ve been running your business with a partner or investor, then a simple exit strategy could involve selling off your stake to them. This option allows for a smooth transition, quick sale, and the knowledge that your business will continue to function as usual.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Take Your Business Public <\/span><\/h3>\n<p><span style=\"font-weight: 400;\">For larger businesses, selling your business to the public can be a highly profitable option. While conditions need to be just right for this to work, there is no other option with the potential for substantial financial returns. The downside is that it’s very difficult for small and medium-sized businesses to succeed as an initial public offering (IPO).<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Knowing You’re on the Right Path<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Planning to exit your business starts by knowing what your ultimate goals are upon leaving. You’ll want to consider retirement plans, financial benchmarks, new ownership, and the future of your business once you’ve departed. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Considering all of these factors can quickly feel overwhelming. That’s why you should consider hiring a team of death care industry experts to help you create a holistic plan–like Johnson Consulting Group.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">JCG can help you navigate every stage of the process. Their funeral home experts are comprised of accountants, marketers, and brokers who can help assess your business’s current performance and value, suggest areas for improvement, and help you reach your professional and personal financial goals in a comprehensive exit strategy. <\/span><\/p>\n<a href='https:\/\/www.johnsonconsulting.com\/contact-us\/' class='small-button smallblue'>START PLANNING FOR TOMORROW<\/a>\n","protected":false},"excerpt":{"rendered":"<p>According to a study from the National Funeral Directors Association, nearly 75% of funeral directors have neither an exit strategy nor a succession plan. Among those who do have a plan, the majority of them have yet to put it in writing, meaning they’ve yet to begin the real work of exit planning.  Exiting your [&hellip;]<\/p>\n","protected":false},"author":19,"featured_media":6183,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","inline_featured_image":false,"footnotes":""},"categories":[4,46,42],"tags":[],"class_list":["post-6182","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-blog","category-business-tips","category-sell-my-business"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v21.0 (Yoast SEO v24.3) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Plan Your Exit Strategy - Johnson Consulting Group<\/title>\n<meta name=\"description\" content=\"Exiting your business should never be planned in haste; rather, it should be a strategy laid out well in advance. Learn why and how to do it.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.johnsonconsulting.com\/plan-your-exit-strategy\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Plan Your Exit Strategy\" \/>\n<meta property=\"og:description\" content=\"Exiting your business should never be planned in haste; rather, it should be a strategy laid out well in advance. Learn why and how to do it.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.johnsonconsulting.com\/plan-your-exit-strategy\/\" \/>\n<meta property=\"og:site_name\" content=\"Johnson Consulting Group\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/JohnsonConsulting\" \/>\n<meta property=\"article:published_time\" content=\"2021-10-21T20:37:59+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-10-28T17:22:24+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2021\/10\/1206596_JCG-Blog-Images-If-You-Haven-t-Planned_2_101121.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"560\" \/>\n\t<meta property=\"og:image:height\" content=\"316\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Marissa Morah\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@johnsonfuneral\" \/>\n<meta name=\"twitter:site\" content=\"@johnsonfuneral\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Marissa Morah\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/plan-your-exit-strategy\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/plan-your-exit-strategy\/\"},\"author\":{\"name\":\"Marissa Morah\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/f72c8184aa7d2275341131b1821305ea\"},\"headline\":\"Plan Your Exit Strategy\",\"datePublished\":\"2021-10-21T20:37:59+00:00\",\"dateModified\":\"2021-10-28T17:22:24+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/plan-your-exit-strategy\/\"},\"wordCount\":2045,\"publisher\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/plan-your-exit-strategy\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2021\/10\/1206596_JCG-Blog-Images-If-You-Haven-t-Planned_2_101121.jpg\",\"articleSection\":[\"Blog\",\"Business Tips\",\"Sell My Business\"],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/plan-your-exit-strategy\/\",\"url\":\"https:\/\/www.johnsonconsulting.com\/plan-your-exit-strategy\/\",\"name\":\"Plan Your Exit Strategy - Johnson Consulting Group\",\"isPartOf\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/plan-your-exit-strategy\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/plan-your-exit-strategy\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2021\/10\/1206596_JCG-Blog-Images-If-You-Haven-t-Planned_2_101121.jpg\",\"datePublished\":\"2021-10-21T20:37:59+00:00\",\"dateModified\":\"2021-10-28T17:22:24+00:00\",\"description\":\"Exiting your business should never be planned in haste; rather, it should be a strategy laid out well in advance. Learn why and how to do it.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/plan-your-exit-strategy\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.johnsonconsulting.com\/plan-your-exit-strategy\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/plan-your-exit-strategy\/#primaryimage\",\"url\":\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2021\/10\/1206596_JCG-Blog-Images-If-You-Haven-t-Planned_2_101121.jpg\",\"contentUrl\":\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2021\/10\/1206596_JCG-Blog-Images-If-You-Haven-t-Planned_2_101121.jpg\",\"width\":560,\"height\":316},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/plan-your-exit-strategy\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.johnsonconsulting.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Plan Your Exit Strategy\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#website\",\"url\":\"https:\/\/www.johnsonconsulting.com\/\",\"name\":\"Johnson Consulting Group\",\"description\":\"Funeral Home and Cemetery Consulting\",\"publisher\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.johnsonconsulting.com\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#organization\",\"name\":\"Johnson Consulting Group\",\"url\":\"https:\/\/www.johnsonconsulting.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png\",\"contentUrl\":\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png\",\"width\":576,\"height\":222,\"caption\":\"Johnson Consulting Group\"},\"image\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/JohnsonConsulting\",\"https:\/\/x.com\/johnsonfuneral\",\"https:\/\/www.linkedin.com\/company\/johnson-consulting-group\/\",\"https:\/\/www.youtube.com\/user\/JohnsonConsultingInc\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/f72c8184aa7d2275341131b1821305ea\",\"name\":\"Marissa Morah\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/836766a544b05a39c510e2c502784e7c?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/836766a544b05a39c510e2c502784e7c?s=96&d=mm&r=g\",\"caption\":\"Marissa Morah\"},\"url\":\"https:\/\/www.johnsonconsulting.com\/author\/mmorah\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Plan Your Exit Strategy - Johnson Consulting Group","description":"Exiting your business should never be planned in haste; rather, it should be a strategy laid out well in advance. Learn why and how to do it.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.johnsonconsulting.com\/plan-your-exit-strategy\/","og_locale":"en_US","og_type":"article","og_title":"Plan Your Exit Strategy","og_description":"Exiting your business should never be planned in haste; rather, it should be a strategy laid out well in advance. Learn why and how to do it.","og_url":"https:\/\/www.johnsonconsulting.com\/plan-your-exit-strategy\/","og_site_name":"Johnson Consulting Group","article_publisher":"https:\/\/www.facebook.com\/JohnsonConsulting","article_published_time":"2021-10-21T20:37:59+00:00","article_modified_time":"2021-10-28T17:22:24+00:00","og_image":[{"width":560,"height":316,"url":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2021\/10\/1206596_JCG-Blog-Images-If-You-Haven-t-Planned_2_101121.jpg","type":"image\/jpeg"}],"author":"Marissa Morah","twitter_card":"summary_large_image","twitter_creator":"@johnsonfuneral","twitter_site":"@johnsonfuneral","twitter_misc":{"Written by":"Marissa Morah","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.johnsonconsulting.com\/plan-your-exit-strategy\/#article","isPartOf":{"@id":"https:\/\/www.johnsonconsulting.com\/plan-your-exit-strategy\/"},"author":{"name":"Marissa Morah","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/f72c8184aa7d2275341131b1821305ea"},"headline":"Plan Your Exit Strategy","datePublished":"2021-10-21T20:37:59+00:00","dateModified":"2021-10-28T17:22:24+00:00","mainEntityOfPage":{"@id":"https:\/\/www.johnsonconsulting.com\/plan-your-exit-strategy\/"},"wordCount":2045,"publisher":{"@id":"https:\/\/www.johnsonconsulting.com\/#organization"},"image":{"@id":"https:\/\/www.johnsonconsulting.com\/plan-your-exit-strategy\/#primaryimage"},"thumbnailUrl":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2021\/10\/1206596_JCG-Blog-Images-If-You-Haven-t-Planned_2_101121.jpg","articleSection":["Blog","Business Tips","Sell My Business"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/www.johnsonconsulting.com\/plan-your-exit-strategy\/","url":"https:\/\/www.johnsonconsulting.com\/plan-your-exit-strategy\/","name":"Plan Your Exit Strategy - Johnson Consulting Group","isPartOf":{"@id":"https:\/\/www.johnsonconsulting.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.johnsonconsulting.com\/plan-your-exit-strategy\/#primaryimage"},"image":{"@id":"https:\/\/www.johnsonconsulting.com\/plan-your-exit-strategy\/#primaryimage"},"thumbnailUrl":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2021\/10\/1206596_JCG-Blog-Images-If-You-Haven-t-Planned_2_101121.jpg","datePublished":"2021-10-21T20:37:59+00:00","dateModified":"2021-10-28T17:22:24+00:00","description":"Exiting your business should never be planned in haste; rather, it should be a strategy laid out well in advance. Learn why and how to do it.","breadcrumb":{"@id":"https:\/\/www.johnsonconsulting.com\/plan-your-exit-strategy\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.johnsonconsulting.com\/plan-your-exit-strategy\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.johnsonconsulting.com\/plan-your-exit-strategy\/#primaryimage","url":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2021\/10\/1206596_JCG-Blog-Images-If-You-Haven-t-Planned_2_101121.jpg","contentUrl":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2021\/10\/1206596_JCG-Blog-Images-If-You-Haven-t-Planned_2_101121.jpg","width":560,"height":316},{"@type":"BreadcrumbList","@id":"https:\/\/www.johnsonconsulting.com\/plan-your-exit-strategy\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.johnsonconsulting.com\/"},{"@type":"ListItem","position":2,"name":"Plan Your Exit Strategy"}]},{"@type":"WebSite","@id":"https:\/\/www.johnsonconsulting.com\/#website","url":"https:\/\/www.johnsonconsulting.com\/","name":"Johnson Consulting Group","description":"Funeral Home and Cemetery Consulting","publisher":{"@id":"https:\/\/www.johnsonconsulting.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.johnsonconsulting.com\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.johnsonconsulting.com\/#organization","name":"Johnson Consulting Group","url":"https:\/\/www.johnsonconsulting.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/","url":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png","contentUrl":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png","width":576,"height":222,"caption":"Johnson Consulting Group"},"image":{"@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/JohnsonConsulting","https:\/\/x.com\/johnsonfuneral","https:\/\/www.linkedin.com\/company\/johnson-consulting-group\/","https:\/\/www.youtube.com\/user\/JohnsonConsultingInc"]},{"@type":"Person","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/f72c8184aa7d2275341131b1821305ea","name":"Marissa Morah","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/836766a544b05a39c510e2c502784e7c?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/836766a544b05a39c510e2c502784e7c?s=96&d=mm&r=g","caption":"Marissa Morah"},"url":"https:\/\/www.johnsonconsulting.com\/author\/mmorah\/"}]}},"_links":{"self":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/posts\/6182","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/users\/19"}],"replies":[{"embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/comments?post=6182"}],"version-history":[{"count":0,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/posts\/6182\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/media\/6183"}],"wp:attachment":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/media?parent=6182"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/categories?post=6182"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/tags?post=6182"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}