{"id":6203,"date":"2021-11-05T15:01:11","date_gmt":"2021-11-05T22:01:11","guid":{"rendered":"https:\/\/www.johnsonconsulting.com\/?p=6203"},"modified":"2021-11-05T15:01:20","modified_gmt":"2021-11-05T22:01:20","slug":"time-wasters-when-selling-your-funeral-home","status":"publish","type":"post","link":"https:\/\/www.johnsonconsulting.com\/time-wasters-when-selling-your-funeral-home\/","title":{"rendered":"Avoid These Critical Time Wasters When Selling Your Funeral Home"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">When attempting to <\/span><a href=\"https:\/\/www.johnsonconsulting.com\/selling-a-funeral-business\/\"><span style=\"font-weight: 400;\">sell your funeral business<\/span><\/a><span style=\"font-weight: 400;\">, time is rarely on your side. Not only do you have to contend with finding the right buyer, but you also must continue your day-to-day tasks as a funeral director. Moreover, it takes the perfect circumstances to pull off a sale. The market must be ideal, your valuations should be at their peak, and your facilities must be ready for transfer. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Even still, obstacles abound. Along your journey of selling your funeral home, you’ll have to confront unqualified buyers, accounting issues, and less-than-ideal valuations. Here’s how to prepare for and work around these critical time-wasters. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">1. Unqualified Buyers<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">A major challenge of selling your business will be finding someone with both the interest and the money to buy it. Believe it or not, there are many people who make a hobby of investigating different industries––even going through the process of signing an NDA––only to move onto something else with little notice. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Unqualified buyers not only waste your time, but they can even compromise your future selling efforts through the violation of non-disclosure agreements. Even worse, you might find a con artist who aims to convince you to lease your business or sell it with no money down. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Even if you escape the clutches of a phony buyer you’ll still end up wasting a lot of time. Because of this, you’ll want to be sure that you only explore negotiations with serious buyers with the proper financial qualifications. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Spotting an Unqualified Buyer<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Never forget that when negotiating the sale of a business, it’s standard practice for both parties to exchange financial information and resumes. If a buyer refuses to do so, then this is an immediate red flag. Failure to abide by these sorts of norms may indicate that a buyer either doesn’t have the money or doesn’t plan on playing by the rules––or both!<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Similarly, you should be wary of a person who brushes off requests for financial records or insists––only verbally––that they have the money. Unless you recognize the person in front of you as Elon Musk (or another public tycoon) then you have no way of knowing that they have the finances to justify continued negotiations. Only trust what can be documented.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Safeguard Yourself<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Ideally, you’ll find several buyers who are interested in your funeral business. To help you narrow down your options, ask yourself the following questions: <\/span><b><\/b><\/p>\n<ul>\n<li aria-level=\"1\"><b>Is the buyer specifically interested in the death care profession? <\/b><span style=\"font-weight: 400;\">A good indicator of this is ownership or work experience in other funeral homes or crematoriums.<\/span><\/li>\n<\/ul>\n<ul>\n<li aria-level=\"1\"><b>Does the buyer have relevant education and certifications related to owning a funeral home? <\/b><span style=\"font-weight: 400;\">Licenses related to death care and related practices will vary by state, but the current possession of your state’s funeral director certifications likely indicates a more serious buyer.<\/span><\/li>\n<\/ul>\n<ul>\n<li aria-level=\"1\"><b>Is the buyer willing to work with your time frame? <\/b><span style=\"font-weight: 400;\">Pay close attention to buyers who seem interested in future purchases, as you’ll want to weed them out. <\/span><\/li>\n<li aria-level=\"1\"><b>Will the buyer qualify for an SBA loan or a third-party loan? <\/b><span style=\"font-weight: 400;\">Again, unless you’re dealing with Elon Musk, a buyer most likely won’t be buying your funeral business in cash. You’ll want to make sure they’ve got a lender lined up for the eventual purchase.<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">If a buyer hasn’t provided answers to these questions, then you should consider asking for relevant documentation that will give you the answers you need.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Qualities to Look For<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">In addition to red flags in buyers, there are some qualities that indicate a serious and qualified buyer for a funeral home. <\/span><\/p>\n<ol>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>They have a history of business ownership<\/b><span style=\"font-weight: 400;\">&#8211; Odds are, if a person has owned a business, then they know what it takes to run one. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>They owned a funeral business or cemetery<\/b><span style=\"font-weight: 400;\">&#8211; A currently licensed mortician is more likely to be a serious buyer than someone who runs a beauty salon. Additionally, funeral experience bodes well for their success as a funeral home owner and can give you a glimpse at what changes they might make to your business. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><b>They have access to funds<\/b><span style=\"font-weight: 400;\">&#8211; A serious buyer will have access to the capital required for the down payment and continued financing of your business. <\/span><\/li>\n<\/ol>\n<p><span style=\"font-weight: 400;\">While it’s not unheard of for people in unrelated fields to want to purchase a funeral home, all of the passion and experience cannot make up for insufficient funds. This is why you should always obtain financial statements in your initial screening process. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">2. Unclear Accounting<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Before your business goes on the market, you’ll want to have your finances in order. Ideally, you’ll have three years of financial documents at the ready. Failure to do so is a surefire way to scare off potential buyers and waste the time of everyone involved. Without clear and accurate accounting information, buyers won’t know what they are getting into. The only people who’d consider such a purchase would be unqualified buyers.  <\/span><\/p>\n<p><span style=\"font-weight: 400;\">To prepare your finances, you need to know what buyers will want. Generally, they will ask for:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Three to five years of profit and loss (P&amp;L) statements<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Balance sheets<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Bank statements<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Federal income tax returns<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Year-to-date comparison P&amp;L statements<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">Getting these records will help you determine a fair asking price, and––if you’re unable to procure these documents––it will help you figure out how to plan for a future sale. For example, many funeral businesses have a degree of cash sales. While this might not seem like an issue at the time, cash sales are more difficult to document, making it essential to start logging information as soon as possible.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">In terms of planning ahead, it is also worth considering finding a funeral broker. Even when done years ahead of your planned sale, a funeral business broker can help you figure out what buyers are looking for and how you can start making your business more attractive to them. A business broker can also help you with yearly valuations, providing you with a rough idea of numbers before the time for sale arrives. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">What Buyers Want to See<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">When a buyer reviews your financial statements, they’ll be looking for signs that your business <\/span><a href=\"https:\/\/www.johnsonconsulting.com\/make-your-funeral-business-more-profitable\/\"><span style=\"font-weight: 400;\">will be a sound investment<\/span><\/a><span style=\"font-weight: 400;\">. In particular, there are some red flags that will turn them off from pulling the trigger. Pay close attention to the following:<\/span><b><\/b><\/p>\n<ul>\n<li aria-level=\"1\"><b>Declining revenue<\/b><span style=\"font-weight: 400;\">&#8211;<\/span> <span style=\"font-weight: 400;\">If the revenue of your funeral home is on the decline, then a buyer will have to put in more work to turn things around. <\/span><\/li>\n<\/ul>\n<ul>\n<li aria-level=\"1\"><b>Debt-to-equity ratio<\/b><span style=\"font-weight: 400;\">&#8211;<\/span> <span style=\"font-weight: 400;\">An increasing debt-to-equity ratio––or one higher than 100%––indicates that your business is taking on more debt than it can pay off. <\/span><\/li>\n<\/ul>\n<ul>\n<li aria-level=\"1\"><b>Uncategorized expenses<\/b><span style=\"font-weight: 400;\">&#8211;<\/span> <span style=\"font-weight: 400;\">It’s inevitable that some business expenses in a funeral home will be classified as <\/span><i><span style=\"font-weight: 400;\">other<\/span><\/i><span style=\"font-weight: 400;\">. However, you’ll want to keep these types of expenditures to a minimum. If a large chunk of your expenses goes towards something you can’t identify, then this will raise concerns in any buyer.<\/span><\/li>\n<\/ul>\n<ul>\n<li aria-level=\"1\"><b>Inconsistent cash flow<\/b><span style=\"font-weight: 400;\">&#8211;<\/span> <span style=\"font-weight: 400;\">Regular and consistent cash flow is the mark of any healthy business that’s worth purchasing–without it, you’ll appear unstable. <\/span><\/li>\n<\/ul>\n<h3><span style=\"font-weight: 400;\">What NOT to Provide<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">The goal of providing accounting documents is to be transparent, all the while refraining from causing confusion by providing too much information. For example, you’ll want to avoid providing raw financials. Simply providing numbers without context is a surefire way to present an inaccurate picture.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">To avoid this, reconstruct financial documents in a way that accurately reflects the profits of your business. For example, if there are any personal expenses like travel that you write off as businesses, then you’ll want to be sure your statements account for this. This is what’s known as providing normalized numbers to a potential buyer.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Additionally, you’ll want to hold off on providing YTD financial statements until further along in negotiations. Otherwise, you’ll have to constantly adjust your financial statement each time you update your accounting data. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">3. Underestimating\/Overestimating Your Value<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Underestimating your business’s value can lead to the loss of hundreds of thousands of dollars while overestimating its value will lead to unqualified buyers and your business sitting on the market for months. Because of this, it’s important to make sure that you’re selling your business for a fair and accurate price. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Conduct a Business Valuation<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">The most surefire way to know what your business is worth is to conduct a formal valuation. For funeral homes, this process usually includes an analysis of the company’s management, its capital structure, its potential for future earnings, and the value of its assets such as land, real estate, and equipment. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">While there are several different methods one can use to put a value on a business, you’ll want to seek the counsel of a reliable accountant or broker, preferably one that has experience in the funeral profession. They will have a better understanding of what interests buyers and how to best position your financials. For example, the times-revenue business valuation method involves multiplying your revenue by an industry-specific multiplier; however, a buyer is less likely to trust this number when it comes from you, the owner. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Work with Your Accountant<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">When selling your business, you are in constant contact with your accountant and the valuation process is no different. For your CPA to obtain a realistic and fair valuation, they’ll need detailed financial records from the past three years. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Consult with a Broker<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Another key player in the valuation will be your broker. In particular, you’ll want to find a broker who specializes in the funeral business. This way, they’ll not only know what a fair price looks like, but they’ll also be able to match you with a qualified buyer, saving you a lot of time in the long run. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Additionally consulting with a funeral home broker will provide you with insight into the current state of the market. If now is not the optimal time to sell your funeral home, they’ll be able to advise you when the tide changes and provide advice on how to prepare in the interim.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">4. Going It On Your Own<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Selling a business is neither a quick nor easy process. Amid all your efforts to get your business sold, you still have to manage daily operations. This is why it’s important to seek out the help of professionals. They will not only aid you in getting an accurate valuation but also help you navigate the process of selling. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">With over $2 billion in closed transactions, <\/span><a href=\"https:\/\/www.johnsonconsulting.com\/\"><span style=\"font-weight: 400;\">Johnson Consulting Group<\/span><\/a><span style=\"font-weight: 400;\"> can help you handle the transfer of businesses, whether large or small. Not only do they conduct an independent evaluation of your funeral home, but can also help prepare your financial documents, and improve your operations making your business more appealing to buyers. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Inevitably, there will come a day when you exit your business, and it’s imperative to plan for it. As a funeral director, you’ve got a lot to focus on with the current operations of your business, and seeking the help of professionals at Johnson Consulting Group can help you expedite the process. From funeral home brokers to accounting and financial management to consulting services, their expertise in the funeral profession can help set your funeral home up for a profitable sale. <\/span><\/p>\n<a href='https:\/\/www.johnsonconsulting.com\/contact-us\/' class='small-button smallblue'>MAKE A PROFIT<\/a>\n","protected":false},"excerpt":{"rendered":"<p>When attempting to sell your funeral business, time is rarely on your side. Not only do you have to contend with finding the right buyer, but you also must continue your day-to-day tasks as a funeral director. Moreover, it takes the perfect circumstances to pull off a sale. The market must be ideal, your valuations [&hellip;]<\/p>\n","protected":false},"author":19,"featured_media":6204,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","inline_featured_image":false,"footnotes":""},"categories":[4,42],"tags":[],"class_list":["post-6203","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-blog","category-sell-my-business"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v21.0 (Yoast SEO v24.3) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Avoid These Critical Time Wasters When Selling Your Funeral Home - Johnson Consulting Group<\/title>\n<meta name=\"description\" content=\"Here’s how to prepare for and work around critical time-wasters when selling your funeral home.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.johnsonconsulting.com\/time-wasters-when-selling-your-funeral-home\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Avoid These Critical Time Wasters When Selling Your Funeral Home\" \/>\n<meta property=\"og:description\" content=\"Here’s how to prepare for and work around critical time-wasters when selling your funeral home.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.johnsonconsulting.com\/time-wasters-when-selling-your-funeral-home\/\" \/>\n<meta property=\"og:site_name\" content=\"Johnson Consulting Group\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/JohnsonConsulting\" \/>\n<meta property=\"article:published_time\" content=\"2021-11-05T22:01:11+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-11-05T22:01:20+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2021\/11\/1212613_JCG-BlogImage-AvoidCriticalTimeWastersSellingFuneralHome1_101921.png\" \/>\n\t<meta property=\"og:image:width\" content=\"800\" \/>\n\t<meta property=\"og:image:height\" content=\"450\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Marissa Morah\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@johnsonfuneral\" \/>\n<meta name=\"twitter:site\" content=\"@johnsonfuneral\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Marissa Morah\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/time-wasters-when-selling-your-funeral-home\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/time-wasters-when-selling-your-funeral-home\/\"},\"author\":{\"name\":\"Marissa Morah\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/f72c8184aa7d2275341131b1821305ea\"},\"headline\":\"Avoid These Critical Time Wasters When Selling Your Funeral Home\",\"datePublished\":\"2021-11-05T22:01:11+00:00\",\"dateModified\":\"2021-11-05T22:01:20+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/time-wasters-when-selling-your-funeral-home\/\"},\"wordCount\":1933,\"publisher\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/time-wasters-when-selling-your-funeral-home\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2021\/11\/1212613_JCG-BlogImage-AvoidCriticalTimeWastersSellingFuneralHome1_101921.png\",\"articleSection\":[\"Blog\",\"Sell My Business\"],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/time-wasters-when-selling-your-funeral-home\/\",\"url\":\"https:\/\/www.johnsonconsulting.com\/time-wasters-when-selling-your-funeral-home\/\",\"name\":\"Avoid These Critical Time Wasters When Selling Your Funeral Home - Johnson Consulting Group\",\"isPartOf\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/time-wasters-when-selling-your-funeral-home\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/time-wasters-when-selling-your-funeral-home\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2021\/11\/1212613_JCG-BlogImage-AvoidCriticalTimeWastersSellingFuneralHome1_101921.png\",\"datePublished\":\"2021-11-05T22:01:11+00:00\",\"dateModified\":\"2021-11-05T22:01:20+00:00\",\"description\":\"Here’s how to prepare for and work around critical time-wasters when selling your funeral home.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/time-wasters-when-selling-your-funeral-home\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.johnsonconsulting.com\/time-wasters-when-selling-your-funeral-home\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/time-wasters-when-selling-your-funeral-home\/#primaryimage\",\"url\":\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2021\/11\/1212613_JCG-BlogImage-AvoidCriticalTimeWastersSellingFuneralHome1_101921.png\",\"contentUrl\":\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2021\/11\/1212613_JCG-BlogImage-AvoidCriticalTimeWastersSellingFuneralHome1_101921.png\",\"width\":800,\"height\":450},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/time-wasters-when-selling-your-funeral-home\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.johnsonconsulting.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Avoid These Critical Time Wasters When Selling Your Funeral Home\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#website\",\"url\":\"https:\/\/www.johnsonconsulting.com\/\",\"name\":\"Johnson Consulting Group\",\"description\":\"Funeral Home and Cemetery Consulting\",\"publisher\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.johnsonconsulting.com\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#organization\",\"name\":\"Johnson Consulting Group\",\"url\":\"https:\/\/www.johnsonconsulting.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png\",\"contentUrl\":\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png\",\"width\":576,\"height\":222,\"caption\":\"Johnson Consulting Group\"},\"image\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/JohnsonConsulting\",\"https:\/\/x.com\/johnsonfuneral\",\"https:\/\/www.linkedin.com\/company\/johnson-consulting-group\/\",\"https:\/\/www.youtube.com\/user\/JohnsonConsultingInc\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/f72c8184aa7d2275341131b1821305ea\",\"name\":\"Marissa Morah\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/836766a544b05a39c510e2c502784e7c?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/836766a544b05a39c510e2c502784e7c?s=96&d=mm&r=g\",\"caption\":\"Marissa Morah\"},\"url\":\"https:\/\/www.johnsonconsulting.com\/author\/mmorah\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Avoid These Critical Time Wasters When Selling Your Funeral Home - Johnson Consulting Group","description":"Here’s how to prepare for and work around critical time-wasters when selling your funeral home.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.johnsonconsulting.com\/time-wasters-when-selling-your-funeral-home\/","og_locale":"en_US","og_type":"article","og_title":"Avoid These Critical Time Wasters When Selling Your Funeral Home","og_description":"Here’s how to prepare for and work around critical time-wasters when selling your funeral home.","og_url":"https:\/\/www.johnsonconsulting.com\/time-wasters-when-selling-your-funeral-home\/","og_site_name":"Johnson Consulting Group","article_publisher":"https:\/\/www.facebook.com\/JohnsonConsulting","article_published_time":"2021-11-05T22:01:11+00:00","article_modified_time":"2021-11-05T22:01:20+00:00","og_image":[{"width":800,"height":450,"url":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2021\/11\/1212613_JCG-BlogImage-AvoidCriticalTimeWastersSellingFuneralHome1_101921.png","type":"image\/png"}],"author":"Marissa Morah","twitter_card":"summary_large_image","twitter_creator":"@johnsonfuneral","twitter_site":"@johnsonfuneral","twitter_misc":{"Written by":"Marissa Morah","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.johnsonconsulting.com\/time-wasters-when-selling-your-funeral-home\/#article","isPartOf":{"@id":"https:\/\/www.johnsonconsulting.com\/time-wasters-when-selling-your-funeral-home\/"},"author":{"name":"Marissa Morah","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/f72c8184aa7d2275341131b1821305ea"},"headline":"Avoid These Critical Time Wasters When Selling Your Funeral Home","datePublished":"2021-11-05T22:01:11+00:00","dateModified":"2021-11-05T22:01:20+00:00","mainEntityOfPage":{"@id":"https:\/\/www.johnsonconsulting.com\/time-wasters-when-selling-your-funeral-home\/"},"wordCount":1933,"publisher":{"@id":"https:\/\/www.johnsonconsulting.com\/#organization"},"image":{"@id":"https:\/\/www.johnsonconsulting.com\/time-wasters-when-selling-your-funeral-home\/#primaryimage"},"thumbnailUrl":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2021\/11\/1212613_JCG-BlogImage-AvoidCriticalTimeWastersSellingFuneralHome1_101921.png","articleSection":["Blog","Sell My Business"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/www.johnsonconsulting.com\/time-wasters-when-selling-your-funeral-home\/","url":"https:\/\/www.johnsonconsulting.com\/time-wasters-when-selling-your-funeral-home\/","name":"Avoid These Critical Time Wasters When Selling Your Funeral Home - Johnson Consulting Group","isPartOf":{"@id":"https:\/\/www.johnsonconsulting.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.johnsonconsulting.com\/time-wasters-when-selling-your-funeral-home\/#primaryimage"},"image":{"@id":"https:\/\/www.johnsonconsulting.com\/time-wasters-when-selling-your-funeral-home\/#primaryimage"},"thumbnailUrl":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2021\/11\/1212613_JCG-BlogImage-AvoidCriticalTimeWastersSellingFuneralHome1_101921.png","datePublished":"2021-11-05T22:01:11+00:00","dateModified":"2021-11-05T22:01:20+00:00","description":"Here’s how to prepare for and work around critical time-wasters when selling your funeral home.","breadcrumb":{"@id":"https:\/\/www.johnsonconsulting.com\/time-wasters-when-selling-your-funeral-home\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.johnsonconsulting.com\/time-wasters-when-selling-your-funeral-home\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.johnsonconsulting.com\/time-wasters-when-selling-your-funeral-home\/#primaryimage","url":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2021\/11\/1212613_JCG-BlogImage-AvoidCriticalTimeWastersSellingFuneralHome1_101921.png","contentUrl":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2021\/11\/1212613_JCG-BlogImage-AvoidCriticalTimeWastersSellingFuneralHome1_101921.png","width":800,"height":450},{"@type":"BreadcrumbList","@id":"https:\/\/www.johnsonconsulting.com\/time-wasters-when-selling-your-funeral-home\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.johnsonconsulting.com\/"},{"@type":"ListItem","position":2,"name":"Avoid These Critical Time Wasters When Selling Your Funeral Home"}]},{"@type":"WebSite","@id":"https:\/\/www.johnsonconsulting.com\/#website","url":"https:\/\/www.johnsonconsulting.com\/","name":"Johnson Consulting Group","description":"Funeral Home and Cemetery Consulting","publisher":{"@id":"https:\/\/www.johnsonconsulting.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.johnsonconsulting.com\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.johnsonconsulting.com\/#organization","name":"Johnson Consulting Group","url":"https:\/\/www.johnsonconsulting.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/","url":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png","contentUrl":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png","width":576,"height":222,"caption":"Johnson Consulting Group"},"image":{"@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/JohnsonConsulting","https:\/\/x.com\/johnsonfuneral","https:\/\/www.linkedin.com\/company\/johnson-consulting-group\/","https:\/\/www.youtube.com\/user\/JohnsonConsultingInc"]},{"@type":"Person","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/f72c8184aa7d2275341131b1821305ea","name":"Marissa Morah","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/836766a544b05a39c510e2c502784e7c?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/836766a544b05a39c510e2c502784e7c?s=96&d=mm&r=g","caption":"Marissa Morah"},"url":"https:\/\/www.johnsonconsulting.com\/author\/mmorah\/"}]}},"_links":{"self":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/posts\/6203","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/users\/19"}],"replies":[{"embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/comments?post=6203"}],"version-history":[{"count":0,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/posts\/6203\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/media\/6204"}],"wp:attachment":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/media?parent=6203"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/categories?post=6203"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/tags?post=6203"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}