{"id":632,"date":"2009-10-16T14:51:20","date_gmt":"2009-10-16T19:51:20","guid":{"rendered":"http:\/\/johnsoncg.wpengine.com\/?p=632"},"modified":"2021-09-07T00:54:18","modified_gmt":"2021-09-07T07:54:18","slug":"lets-talk-about-management-services-by-dale-espich","status":"publish","type":"post","link":"https:\/\/www.johnsonconsulting.com\/lets-talk-about-management-services-by-dale-espich\/","title":{"rendered":"Lets Talk About Management Services &#8211; by Dale Espich"},"content":{"rendered":"<p>A definition would be a good place to start. For the purpose of this discussion let us define &#8220;Management&#8221; as &#8220;The Administration of Success in Business&#8221;. <!--more-->And, of course, this applies to the successful Management of a Funeral Business.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" title=\"Dale Espich\" src=\"\/wp-content\/uploads\/2011\/02\/dale-espich1.jpg\" alt=\"Dale Espich\" width=\"164\" height=\"194\" align=\"right\" \/>It may seem a little picky, but I also want to make sure the reader understands that the sole scope of this discussion is in the area of <strong>managing the financial sector of your funeral business for a good profit in a consistent way year in and year out.<\/strong><\/p>\n<p>Let us further clarify. There are, of course, multiple areas of Management including People\/Staff, Time, Public Relations, Service, Client Family Satisfaction, Recruitment, Training, Continuing Education and others that are a very integral part of a successful funeral business. Each of those individual areas is all-important, and a funeral business that ignores any of them will never reach its true potential. However, I have observed several hundred funeral homes be successful otherwise, <strong>but most will fall very short ever reaching the profit levels of which their business both deserves and of which it is capable.<\/strong><\/p>\n<p>In my career of over 40 happy years serving the funeral profession, I have performed Business Valuations for over 250 funeral firms. There are many elements that will determine the value of a funeral home, but almost nothing will trump a good profit history. It is very simple. If I buy a funeral business and finance the transaction, both the amount I am willing to pay, and the amount I can finance will be determined by the ability of the business to handle debt service with a comfortable ratio. If I pay cash, then it is a matter of what kind of a return on my investment (ROI, remember?) upon which I am able to count based upon the history of the business.<\/p>\n<p>So, among other things there are two very important messages for the reader. The first message is that when your business is adequately profitable, in at least 90% of the time, your staff will be a lot happier because of what you can pay them in salary and benefits, and your client families will be better satisfied because of the great service your happy staff will provide. Greater profits can also give you (not necessarily guaranteed) a better Quality of Life.<\/p>\n<p>The second message is that when you are ready to hang up your trocar and pass the business on to a family member, third party, or competitor, etc. your business will be of a much higher value with good profits than if you slug along at the current level, according to what we see published, to which profits have dropped&#8212;more than 50% in the last 20-30 years.<\/p>\n<p>Managing your funeral business for a profit, while not rocket science, does have several pitfalls. If this were not true, funeral profits would be significantly higher than they are. Each June, since 1983, the amount of profits of funeral service for the previous year has been announced in a leading funeral publication. For the purpose of clarification, 1983 was the last year National Funeral Directors Association commissioned Vanderlyn Pine to survey NFDA&#8217;s members for financial information on income, costs and profits.<\/p>\n<p>Since 1983 the source of knowledge about funeral profits has been from a national accounting firm that specializes in consulting and accounting for funeral directors. According to these sources <strong>funeral margins that were 14% in 1980 have fallen to 6% in 2008.<\/strong><\/p>\n<p>The Management Profit this article will discuss is about achieving margins of a <strong>minimum<\/strong> of ten percent, with close to 15% a desirable target. It may seem to be a statement of the obvious, <strong>but profit is achieved when income is at a level well above the total of cost of goods and operating expenses.<\/strong><\/p>\n<p>I know exactly what is on most funeral director&#8217;s mind as this is being read. How in the world can I make a consistent profit year in and year out when the number of families I serve varies with the ups and downs of the death rate in my market area? My 300 call funeral business may go from 275 in a down year and 325 in an &#8220;up&#8221; year. This may appear to be a valid point, but there is a very good answer.<\/p>\n<p>No one can predict how many families your 300 call business will serve in any given year. What we DO know, however, is that you will serve 1500 families over five years. There is only one element you cannot control in any given year, but if you <strong>completely understand how your business truly operates<\/strong>, you <strong>CAN control every single element of your profitability except volume<\/strong>. The key to consistent profitability is to <strong>know<\/strong>, <strong>understand<\/strong> and <strong>identify<\/strong> every single Profit Center in your funeral business.<\/p>\n<p>(<strong>See Sidebar &#8220;A&#8221;<\/strong> for five year average case volume recovery schematic-in which we use a 400 call firm with a 62% ration of adult casket, service and vault)<\/p>\n<p style=\"text-align: center;\"><img loading=\"lazy\" decoding=\"async\" class=\"alignright\" style=\"border: 2px solid black;\" src=\"\/wp-content\/uploads\/2021\/09\/Sidebar-A.jpg\" alt=\"Sidebar A\" width=\"550\" height=\"677\" align=\"right\" \/><\/p>\n<p>The crux of the above statement is &#8220;completely understand and identify&#8221;. In order for this to happen, you must be able to treat your funeral business exactly the way a physician treats a patient. In med school, each medical student dissects a human body. By the time med school is completed, the future doctor knows every muscle, tendon, ligament and organ. Now he understands the way the body functions, as opposed to just seeing the body from the exterior.<\/p>\n<p>It is the same thing with an auto or airplane mechanic. The mechanic must be able to take an engine completely apart with all the components, and then put it back together again. Otherwise, the only thing he would know about the engine is what he sees on the outside.<\/p>\n<p>Have you done the same with your funeral business? <strong>What<\/strong> do you work with when you put your business plan-or budget together for the coming year? <strong>What<\/strong> do you use? <strong>When<\/strong> do you do it? If you are using what comes from your accountant-whether in-house or externally-then you are only looking at the bare surface of your business.<\/p>\n<p>OK, Dale, what in the world are you talking about? The answer is not that I am saying your accountant is giving you bad information. What I am saying is that you are getting <strong>FINANCIAL<\/strong> INFORMATION from your accountant. What you need is <strong>MANAGEMENT<\/strong> INFORMATION.<\/p>\n<p>Slow down and think about it. The FINANCIAL information from your accountant gives you data in the form of hundreds of thousands or millions of dollars of income and expense. That is NOT how your business comes through your door.<\/p>\n<p>Your Funeral Business comes to you <strong>ONE FUNERAL AT A TIME!<\/strong><\/p>\n<p>(<strong>See Sidebar &#8220;B&#8221;<\/strong> for a &#8220;simple&#8221; diagram of funeral pricing. Refer to explanation that accompanies this schematic.)<\/p>\n<p style=\"text-align: center;\"><img loading=\"lazy\" decoding=\"async\" class=\"alignright\" style=\"border: 2px solid black;\" src=\"\/wp-content\/uploads\/2021\/09\/Sidebar-B.jpg\" alt=\"Sidebar B\" width=\"550\" height=\"272\" align=\"right\" \/><\/p>\n<p>If you are going to be able to control the elements of your business for next year, you must have complete knowledge and understanding of each single component of your business on a <strong>PER-FUNERAL BASIS<\/strong>. In order to accomplish that, it requires much, much more than what comes from an accounting set of data-That is, unless, you are dealing with an accountant that understands all the income and cost components of your business on a PER-FUNERAL BASIS.<\/p>\n<p>I want to make sure what I am about to state is not misunderstood. This is <strong>not<\/strong> to demean accountants or good accounting. Some of my best friends are CPA&#8217;s. However, in 40 years of successful management consulting in funeral service, I can count on one hand the number of accountants that fully understand what the bowels of a funeral business actually look like down in the belly of the beast.<\/p>\n<p>If you doubt this, just ask your accountant to calculate, in a form which you can use for profitable pricing, how much it costs to conduct a funeral in your business (this is what you may have referred to as &#8220;Overhead&#8221;). Along with that, one of you must know how much your service charge recovers on an adult casketed service, as well as how much on a graveside service, how much on cremations with full services, and on and on.<\/p>\n<p>The same is true with the way you price caskets, vaults, urns, etc. You have up to a dozen profit centers in your funeral business, and you must know how much you can expect from each, and then monitor each on a monthly basis to understand what each is doing to contribute to your profits&#8212;or to rob you of what the profit should be from each.<\/p>\n<p>Does this sound silly? The object of putting together a budget or business plan-call it what you will-is to set a <strong>specific profit target with every single component of pricing<\/strong> based upon your firm achieving its average number of calls, with the mix of caskets, cremations, vaults, etc. which you have calculated by a very careful detailed study of your past five years history. You need to accurately calculate what your casket margins will be as a combination of a specific mark-up on a clearly identified wholesale casket cost. Still sound silly?<\/p>\n<p>This is the way I have been preparing client business plans since the 1970&#8217;s, with client profits remaining around 13-15%. This process takes the combination of accurate accounting information along with management information in the form of a complete breakdown of each funeral with service charge, casket and vault retail, casket and vault wholesale, other revenue such as extra transportation, clothing, urns, cash advance and sales tax.<\/p>\n<p>This system&#8212;yes, it is a real bone fide SYSTEM-that literally takes your business apart, service by service, part by part, analyzes exactly how all these components come together in conjunction with accounting information, and then put the PLAN together, <strong>ready to go<\/strong>, on the <strong>First Day of the Up-coming Business Year.<\/strong><\/p>\n<p>You start this in October, calculating payroll and every single operating expense on a line-by-line basis. <strong>And, of course, you MUST know what your costs are on a PER-FUNERAL BASIS. Remember that unless you can accurately identify your costs, how in the world can you accurately set your revenue components?<\/strong><\/p>\n<p>Let&#8217;s stop and analyze exactly what we are discussing. You must know your cost of operation BY THE FUNERAL. If you do not know <strong>your cost of providing service<\/strong>, then your entire pricing structure is done with only <strong>cost of casket and vault invoice.<\/strong><\/p>\n<p><strong>We still are in the SERVICE BUSINESS<\/strong>, are we not? If you do not understand how much your service cost is, then you are still pricing the way funeral directors did 30-40 years ago.<\/p>\n<p>This discussion is not a &#8220;How-To&#8221; exercise. It takes a seven hour work-shop to address all the variables of the process, but you start by dissecting your business with an analysis of your entire business funeral by funeral. Go back at least five years. Not only do you count the number of services for each year, but, on a line-by-line basis, you list each service charge, each casket and vault retail, and the wholesale-invoice face value (not including discounts), other revenues such as extra transportation, clothing, flowers (sold), cash advances, sales tax. You can put these into an excel spreadsheet. What you will end up with will be the calculation of the number each year of casketed services full funeral, casketed service with partial, cremations with service, those that are direct and some in between. (very different revenue levels)<\/p>\n<p>What information are you looking for? Every little smidgen that helps you identify how your business profile is likely to develop for next year. Example: Your service charge total for a full funeral on your GPL is $4,400. It may be that amount when it is totaled, or you may have a &#8220;package&#8221; service price. In either case you must compare <strong>what you actually recovered<\/strong> for all your full service compared to what you &#8220;quote&#8221;.<\/p>\n<p>These are just the beginnings of the process of &#8220;dissecting&#8221; your business, but certainly are what you MUST do for a complete and full understanding of how you set profit targets, pricing, and then track them through the year. There is much more to the process, but I can guarantee you that just completing this exercise will help you understand your business much better than what you have in the past. And, it can start you on the path to <strong>improved profitability in your funeral business.<\/strong><\/p>\n<hr \/>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone\" src=\"\/wp-content\/uploads\/2021\/09\/Sidebar-A-Thumbnail.jpg\" alt=\"\" width=\"250\" height=\"175\" align=\"right\" \/><strong>Sidebar &#8220;A&#8221;.<\/strong> For simplification we have used just the contribution from adult casketed services as a demonstration. Partial services would lend positive and negative contributions accordingly, and it is implicit that for &#8216;Up Year&#8221; gains to be equal to &#8220;Down Year&#8221; losses, the funeral home manager has to have excellent statistical numbers, understanding the essential dynamics of retail and wholesale averages and ratios, and of all profit centers. Rocket science it is not, but you will never get there without the proper &#8220;Management Information&#8221; in addition to the &#8220;Financial.&#8221;<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignright\" src=\"\/wp-content\/uploads\/2021\/09\/Sidebar-B-Thumbnail.jpg\" alt=\"\" width=\"250\" height=\"175\" align=\"right\" \/><strong>Sidebar &#8220;B&#8221;.<\/strong> It is very simple. If you want to accurately calculate a profit, accurate cost knowledge is an absolute must. The cost of the casket and vault comes from an invoice. The cost of providing Service comes from accurately using statistical information of costs, ratios, volume trends, etc., along with correctly identifying the differences in &#8220;Cost of Goods&#8221; and &#8220;Operating Expenses&#8221;. (If these two are incorrectly mingled, the number you end up with is garbage.)<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A definition would be a good place to start. For the purpose of this discussion let us define &#8220;Management&#8221; as &#8220;The Administration of Success in Business&#8221;.<\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":"","inline_featured_image":false,"footnotes":""},"categories":[3],"tags":[],"class_list":["post-632","post","type-post","status-publish","format-standard","hentry","category-articles"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v21.0 (Yoast SEO v24.3) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Lets Talk About Management Services - by Dale Espich - Johnson Consulting Group<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.johnsonconsulting.com\/lets-talk-about-management-services-by-dale-espich\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Lets Talk About Management Services - by Dale Espich\" \/>\n<meta property=\"og:description\" content=\"A definition would be a good place to start. For the purpose of this discussion let us define &#8220;Management&#8221; as &#8220;The Administration of Success in Business&#8221;.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.johnsonconsulting.com\/lets-talk-about-management-services-by-dale-espich\/\" \/>\n<meta property=\"og:site_name\" content=\"Johnson Consulting Group\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/JohnsonConsulting\" \/>\n<meta property=\"article:published_time\" content=\"2009-10-16T19:51:20+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-09-07T07:54:18+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2011\/02\/dale-espich1.jpg\" \/>\n<meta name=\"author\" content=\"JCGAdmin\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@johnsonfuneral\" \/>\n<meta name=\"twitter:site\" content=\"@johnsonfuneral\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"JCGAdmin\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/lets-talk-about-management-services-by-dale-espich\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/lets-talk-about-management-services-by-dale-espich\/\"},\"author\":{\"name\":\"JCGAdmin\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/c9c70bea2fea0f478e05fa37ad0f930c\"},\"headline\":\"Lets Talk About Management Services &#8211; by Dale Espich\",\"datePublished\":\"2009-10-16T19:51:20+00:00\",\"dateModified\":\"2021-09-07T07:54:18+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/lets-talk-about-management-services-by-dale-espich\/\"},\"wordCount\":2214,\"publisher\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#organization\"},\"articleSection\":[\"Articles\"],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/lets-talk-about-management-services-by-dale-espich\/\",\"url\":\"https:\/\/www.johnsonconsulting.com\/lets-talk-about-management-services-by-dale-espich\/\",\"name\":\"Lets Talk About Management Services - by Dale Espich - Johnson Consulting Group\",\"isPartOf\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#website\"},\"datePublished\":\"2009-10-16T19:51:20+00:00\",\"dateModified\":\"2021-09-07T07:54:18+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/lets-talk-about-management-services-by-dale-espich\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.johnsonconsulting.com\/lets-talk-about-management-services-by-dale-espich\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/lets-talk-about-management-services-by-dale-espich\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.johnsonconsulting.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Lets Talk About Management Services &#8211; by Dale Espich\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#website\",\"url\":\"https:\/\/www.johnsonconsulting.com\/\",\"name\":\"Johnson Consulting Group\",\"description\":\"Funeral Home and Cemetery Consulting\",\"publisher\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.johnsonconsulting.com\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#organization\",\"name\":\"Johnson Consulting Group\",\"url\":\"https:\/\/www.johnsonconsulting.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png\",\"contentUrl\":\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png\",\"width\":576,\"height\":222,\"caption\":\"Johnson Consulting Group\"},\"image\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/JohnsonConsulting\",\"https:\/\/x.com\/johnsonfuneral\",\"https:\/\/www.linkedin.com\/company\/johnson-consulting-group\/\",\"https:\/\/www.youtube.com\/user\/JohnsonConsultingInc\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/c9c70bea2fea0f478e05fa37ad0f930c\",\"name\":\"JCGAdmin\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/5520c11611a67c1bcae496d454b34b8b?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/5520c11611a67c1bcae496d454b34b8b?s=96&d=mm&r=g\",\"caption\":\"JCGAdmin\"},\"url\":\"https:\/\/www.johnsonconsulting.com\/author\/jcgadmin\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Lets Talk About Management Services - by Dale Espich - Johnson Consulting Group","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.johnsonconsulting.com\/lets-talk-about-management-services-by-dale-espich\/","og_locale":"en_US","og_type":"article","og_title":"Lets Talk About Management Services - by Dale Espich","og_description":"A definition would be a good place to start. For the purpose of this discussion let us define &#8220;Management&#8221; as &#8220;The Administration of Success in Business&#8221;.","og_url":"https:\/\/www.johnsonconsulting.com\/lets-talk-about-management-services-by-dale-espich\/","og_site_name":"Johnson Consulting Group","article_publisher":"https:\/\/www.facebook.com\/JohnsonConsulting","article_published_time":"2009-10-16T19:51:20+00:00","article_modified_time":"2021-09-07T07:54:18+00:00","og_image":[{"url":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2011\/02\/dale-espich1.jpg","type":"","width":"","height":""}],"author":"JCGAdmin","twitter_card":"summary_large_image","twitter_creator":"@johnsonfuneral","twitter_site":"@johnsonfuneral","twitter_misc":{"Written by":"JCGAdmin","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.johnsonconsulting.com\/lets-talk-about-management-services-by-dale-espich\/#article","isPartOf":{"@id":"https:\/\/www.johnsonconsulting.com\/lets-talk-about-management-services-by-dale-espich\/"},"author":{"name":"JCGAdmin","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/c9c70bea2fea0f478e05fa37ad0f930c"},"headline":"Lets Talk About Management Services &#8211; by Dale Espich","datePublished":"2009-10-16T19:51:20+00:00","dateModified":"2021-09-07T07:54:18+00:00","mainEntityOfPage":{"@id":"https:\/\/www.johnsonconsulting.com\/lets-talk-about-management-services-by-dale-espich\/"},"wordCount":2214,"publisher":{"@id":"https:\/\/www.johnsonconsulting.com\/#organization"},"articleSection":["Articles"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/www.johnsonconsulting.com\/lets-talk-about-management-services-by-dale-espich\/","url":"https:\/\/www.johnsonconsulting.com\/lets-talk-about-management-services-by-dale-espich\/","name":"Lets Talk About Management Services - by Dale Espich - Johnson Consulting Group","isPartOf":{"@id":"https:\/\/www.johnsonconsulting.com\/#website"},"datePublished":"2009-10-16T19:51:20+00:00","dateModified":"2021-09-07T07:54:18+00:00","breadcrumb":{"@id":"https:\/\/www.johnsonconsulting.com\/lets-talk-about-management-services-by-dale-espich\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.johnsonconsulting.com\/lets-talk-about-management-services-by-dale-espich\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.johnsonconsulting.com\/lets-talk-about-management-services-by-dale-espich\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.johnsonconsulting.com\/"},{"@type":"ListItem","position":2,"name":"Lets Talk About Management Services &#8211; by Dale Espich"}]},{"@type":"WebSite","@id":"https:\/\/www.johnsonconsulting.com\/#website","url":"https:\/\/www.johnsonconsulting.com\/","name":"Johnson Consulting Group","description":"Funeral Home and Cemetery Consulting","publisher":{"@id":"https:\/\/www.johnsonconsulting.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.johnsonconsulting.com\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.johnsonconsulting.com\/#organization","name":"Johnson Consulting Group","url":"https:\/\/www.johnsonconsulting.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/","url":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png","contentUrl":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png","width":576,"height":222,"caption":"Johnson Consulting Group"},"image":{"@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/JohnsonConsulting","https:\/\/x.com\/johnsonfuneral","https:\/\/www.linkedin.com\/company\/johnson-consulting-group\/","https:\/\/www.youtube.com\/user\/JohnsonConsultingInc"]},{"@type":"Person","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/c9c70bea2fea0f478e05fa37ad0f930c","name":"JCGAdmin","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/5520c11611a67c1bcae496d454b34b8b?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/5520c11611a67c1bcae496d454b34b8b?s=96&d=mm&r=g","caption":"JCGAdmin"},"url":"https:\/\/www.johnsonconsulting.com\/author\/jcgadmin\/"}]}},"_links":{"self":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/posts\/632","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/comments?post=632"}],"version-history":[{"count":0,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/posts\/632\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/media?parent=632"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/categories?post=632"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/tags?post=632"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}