{"id":7540,"date":"2023-11-13T10:57:37","date_gmt":"2023-11-13T17:57:37","guid":{"rendered":"https:\/\/www.johnsonconsulting.com\/?p=7540"},"modified":"2024-03-28T12:42:27","modified_gmt":"2024-03-28T19:42:27","slug":"funeral-home-equity","status":"publish","type":"post","link":"https:\/\/www.johnsonconsulting.com\/funeral-home-equity\/","title":{"rendered":"Why Independent Funeral Home Owners Need to Think Like Private Equity"},"content":{"rendered":"<p>[et_pb_section fb_built=&#8221;1&#8243; admin_label=&#8221;section&#8221; _builder_version=&#8221;4.16&#8243; da_disable_devices=&#8221;off|off|off&#8221; global_colors_info=&#8221;{}&#8221; da_is_popup=&#8221;off&#8221; da_exit_intent=&#8221;off&#8221; da_has_close=&#8221;on&#8221; da_alt_close=&#8221;off&#8221; da_dark_close=&#8221;off&#8221; da_not_modal=&#8221;on&#8221; da_is_singular=&#8221;off&#8221; da_with_loader=&#8221;off&#8221; da_has_shadow=&#8221;on&#8221;][et_pb_row admin_label=&#8221;row&#8221; _builder_version=&#8221;4.16&#8243; background_size=&#8221;initial&#8221; background_position=&#8221;top_left&#8221; background_repeat=&#8221;repeat&#8221; global_colors_info=&#8221;{}&#8221;][et_pb_column type=&#8221;4_4&#8243; _builder_version=&#8221;4.16&#8243; custom_padding=&#8221;|||&#8221; global_colors_info=&#8221;{}&#8221; custom_padding__hover=&#8221;|||&#8221;][et_pb_text admin_label=&#8221;Text&#8221; _builder_version=&#8221;4.24.0&#8243; background_size=&#8221;initial&#8221; background_position=&#8221;top_left&#8221; background_repeat=&#8221;repeat&#8221; hover_enabled=&#8221;0&#8243; global_colors_info=&#8221;{}&#8221; sticky_enabled=&#8221;0&#8243;]<\/p>\n<p>Private equity controls somewhere in the range of 15% to 20% of the overall economy according to John Coates, former Acting Director for the Division of Corporate Finance for the SEC. And private equity exists in the death care profession for a reason: there are returns available, there are attractive acquisitions to be made, and there is ample room for technological change to be leveraged. Independent funeral homes are operating in an investment space that big dollars want to be in. Is this a threat or an opportunity? When asked about the future of our profession, a colleague of mine often says that “we are bullish on funeral service” – perhaps a comment aligned with vocabulary of private equity. But our optimism isn’t limited to private equity-backed firms. We are bullish on the independent operator as well. In this article, I’ll explain the sources and conditions of this optimism and some of the lessons independent operators can learn from private equity funeral home companies.<\/p>\n<p>&nbsp;<\/p>\n<p>Why the attention on private equity when publicly traded funeral service companies remain the giants of consolidation in our profession and independent operators still outnumber the publicly traded firms? The speed of entry and growth of new private equity groups in funeral service in recent years may be a factor. But I also believe that many private equity-backed companies have been successful in operating their firms in recent years and with that success comes attention from the rest of our profession. These companies will likely survive and continue to grow in funeral service not only because of their economies of scale and available capital but because of the experience of their management teams and their focus on fundamentals such as customer experience and financial performance. These companies look years into the future, clearly define their targets and desired outcomes, and strategically plan to achieve them. These companies often have a strategy for acquisitions and a strategy for the development of their people, processes, technology, and facilities. These companies are revolutionizing their customer experience. These are just a few of the areas of comparative advantage for companies with capital to invest. This does not mean that the independent operator cannot practice these strategies.<\/p>\n<p>&nbsp;<\/p>\n<p>The first way independent operators can practice thinking like private equity-backed firms is to have a strategic plan. Knowing where you are in your business lifecycle and planning effectively for the next stage is vital for success in the future of our profession. This means not only tracking your business’ value year to year but also crafting your succession plan. For many readers, this may mean identifying and developing a key employee that may have an interest in carrying on your firm’s legacy. Few funeral directors come out of mortuary school with the skillset to effectively serve families and even fewer are equipped to lead, manage, and operate a funeral home business. Conventions, conferences, leadership and management training programs, and good old-fashioned mentoring are all essential in developing future leaders for your business. Private equity-backed firms undoubtedly recognize the importance and value of developing people within their organization. An operation that is overly dependent on one or two people presents great risk to business growth, sustained profitability, and overall succession.<\/p>\n<p>&nbsp;<\/p>\n<p>By building a team that can operate the day-to-day business of the firm, independent funeral home operators can create capacity for themselves to focus on strategic growth initiatives such as acquisitions and key relationships. Private equity-backed firms often have multiple people on their management team devoted to business development and acquisitions. This is a hat the independent operator must wear for their own business. Building relationships with funeral home owners in neighboring markets and seeking out opportunities for acquisition is an important component in long-term growth and sustainability. As the pressure on profit margin increases, key acquisitions represent an opportunity to synergize multiple rooftops with shared operating expenses. Just as private equity firms often utilize leverage for acquisitions, it’s also worth reviewing your own capital structure regularly to evaluate the appropriate time for refinancing, utilizing lines of credit, and other financial services.<\/p>\n<p>&nbsp;<\/p>\n<p>Even with a clearly identified succession plan, independent funeral home companies must think like private equity by continuing to develop their workplace culture, which is the foundation for exceptional customer service. Setting clear expectations, effective communication, and accountability management are all ingredients of an <a href=\"https:\/\/www.johnsonconsulting.com\/overcomequietquittingworries\/\" target=\"_blank\" rel=\"noopener\">optimum workplace environment<\/a> that promotes a performance culture. Establishing expectations at the funeral home starts with well-defined roles and responsibilities for every person on your team. Clarify your company goals and make sure they are specific and measurable. These goals can be derived from your operating budget which represents the financial needs of your company for long-term sustainability. Company goals must be relatable to each position on your team, however. Metrics such as call volume, average sale, or even the percentage of cremation cases with services can all be relatable goals for your funeral directors and team.<\/p>\n<p>&nbsp;<\/p>\n<p>Accountability often comes with a mistaken negative connotation, and this is largely due to the past experiences of many managers and employees. Perhaps some have been held accountable in the past in an inappropriate way while others have dealt with the uncomfortableness of attempting to hold people accountable with inadequate tools. One of the hidden strengths of private equity-backed death care companies is the accountability that exists throughout the organization. Shareholders hold the board of directors accountable, the board holds the management accountable, and the management holds employees accountable. This inherent culture of accountability yields a positive, performance-driven environment that achieves results. Independent operators need to intentionally create accountability practices to replicate this type of performance culture. Individual one-on-one meetings, employee reviews, and incentive compensation plans are all ingredients for the independent operator to utilize in promoting accountability. Finally, the use of a business coach or consultant can help create a level of accountability for owners that would otherwise only exist with a board of directors.<\/p>\n<p>&nbsp;<\/p>\n<p>The most relatable metrics for your team, and ones that private equity firms watch with extraordinary care, are the metrics related to customer experience. A common argument against private equity in the funeral space tends to focus on the claim that they prioritize financial performance over customer service. Experienced funeral home managers are often involved in operating these firms and these executives recognize that exceptional financial performance does not occur without exceptional customer service – at least not in the long run. They have analyzed the data and understand that their future call volume is dependent on the experiences their teams are providing to their client-families and guests today. Previously attending a service, online ratings, reputation, and coming highly recommended are all customer experience-based reasons people choose a funeral home (Figure 1). And these reasons in aggregate are considerable. Therefore, measuring customer experience through a metrics-based survey program is priority number one. Tracking <em>Net Promoter Score<\/em> and value indexes are simply part of the standard operating procedure. No risks are taken when it comes to the heritage a firm has with a family.<\/p>\n<p>Figure 1:<\/p>\n<p><a href=\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2023\/09\/Screenshot-2023-09-26-at-2.04.46-PM.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-7542 size-full\" src=\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2023\/09\/Screenshot-2023-09-26-at-2.04.46-PM.png\" alt=\"Chart showing the primary reasons for choosing a funeral home \" width=\"3058\" height=\"1116\" srcset=\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2023\/09\/Screenshot-2023-09-26-at-2.04.46-PM.png 3058w, https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2023\/09\/Screenshot-2023-09-26-at-2.04.46-PM-1280x467.png 1280w, https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2023\/09\/Screenshot-2023-09-26-at-2.04.46-PM-980x358.png 980w, https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2023\/09\/Screenshot-2023-09-26-at-2.04.46-PM-480x175.png 480w\" sizes=\"auto, (min-width: 0px) and (max-width: 480px) 480px, (min-width: 481px) and (max-width: 980px) 980px, (min-width: 981px) and (max-width: 1280px) 1280px, (min-width: 1281px) 3058px, 100vw\" \/><\/a><\/p>\n<p>Source: <a href=\"https:\/\/lp.constantcontactpages.com\/su\/wbJD0q4\/PTX2022\" target=\"_blank\" rel=\"noopener\">Johnson Consulting Group 2023 Trends &amp; Insights, Volume 6, 2023<\/a><\/p>\n<p>Our profession has two unique advantages when it comes to customer service and the experiences we provide to our client-families: 1. Our teams can rally around clear center-point values and 2. Funeral home employees are generally motivated by creating meaningful impacts in the lives of families in their community – in other words, they’re passionate about their work. While businesses in other industries often need to put considerable thought into their center-point values (what they stand for and why they exist), funeral homes know this intuitively. It’s generally some variation of: <em>compassionately celebrating lives and helping families heal while practicing integrity every step of the way<\/em>. The lost opportunity for many funeral homes is the failure to leverage these clear center-point values for the purpose of company alignment and training on employee service aptitude. This is a practice that the large death care companies and many private equity-backed firms do very well. Customer experience workshops and training are an ongoing investment, not a one-time expense.<\/p>\n<p>&nbsp;<\/p>\n<p>Ask five of your employees for an example of world-class customer service and you’ll likely get five different answers. For some it’s the experience of a 5-star hotel in a resort city half-way around the world, while for others it’s the service they receive at their favorite coffee shop, auto repair facility, or fast-food restaurant. In your employees’ personal lives, there’s absolutely no issue with these preferences and differences. But issues can arise when their personal standards of service begin to trickle into the delivery of service for your client families. Hence the value and necessity of clearly defined service standards for every stage of your client families’ journey with your firm. We consider these practices to be the “non-negotiables” that ensure a consistent experience for every family, year after year. Fostering this culture of world-class customer experience must originate at the top of any organization with an obsession-like passion for service. This is a reality many large funeral home companies know well and practice.<\/p>\n<p>&nbsp;<\/p>\n<p>By this point it should be clear that most private equity-backed funeral homes are exceptionally attentive to their performance in the fundamental areas of customer experience, the workplace environment, and marketplace strategy. But high performance in these three fundamental areas alone is not sufficient for future success in our profession. Attention to the details of your business’ financial performance is an absolute necessity. Gone are the days when operators could take care of their families and everything else would fall into place. With the rising cost of doing business and continued unfavorable shifts in case mix, long term success depends on consistent financial performance management – a habit known well by private equity-backed businesses.<\/p>\n<p>&nbsp;<\/p>\n<p>Fortunately, the habits and tools needed to manage financial performance regularly are no secret. Independent funeral home owners must first assess if they are able to measure their financial performance in a meaningful way. The profit and loss statement should provide information that allows management to make good decisions, not simply check that net income is in the black. This type of information is possible when the tools of budgeting and benchmarking are utilized. Monthly financial statements that are industry specific allow managers to benchmark or compare groups of expenses to the industry standard. Benchmarking is also valuable when it comes to measuring profitability or EBITDA (earnings before interest, taxes, depreciation, and amortization). If a firm is not achieving a healthy industry standard EBITDA of 26% &#8211; 31% of revenue, then a careful comparison of all expense categories to industry benchmark can help identify the potential areas of opportunity (Figure 2).<\/p>\n<p>Figure 2:<\/p>\n<p><a href=\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2023\/09\/figure-2.png\"><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-7543 size-full\" src=\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2023\/09\/figure-2.png\" alt=\"Chart showing funeral and cemetery 2023 financial performance benchmarks\" width=\"780\" height=\"475\" srcset=\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2023\/09\/figure-2.png 780w, https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2023\/09\/figure-2-480x292.png 480w\" sizes=\"auto, (min-width: 0px) and (max-width: 480px) 480px, (min-width: 481px) 780px, 100vw\" \/><\/a><\/p>\n<p>Source: Johnson Consulting Group Accounting and Merger &amp; Acquisition Data, 2023<\/p>\n<p>Remember that private equity-backed funeral homes have the hidden advantage of built-in accountability given their organizational structure. And this accountability most certainly applies to their financial performance. Independent operators can replicate this financial accountability by using an operating budget and by partnering with a business coach or even joining a study group. An operating budget should outline targeted revenue objectives in the form of call volume and average contract value for all case types (traditional burial, direct cremation, etc.). Furthermore, it should forecast all operating expenses by general ledger account and expense category, so that at the beginning of every year your financial future is clear. Your targeted profitability is known, your targeted debt service coverage ratio is known, and your targeted cash flow is known.<\/p>\n<p>&nbsp;<\/p>\n<p>Although willing our financial projections into reality is not possible, managing towards the outcome of a well-crafted operating budget absolutely is. An operating budget is meant to be used – month to month and quarter to quarter – to know where our business has been, where it is, and where it’s going. Understanding and utilizing the levers of financial management is paramount. In driving revenue, these levers include pricing, which should be an annual exercise, and many forms of arranger training. Detailed sales analysis tools can allow managers to quickly identify the causes and remedies of arranger discrepancies in average contract value, frequency and average of merchandise selection, and even significant discrepancies in case mix percentages of direct cremation versus cremation with ceremony. Seemingly small actions, controls, and processes can result in thousands of dollars in additional top line revenue.<\/p>\n<p>&nbsp;<\/p>\n<p>Expense controls are a powerful tool for course correction and achieving targeted profitability. A $10,000 decrease in annual operating expense can equate to over $50,000 in increased enterprise value. By comparing expense categories to budget and industry benchmarks, the independent operator can better understand areas of opportunity for expense reduction. Whether they take the form of changes to the workflow of the business, vendor or ordering processes, a more detailed facility maintenance or advertising plan, expense controls have an important place in the financial management of a funeral home business. They are certainly part of the financial toolkit of private equity-backed firms – a toolkit that is robust, expansive, and effective. The good news for the independent operator is that nothing is preventing them from using those very same tools.<\/p>\n<p>&nbsp;<\/p>\n<p>In funeral service, the competitive marketplace in which we operate is often on our mind. New low-cost competition, competitor advertising and promotional strategies, and changes in the ownership of current competitors tend to usurp a great deal of our grey matter. In the end, though, the actions of our competitors – whether they’re owned by private equity or not – are largely out of our control. The choice of the independent operator is how to react. At Johnson Consulting Group, we are bullish on the independent funeral home operator, so long as they see and act on the opportunities that we do. Private equity in the death care profession is a fact. The real question is whether you see it as an opportunity.<\/p>\n<a href='https:\/\/www.johnsonconsulting.com\/contact-us\/' class='big-button bigblue' target=\"_blank\">Grow With JCG Today<\/a>\n<p>[\/et_pb_text][\/et_pb_column][\/et_pb_row][\/et_pb_section]<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Private equity controls somewhere in the range of 15% to 20% of the overall economy according to John Coates, former Acting Director for the Division of Corporate Finance for the SEC. And private equity exists in the death care profession for a reason: there are returns available, there are attractive acquisitions to be made, and there is ample room for technological change to be leveraged.<\/p>\n","protected":false},"author":18,"featured_media":5714,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"_et_pb_use_builder":"on","_et_pb_old_content":"Private equity controls somewhere in the range of 15% to 20% of the overall economy according to John Coates, former Acting Director for the Division of Corporate Finance for the SEC. And private equity exists in the death care profession for a reason: there are returns available, there are attractive acquisitions to be made, and there is ample room for technological change to be leveraged. Independent funeral homes are operating in an investment space that big dollars want to be in. Is this a threat or an opportunity? When asked about the future of our profession, a colleague of mine often says that “we are bullish on funeral service” – perhaps a comment aligned with vocabulary of private equity. But our optimism isn’t limited to private equity-backed firms. We are bullish on the independent operator as well. In this article, I’ll explain the sources and conditions of this optimism and some of the lessons independent operators can learn from private equity funeral home companies.\r\n\r\nWhy the attention on private equity when publicly traded funeral service companies remain the giants of consolidation in our profession and independent operators still outnumber the publicly traded firms? The speed of entry and growth of new private equity groups in funeral service in recent years may be a factor. But I also believe that many private equity-backed companies have been successful in operating their firms in recent years and with that success comes attention from the rest of our profession. These companies will likely survive and continue to grow in funeral service not only because of their economies of scale and available capital but because of the experience of their management teams and their focus on fundamentals such as customer experience and financial performance. These companies look years into the future, clearly define their targets and desired outcomes, and strategically plan to achieve them. These companies often have a strategy for acquisitions and a strategy for the development of their people, processes, technology, and facilities. These companies are revolutionizing their customer experience. These are just a few of the areas of comparative advantage for companies with capital to invest. This does not mean that the independent operator cannot practice these strategies.\r\n\r\nThe first way independent operators can practice thinking like private equity-backed firms is to have a strategic plan. Knowing where you are in your business lifecycle and planning effectively for the next stage is vital for success in the future of our profession. This means not only tracking your business’ value year to year but also crafting your succession plan. For many readers, this may mean identifying and developing a key employee that may have an interest in carrying on your firm’s legacy. Few funeral directors come out of mortuary school with the skillset to effectively serve families and even fewer are equipped to lead, manage, and operate a funeral home business. Conventions, conferences, leadership and management training programs, and good old-fashioned mentoring are all essential in developing future leaders for your business. Private equity-backed firms undoubtedly recognize the importance and value of developing people within their organization. An operation that is overly dependent on one or two people presents great risk to business growth, sustained profitability, and overall succession.\r\n\r\nBy building a team that can operate the day-to-day business of the firm, independent funeral home operators can create capacity for themselves to focus on strategic growth initiatives such as acquisitions and key relationships. Private equity-backed firms often have multiple people on their management team devoted to business development and acquisitions. This is a hat the independent operator must wear for their own business. Building relationships with funeral home owners in neighboring markets and seeking out opportunities for acquisition is an important component in long-term growth and sustainability. As the pressure on profit margin increases, key acquisitions represent an opportunity to synergize multiple rooftops with shared operating expenses. Just as private equity firms often utilize leverage for acquisitions, it’s also worth reviewing your own capital structure regularly to evaluate the appropriate time for refinancing, utilizing lines of credit, and other financial services.\r\n\r\nEven with a clearly identified succession plan, independent funeral home companies must think like private equity by continuing to develop their workplace culture, which is the foundation for exceptional customer service. Setting clear expectations, effective communication, and accountability management are all ingredients of an <a href=\"https:\/\/www.johnsonconsulting.com\/overcomequietquittingworries\/\" target=\"_blank\" rel=\"noopener\">optimum workplace environment<\/a> that promotes a performance culture. Establishing expectations at the funeral home starts with well-defined roles and responsibilities for every person on your team. Clarify your company goals and make sure they are specific and measurable. These goals can be derived from your operating budget which represents the financial needs of your company for long-term sustainability. Company goals must be relatable to each position on your team, however. Metrics such as call volume, average sale, or even the percentage of cremation cases with services can all be relatable goals for your funeral directors and team.\r\n\r\nAccountability often comes with a mistaken negative connotation, and this is largely due to the past experiences of many managers and employees. Perhaps some have been held accountable in the past in an inappropriate way while others have dealt with the uncomfortableness of attempting to hold people accountable with inadequate tools. One of the hidden strengths of private equity-backed death care companies is the accountability that exists throughout the organization. Shareholders hold the board of directors accountable, the board holds the management accountable, and the management holds employees accountable. This inherent culture of accountability yields a positive, performance-driven environment that achieves results. Independent operators need to intentionally create accountability practices to replicate this type of performance culture. Individual one-on-one meetings, employee reviews, and incentive compensation plans are all ingredients for the independent operator to utilize in promoting accountability. Finally, the use of a business coach or consultant can help create a level of accountability for owners that would otherwise only exist with a board of directors.\r\n\r\nThe most relatable metrics for your team, and ones that private equity firms watch with extraordinary care, are the metrics related to customer experience. A common argument against private equity in the funeral space tends to focus on the claim that they prioritize financial performance over customer service. Experienced funeral home managers are often involved in operating these firms and these executives recognize that exceptional financial performance does not occur without exceptional customer service – at least not in the long run. They have analyzed the data and understand that their future call volume is dependent on the experiences their teams are providing to their client-families and guests today. Previously attending a service, online ratings, reputation, and coming highly recommended are all customer experience-based reasons people choose a funeral home (Figure 1). And these reasons in aggregate are considerable. Therefore, measuring customer experience through a metrics-based survey program is priority number one. Tracking <em>Net Promoter Score<\/em> and value indexes are simply part of the standard operating procedure. No risks are taken when it comes to the heritage a firm has with a family.\r\n\r\nFigure 1:\r\n\r\n<a href=\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2023\/09\/Screenshot-2023-09-26-at-2.04.46-PM.png\"><img class=\"aligncenter wp-image-7542 size-full\" src=\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2023\/09\/Screenshot-2023-09-26-at-2.04.46-PM.png\" alt=\"Chart showing the primary reasons for choosing a funeral home \" width=\"3058\" height=\"1116\" \/><\/a>\r\n\r\nSource: <a href=\"https:\/\/lp.constantcontactpages.com\/su\/wbJD0q4\/PTX2022\" target=\"_blank\" rel=\"noopener\">Johnson Consulting Group 2023 Trends & Insights, Volume 6, 2023<\/a>\r\n\r\nOur profession has two unique advantages when it comes to customer service and the experiences we provide to our client-families: 1. Our teams can rally around clear center-point values and 2. Funeral home employees are generally motivated by creating meaningful impacts in the lives of families in their community – in other words, they’re passionate about their work. While businesses in other industries often need to put considerable thought into their center-point values (what they stand for and why they exist), funeral homes know this intuitively. It’s generally some variation of: <em>compassionately celebrating lives and helping families heal while practicing integrity every step of the way<\/em>. The lost opportunity for many funeral homes is the failure to leverage these clear center-point values for the purpose of company alignment and training on employee service aptitude. This is a practice that the large death care companies and many private equity-backed firms do very well. Customer experience workshops and training are an ongoing investment, not a one-time expense.\r\n\r\nAsk five of your employees for an example of world-class customer service and you’ll likely get five different answers. For some it’s the experience of a 5-star hotel in a resort city half-way around the world, while for others it’s the service they receive at their favorite coffee shop, auto repair facility, or fast-food restaurant. In your employees’ personal lives, there’s absolutely no issue with these preferences and differences. But issues can arise when their personal standards of service begin to trickle into the delivery of service for your client families. Hence the value and necessity of clearly defined service standards for every stage of your client families’ journey with your firm. We consider these practices to be the “non-negotiables” that ensure a consistent experience for every family, year after year. Fostering this culture of world-class customer experience must originate at the top of any organization with an obsession-like passion for service. This is a reality many large funeral home companies know well and practice.\r\n\r\nBy this point it should be clear that most private equity-backed funeral homes are exceptionally attentive to their performance in the fundamental areas of customer experience, the workplace environment, and marketplace strategy. But high performance in these three fundamental areas alone is not sufficient for future success in our profession. Attention to the details of your business’ financial performance is an absolute necessity. Gone are the days when operators could take care of their families and everything else would fall into place. With the rising cost of doing business and continued unfavorable shifts in case mix, long term success depends on consistent financial performance management – a habit known well by private equity-backed businesses.\r\n\r\nFortunately, the habits and tools needed to manage financial performance regularly are no secret. Independent funeral home owners must first assess if they are able to measure their financial performance in a meaningful way. The profit and loss statement should provide information that allows management to make good decisions, not simply check that net income is in the black. This type of information is possible when the tools of budgeting and benchmarking are utilized. Monthly financial statements that are industry specific allow managers to benchmark or compare groups of expenses to the industry standard. Benchmarking is also valuable when it comes to measuring profitability or EBITDA (earnings before interest, taxes, depreciation, and amortization). If a firm is not achieving a healthy industry standard EBITDA of 26% - 31% of revenue, then a careful comparison of all expense categories to industry benchmark can help identify the potential areas of opportunity (Figure 2).\r\n\r\nFigure 2:\r\n\r\n<a href=\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2023\/09\/figure-2.png\"><img class=\"aligncenter wp-image-7543 size-full\" src=\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2023\/09\/figure-2.png\" alt=\"Chart showing funeral and cemetery 2023 financial performance benchmarks\" width=\"780\" height=\"475\" \/><\/a>\r\n\r\nSource: Johnson Consulting Group Accounting and Merger & Acquisition Data, 2023\r\n\r\nRemember that private equity-backed funeral homes have the hidden advantage of built-in accountability given their organizational structure. And this accountability most certainly applies to their financial performance. Independent operators can replicate this financial accountability by using an operating budget and by partnering with a business coach or even joining a study group. An operating budget should outline targeted revenue objectives in the form of call volume and average contract value for all case types (traditional burial, direct cremation, etc.). Furthermore, it should forecast all operating expenses by general ledger account and expense category, so that at the beginning of every year your financial future is clear. Your targeted profitability is known, your targeted debt service coverage ratio is known, and your targeted cash flow is known.\r\n\r\nAlthough willing our financial projections into reality is not possible, managing towards the outcome of a well-crafted operating budget absolutely is. An operating budget is meant to be used – month to month and quarter to quarter – to know where our business has been, where it is, and where it’s going. Understanding and utilizing the levers of financial management is paramount. In driving revenue, these levers include pricing, which should be an annual exercise, and many forms of arranger training. Detailed sales analysis tools can allow managers to quickly identify the causes and remedies of arranger discrepancies in average contract value, frequency and average of merchandise selection, and even significant discrepancies in case mix percentages of direct cremation versus cremation with ceremony. Seemingly small actions, controls, and processes can result in thousands of dollars in additional top line revenue.\r\n\r\nExpense controls are a powerful tool for course correction and achieving targeted profitability. A $10,000 decrease in annual operating expense can equate to over $50,000 in increased enterprise value. By comparing expense categories to budget and industry benchmarks, the independent operator can better understand areas of opportunity for expense reduction. Whether they take the form of changes to the workflow of the business, vendor or ordering processes, a more detailed facility maintenance or advertising plan, expense controls have an important place in the financial management of a funeral home business. They are certainly part of the financial toolkit of private equity-backed firms – a toolkit that is robust, expansive, and effective. The good news for the independent operator is that nothing is preventing them from using those very same tools.\r\n\r\nIn funeral service, the competitive marketplace in which we operate is often on our mind. New low-cost competition, competitor advertising and promotional strategies, and changes in the ownership of current competitors tend to usurp a great deal of our grey matter. In the end, though, the actions of our competitors – whether they’re owned by private equity or not – are largely out of our control. The choice of the independent operator is how to react. At Johnson Consulting Group, we are bullish on the independent funeral home operator, so long as they see and act on the opportunities that we do. Private equity in the death care profession is a fact. The real question is whether you see it as an opportunity.","_et_gb_content_width":"","inline_featured_image":false,"footnotes":""},"categories":[4,53],"tags":[54,49,69,50,63,10,13],"class_list":["post-7540","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-blog","category-business-management","tag-business-consulting","tag-business-tips","tag-funeral-homes","tag-jcg","tag-johnsonconsultinggroup","tag-buying-a-business","tag-funeral-business-management-consulting"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v21.0 (Yoast SEO v24.3) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Why Independent Funeral Home Owners Need to Think Like Private Equity - Johnson Consulting Group<\/title>\n<meta name=\"description\" content=\"Private equity in the space can be seen as a threat or opportunity. Learn how independent funeral home owners can see the positives of it.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.johnsonconsulting.com\/funeral-home-equity\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Why Independent Funeral Home Owners Need to Think Like Private Equity\" \/>\n<meta property=\"og:description\" content=\"Private equity in the space can be seen as a threat or opportunity. Learn how independent funeral home owners can see the positives of it.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.johnsonconsulting.com\/funeral-home-equity\/\" \/>\n<meta property=\"og:site_name\" content=\"Johnson Consulting Group\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/JohnsonConsulting\" \/>\n<meta property=\"article:published_time\" content=\"2023-11-13T17:57:37+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-03-28T19:42:27+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2021\/05\/shutterstock_767180824-1024x683.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"683\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Vince Roberge\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@johnsonfuneral\" \/>\n<meta name=\"twitter:site\" content=\"@johnsonfuneral\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Vince Roberge\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/funeral-home-equity\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/funeral-home-equity\/\"},\"author\":{\"name\":\"Vince Roberge\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/71ba45fe51f53e3644fbe40ce30c50d1\"},\"headline\":\"Why Independent Funeral Home Owners Need to Think Like Private Equity\",\"datePublished\":\"2023-11-13T17:57:37+00:00\",\"dateModified\":\"2024-03-28T19:42:27+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/funeral-home-equity\/\"},\"wordCount\":2461,\"publisher\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/funeral-home-equity\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2021\/05\/shutterstock_767180824.jpg\",\"keywords\":[\"#business consulting\",\"#business tips\",\"#Funeral Homes\",\"#JCG\",\"#johnsonconsultinggroup\",\"Buying a Business\",\"Funeral Business Management Consulting\"],\"articleSection\":[\"Blog\",\"Business Management\"],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/funeral-home-equity\/\",\"url\":\"https:\/\/www.johnsonconsulting.com\/funeral-home-equity\/\",\"name\":\"Why Independent Funeral Home Owners Need to Think Like Private Equity - Johnson Consulting Group\",\"isPartOf\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/funeral-home-equity\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/funeral-home-equity\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2021\/05\/shutterstock_767180824.jpg\",\"datePublished\":\"2023-11-13T17:57:37+00:00\",\"dateModified\":\"2024-03-28T19:42:27+00:00\",\"description\":\"Private equity in the space can be seen as a threat or opportunity. Learn how independent funeral home owners can see the positives of it.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/funeral-home-equity\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.johnsonconsulting.com\/funeral-home-equity\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/funeral-home-equity\/#primaryimage\",\"url\":\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2021\/05\/shutterstock_767180824.jpg\",\"contentUrl\":\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2021\/05\/shutterstock_767180824.jpg\",\"width\":8688,\"height\":5792,\"caption\":\"funeral home owner looking at model houses holding an upwards trend line thinking about his equity\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/funeral-home-equity\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.johnsonconsulting.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Why Independent Funeral Home Owners Need to Think Like Private Equity\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#website\",\"url\":\"https:\/\/www.johnsonconsulting.com\/\",\"name\":\"Johnson Consulting Group\",\"description\":\"Funeral Home and Cemetery Consulting\",\"publisher\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.johnsonconsulting.com\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#organization\",\"name\":\"Johnson Consulting Group\",\"url\":\"https:\/\/www.johnsonconsulting.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png\",\"contentUrl\":\"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png\",\"width\":576,\"height\":222,\"caption\":\"Johnson Consulting Group\"},\"image\":{\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/JohnsonConsulting\",\"https:\/\/x.com\/johnsonfuneral\",\"https:\/\/www.linkedin.com\/company\/johnson-consulting-group\/\",\"https:\/\/www.youtube.com\/user\/JohnsonConsultingInc\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/71ba45fe51f53e3644fbe40ce30c50d1\",\"name\":\"Vince Roberge\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/430a547e043da98771ea5fcfbc0f7013?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/430a547e043da98771ea5fcfbc0f7013?s=96&d=mm&r=g\",\"caption\":\"Vince Roberge\"},\"url\":\"https:\/\/www.johnsonconsulting.com\/author\/vroberge\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Why Independent Funeral Home Owners Need to Think Like Private Equity - Johnson Consulting Group","description":"Private equity in the space can be seen as a threat or opportunity. Learn how independent funeral home owners can see the positives of it.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.johnsonconsulting.com\/funeral-home-equity\/","og_locale":"en_US","og_type":"article","og_title":"Why Independent Funeral Home Owners Need to Think Like Private Equity","og_description":"Private equity in the space can be seen as a threat or opportunity. Learn how independent funeral home owners can see the positives of it.","og_url":"https:\/\/www.johnsonconsulting.com\/funeral-home-equity\/","og_site_name":"Johnson Consulting Group","article_publisher":"https:\/\/www.facebook.com\/JohnsonConsulting","article_published_time":"2023-11-13T17:57:37+00:00","article_modified_time":"2024-03-28T19:42:27+00:00","og_image":[{"width":1024,"height":683,"url":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2021\/05\/shutterstock_767180824-1024x683.jpg","type":"image\/jpeg"}],"author":"Vince Roberge","twitter_card":"summary_large_image","twitter_creator":"@johnsonfuneral","twitter_site":"@johnsonfuneral","twitter_misc":{"Written by":"Vince Roberge","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.johnsonconsulting.com\/funeral-home-equity\/#article","isPartOf":{"@id":"https:\/\/www.johnsonconsulting.com\/funeral-home-equity\/"},"author":{"name":"Vince Roberge","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/71ba45fe51f53e3644fbe40ce30c50d1"},"headline":"Why Independent Funeral Home Owners Need to Think Like Private Equity","datePublished":"2023-11-13T17:57:37+00:00","dateModified":"2024-03-28T19:42:27+00:00","mainEntityOfPage":{"@id":"https:\/\/www.johnsonconsulting.com\/funeral-home-equity\/"},"wordCount":2461,"publisher":{"@id":"https:\/\/www.johnsonconsulting.com\/#organization"},"image":{"@id":"https:\/\/www.johnsonconsulting.com\/funeral-home-equity\/#primaryimage"},"thumbnailUrl":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2021\/05\/shutterstock_767180824.jpg","keywords":["#business consulting","#business tips","#Funeral Homes","#JCG","#johnsonconsultinggroup","Buying a Business","Funeral Business Management Consulting"],"articleSection":["Blog","Business Management"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/www.johnsonconsulting.com\/funeral-home-equity\/","url":"https:\/\/www.johnsonconsulting.com\/funeral-home-equity\/","name":"Why Independent Funeral Home Owners Need to Think Like Private Equity - Johnson Consulting Group","isPartOf":{"@id":"https:\/\/www.johnsonconsulting.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.johnsonconsulting.com\/funeral-home-equity\/#primaryimage"},"image":{"@id":"https:\/\/www.johnsonconsulting.com\/funeral-home-equity\/#primaryimage"},"thumbnailUrl":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2021\/05\/shutterstock_767180824.jpg","datePublished":"2023-11-13T17:57:37+00:00","dateModified":"2024-03-28T19:42:27+00:00","description":"Private equity in the space can be seen as a threat or opportunity. Learn how independent funeral home owners can see the positives of it.","breadcrumb":{"@id":"https:\/\/www.johnsonconsulting.com\/funeral-home-equity\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.johnsonconsulting.com\/funeral-home-equity\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.johnsonconsulting.com\/funeral-home-equity\/#primaryimage","url":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2021\/05\/shutterstock_767180824.jpg","contentUrl":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2021\/05\/shutterstock_767180824.jpg","width":8688,"height":5792,"caption":"funeral home owner looking at model houses holding an upwards trend line thinking about his equity"},{"@type":"BreadcrumbList","@id":"https:\/\/www.johnsonconsulting.com\/funeral-home-equity\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.johnsonconsulting.com\/"},{"@type":"ListItem","position":2,"name":"Why Independent Funeral Home Owners Need to Think Like Private Equity"}]},{"@type":"WebSite","@id":"https:\/\/www.johnsonconsulting.com\/#website","url":"https:\/\/www.johnsonconsulting.com\/","name":"Johnson Consulting Group","description":"Funeral Home and Cemetery Consulting","publisher":{"@id":"https:\/\/www.johnsonconsulting.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.johnsonconsulting.com\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.johnsonconsulting.com\/#organization","name":"Johnson Consulting Group","url":"https:\/\/www.johnsonconsulting.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/","url":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png","contentUrl":"https:\/\/www.johnsonconsulting.com\/wp-content\/uploads\/2020\/03\/JCG-Logo.png","width":576,"height":222,"caption":"Johnson Consulting Group"},"image":{"@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/JohnsonConsulting","https:\/\/x.com\/johnsonfuneral","https:\/\/www.linkedin.com\/company\/johnson-consulting-group\/","https:\/\/www.youtube.com\/user\/JohnsonConsultingInc"]},{"@type":"Person","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/71ba45fe51f53e3644fbe40ce30c50d1","name":"Vince Roberge","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.johnsonconsulting.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/430a547e043da98771ea5fcfbc0f7013?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/430a547e043da98771ea5fcfbc0f7013?s=96&d=mm&r=g","caption":"Vince Roberge"},"url":"https:\/\/www.johnsonconsulting.com\/author\/vroberge\/"}]}},"_links":{"self":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/posts\/7540","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/users\/18"}],"replies":[{"embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/comments?post=7540"}],"version-history":[{"count":0,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/posts\/7540\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/media\/5714"}],"wp:attachment":[{"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/media?parent=7540"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/categories?post=7540"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.johnsonconsulting.com\/wp-json\/wp\/v2\/tags?post=7540"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}